////////////////////////////////////////////////////////////////////////////////
// Форма настроек редактора кода
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.НеДоступноОтключениеРедактора Тогда
		Элементы.ИспользоватьРедактор.Доступность = Ложь;
	КонецЕсли;
	
	ЗагрузитьНастройкиНаСервере();
	
	ОбновитьДоступностьПоддержкиФорматов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Заголовок = ?(ВладелецФормы = Неопределено, "Общие", "Форма");
	
	Если ВладелецФормы <> Неопределено И Параметры.АдресНастройкиКонфигурации = Неопределено Тогда
		// Настройки конфигурации для формы не переданы и не редактируются
		Элементы.СтраницаКонфигурация.Видимость = Ложь;
	КонецЕсли;
	
	Если ВладелецФормы <> Неопределено Тогда
		// Служебные настройки редактируются только как глобальные
		Элементы.СтраницаСлужебные.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	СтандартнаяОбработка = Ложь;
	
	Если ЗавершениеРаботы Тогда
		ТекстПредупреждения = "Данные были изменены. Все изменения будут потеряны!";
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПередЗакрытиемОбработчик", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемОбработчик() Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещения, "Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьНастройки();
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Асинх Процедура ПутьКИсходникамКонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Каталог = ПутьКИсходникамКонфигурации;
	
	Файлы = Ждать ДиалогВыбора.ВыбратьАсинх();
	
	Если Файлы <> Неопределено И Файлы.Количество() > 0 Тогда
		ПутьКИсходникамКонфигурации = Файлы[0];
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПутьКИсходникамРасширенийПутьКИсходникамРасширенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Каталог = Элементы.ПутьКИсходникамРасширений.ТекущиеДанные.ПутьКИсходникамРасширения;
	
	Файлы = Ждать ДиалогВыбора.ВыбратьАсинх();
	
	Если Файлы <> Неопределено И Файлы.Количество() > 0 Тогда
		Элементы.ПутьКИсходникамРасширений.ТекущиеДанные.ПутьКИсходникамРасширения = Файлы[0];
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПутьКШаблонамКодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВыборПутиКШаблонамКодаЗавершение", ЭтотОбъект);
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.Фильтр = "Файл шаблонов (*.st)|*.st";
	ДиалогВыбора.Каталог = ПутьКШаблонамКода;
	
	Файлы = Ждать ДиалогВыбора.ВыбратьАсинх();
	
	Если Файлы <> Неопределено И Файлы.Количество() > 0 Тогда
		ПутьКШаблонамКода = Файлы[0];
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Если Модифицированность Тогда
		СохранитьНастройки();
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура МакетРедактораПриИзменении(Элемент)
	
	ОбновитьДоступностьПоддержкиФорматов(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНастройкиНаСервере()
	
	Если Параметры.ИспользоватьРедактор = Неопределено Тогда
		ИспользоватьРедактор = рк_РедакторКода.ИспользоватьРедактор();
	Иначе
		ИспользоватьРедактор = Параметры.ИспользоватьРедактор;
	КонецЕсли;
	
	Если Параметры.ПодсказкаПоМетаданным = Неопределено Тогда
		ПодсказкаПоМетаданным = рк_РедакторКода.ПодсказкаПоМетаданным();
	Иначе
		ПодсказкаПоМетаданным = Параметры.ПодсказкаПоМетаданным;
	КонецЕсли;
	
	Если Параметры.АдресНастройки = Неопределено Тогда
		Настройки = рк_РедакторКода.Настройки();
	Иначе
		Настройки = ПолучитьИзВременногоХранилища(Параметры.АдресНастройки);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки);
	
	Если Параметры.АдресНастройкиКонфигурации = Неопределено Тогда
		НастройкиКонфигурации = рк_РедакторКода.НастройкиКонфигурации();
	Иначе
		НастройкиКонфигурации = ПолучитьИзВременногоХранилища(Параметры.АдресНастройкиКонфигурации);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКонфигурации, , "ПутьКИсходникамРасширений");
	ФорматИсходников = ?(НастройкиКонфигурации.ЭтоИсходникиEDT, "EDT", "XML");
	Для Каждого ПутьКИсходникамРасширения Из НастройкиКонфигурации.ПутьКИсходникамРасширений Цикл
		ПутьКИсходникамРасширений.Добавить().ПутьКИсходникамРасширения = ПутьКИсходникамРасширения;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, рк_РедакторКода.СлужебныеНастройки());
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки()
	
	Оповещения = СохранитьНастройкиНаСервере();
	
	Для Каждого КлючИЗначение Из Оповещения Цикл
		Оповестить(КлючИЗначение.Ключ, КлючИЗначение.Значение, ВладелецФормы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СохранитьНастройкиНаСервере()
	
	// Служебные настройки
	
	СлужебныеНастройки = рк_РедакторКода.НовыеСлужебныеНастройки();
	ЗаполнитьЗначенияСвойств(СлужебныеНастройки, ЭтотОбъект);
	рк_РедакторКода.СлужебныеНастройки(СлужебныеНастройки);
	
	// Подготовка настроек
	
	Настройки = рк_РедакторКода.НовыеНастройки();
	ЗаполнитьЗначенияСвойств(Настройки, ЭтотОбъект);
	
	НастройкиКонфигурации = рк_РедакторКода.НовыеНастройкиКонфигурации();
	ЗаполнитьЗначенияСвойств(НастройкиКонфигурации, ЭтотОбъект,, "ПутьКИсходникамКонфигурации,ПутьКИсходникамРасширений");
	НастройкиКонфигурации.ЭтоИсходникиEDT = (ФорматИсходников = "EDT");
	НастройкиКонфигурации.ПутьКИсходникамКонфигурации = рк_РедакторКодаКлиентСервер.НормализоватьПутьФайла(ПутьКИсходникамКонфигурации);
	Для Каждого СтрокаРасширения Из ПутьКИсходникамРасширений Цикл
		НастройкиКонфигурации.ПутьКИсходникамРасширений.Добавить(рк_РедакторКодаКлиентСервер.НормализоватьПутьФайла(СтрокаРасширения.ПутьКИсходникамРасширения));
	КонецЦикла;
	
	// Определение измененных настроек
	
	Если Параметры.ИспользоватьРедактор = Неопределено Тогда
		ИзменениеИспользованиеРедактора = ИспользоватьРедактор <> рк_РедакторКода.ИспользоватьРедактор();
	Иначе
		ИзменениеИспользованиеРедактора = ИспользоватьРедактор <> Параметры.ИспользоватьРедактор;
	КонецЕсли;
	
	Если Параметры.ПодсказкаПоМетаданным = Неопределено Тогда
		ИзменениеПодсказкаПоМетаданным = ПодсказкаПоМетаданным <> рк_РедакторКода.ПодсказкаПоМетаданным();
	Иначе
		ИзменениеПодсказкаПоМетаданным = ПодсказкаПоМетаданным <> Параметры.ПодсказкаПоМетаданным;
	КонецЕсли;
	
	Если Параметры.АдресНастройки = Неопределено Тогда
		ТекущиеНастройки = рк_РедакторКода.Настройки();
	Иначе
		ТекущиеНастройки = ПолучитьИзВременногоХранилища(Параметры.АдресНастройки);
	КонецЕсли;
	ИзменениеНастройки = Ложь;
	Для Каждого КлючИЗначение Из ТекущиеНастройки Цикл
		Если КлючИЗначение.Значение <> Настройки[КлючИЗначение.Ключ] Тогда
			ИзменениеНастройки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Параметры.АдресНастройкиКонфигурации = Неопределено Тогда
		ТекущиеНастройкиКонфигурации = рк_РедакторКода.НастройкиКонфигурации();
	Иначе
		ТекущиеНастройкиКонфигурации = ПолучитьИзВременногоХранилища(Параметры.АдресНастройкиКонфигурации);
	КонецЕсли;
	ИзменениеНастройкиКонфигурации =
			ТекущиеНастройкиКонфигурации.ВнешниеМетаданные <> НастройкиКонфигурации.ВнешниеМетаданные
		ИЛИ ТекущиеНастройкиКонфигурации.ЭтоИсходникиEDT <> НастройкиКонфигурации.ЭтоИсходникиEDT
		ИЛИ ТекущиеНастройкиКонфигурации.ПутьКИсходникамКонфигурации <> НастройкиКонфигурации.ПутьКИсходникамКонфигурации
		ИЛИ ТекущиеНастройкиКонфигурации.ПутьКИсходникамРасширений.Количество() <> НастройкиКонфигурации.ПутьКИсходникамРасширений.Количество()
		ИЛИ СтрСоединить(ТекущиеНастройкиКонфигурации.ПутьКИсходникамРасширений, "#") <> СтрСоединить(НастройкиКонфигурации.ПутьКИсходникамРасширений, "#");
	
	// Сохранение измененных настроек и подготовка списка оповещений
	
	Оповещения = Новый Структура;
	
	Если ИзменениеИспользованиеРедактора Тогда
		Если Параметры.ИспользоватьРедактор = Неопределено Тогда
			рк_РедакторКода.ИспользоватьРедактор(ИспользоватьРедактор);
		КонецЕсли;
		Оповещения.Вставить("рк_ИзменениеИспользоватьРедактор", ИспользоватьРедактор);
	КонецЕсли;
	
	Если ИзменениеПодсказкаПоМетаданным Тогда
		Если Параметры.ПодсказкаПоМетаданным = Неопределено Тогда
			рк_РедакторКода.ПодсказкаПоМетаданным(ПодсказкаПоМетаданным);
		КонецЕсли;
		Оповещения.Вставить("рк_ИзменениеПодсказкаПоМетаданным", ПодсказкаПоМетаданным);
	КонецЕсли;
	
	Если ИзменениеНастройки Тогда
		Оповещения.Вставить("рк_ИзменениеНастройки");
		Если Параметры.АдресНастройки = Неопределено Тогда
			рк_РедакторКода.Настройки(Настройки);
		Иначе
			ПоместитьВоВременноеХранилище(Настройки, Параметры.АдресНастройки);
		КонецЕсли;
	КонецЕсли;
	
	Если ИзменениеНастройкиКонфигурации Тогда
		Оповещения.Вставить("рк_ИзменениеНастройкиКонфигурации");
		Если Параметры.АдресНастройкиКонфигурации = Неопределено Тогда
			рк_РедакторКода.НастройкиКонфигурации(НастройкиКонфигурации);
		Иначе
			ПоместитьВоВременноеХранилище(НастройкиКонфигурации, Параметры.АдресНастройкиКонфигурации);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Оповещения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДоступностьПоддержкиФорматов(Форма)
	
	// В упакованном редакторе уже добавлены скрипты поддержки всех форматов
	
	Форма.Элементы.ГруппаПоддержкаФорматов.Доступность = (Форма.МакетРедактора <> "рк_РедакторКодаУпакованный");
	
	Если Форма.МакетРедактора = "рк_РедакторКодаУпакованный" Тогда
		Форма.ПоддержкаJSON = Истина;
		Форма.ПоддержкаXML = Истина;
		Форма.ПоддержкаYAML = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
