// Создает дополнительные реквизиты для контекстной подсказки, создает на закладках обработчиков 
// элементы выбора конфигураций (источника или приемника) и поля HTML-документов
//
// Параметры:
//  Форма
//  Отказ
//  ЭтоКонвертацияXDTO
//  Обработчики - Массив - массив имен реквизитов с текстом обработчиков
//  СтраницыОбработчиков
//
Процедура ПриСозданииНаСервере(Форма, Отказ, ЭтоКонвертацияXDTO, Обработчики, СтраницыОбработчиков) Экспорт
	
	ДобавитьРеквизитыФормы(Форма, ЭтоКонвертацияXDTO, Обработчики);
	ДобавитьЭлементыОбработчиков(Форма, Обработчики, СтраницыОбработчиков);
	
КонецПроцедуры

Процедура ДобавитьРеквизитыФормы(Форма, ЭтоКонвертацияXDTO, Обработчики)
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ДобавляемыРеквизиты = Новый Массив;
	ДобавляемыРеквизиты.Добавить(Новый РеквизитФормы("КД3_Обработчики", Новый ОписаниеТипов("СписокЗначений")));
	Форма.ИзменитьРеквизиты(ДобавляемыРеквизиты, Новый Массив);
	
КонецПроцедуры

Процедура ДобавитьЭлементыОбработчиков(Форма, Обработчики, СтраницыОбработчиков)
	
	Для Каждого ЭлементСписка Из Обработчики Цикл
		
		ИмяОбработчика = ЭлементСписка.Значение;
		ДляКорреспондента = ЭлементСписка.Пометка;
		
		ЭлементЭталон = Форма.Элементы[ИмяОбработчика];
		ЭлементЭталон.Видимость = Ложь;
		
		Элемент = Форма.Элементы["КД3_" + ИмяОбработчика];
		Элемент.Видимость = Истина;
		Элемент.ТолькоПросмотр = ЭлементЭталон.ТолькоПросмотр;
		
		Форма.КД3_Обработчики.Добавить(ИмяОбработчика,, ДляКорреспондента);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьФайлМакетаИсходников() Экспорт
	Возврат ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("КД3_src"));
КонецФункции

Функция ПодкаталогИсходников() Экспорт
	
	// Получение уникального идентификатора текущей ИБ
	УИД_ИБ = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("КД3", "УИД_ИБ");
	Если УИД_ИБ = Неопределено Тогда
		УИД_ИБ = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("КД3", УИД_ИБ, "УИД_ИБ");
	КонецЕсли;
	
	КаталогИсходников = "bsl_console" + СтрЗаменить(Метаданные.ОбщиеМакеты.КД3_src.Комментарий, ".", "") + "_" + УИД_ИБ;
	
	Возврат КаталогИсходников;
	
КонецФункции

Функция ЗагрузитьНастройки() Экспорт
	
	КлючНастроек = "КД3_Настройки";
	
	Настройки = Новый Структура;
	
	Настройки.Вставить("Тема", ХранилищеОбщихНастроек.Загрузить(КлючНастроек, "ИмяТемы"));
	Настройки.Вставить("ИмяТемы", ХранилищеОбщихНастроек.Загрузить(КлючНастроек, "Тема"));
	Настройки.Вставить("НеЗагружатьМетаданные", ХранилищеОбщихНастроек.Загрузить(КлючНастроек, "НеЗагружатьМетаданные"));
	Настройки.Вставить("НеОтображатьКартуКода", ХранилищеОбщихНастроек.Загрузить(КлючНастроек, "НеОтображатьКартуКода"));
	Настройки.Вставить("ПодсветкаЯзыкаЗапросов", ХранилищеОбщихНастроек.Загрузить(КлючНастроек, "ПодсветкаЯзыкаЗапросов"));
	Настройки.Вставить("УдалятьВременныеФайлыПриЗакрытии", ХранилищеОбщихНастроек.Загрузить(КлючНастроек, "УдалятьВременныеФайлыПриЗакрытии"));
	
	Если ПустаяСтрока(Настройки.Тема) Тогда
		Настройки.Тема = "bsl-white";
	КонецЕсли;
	Если ПустаяСтрока(Настройки.ИмяТемы) Тогда
		Настройки.ИмяТемы = Настройки.Тема;
	КонецЕсли;
	Если Настройки.НеЗагружатьМетаданные = Неопределено Тогда
		Настройки.НеЗагружатьМетаданные = Ложь;
	КонецЕсли;
	Если Настройки.НеОтображатьКартуКода = Неопределено Тогда
		Настройки.НеОтображатьКартуКода = Ложь;
	КонецЕсли;
	Если Настройки.ПодсветкаЯзыкаЗапросов = Неопределено Тогда
		Настройки.ПодсветкаЯзыкаЗапросов = Ложь;
	КонецЕсли;
	Если Настройки.УдалятьВременныеФайлыПриЗакрытии = Неопределено Тогда
		Настройки.УдалятьВременныеФайлыПриЗакрытии = Ложь;
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

Процедура СохранитьНастройки(Настройки) Экспорт
	
	КлючНастроек = "КД3_Настройки";
	
	ХранилищеОбщихНастроек.Сохранить(КлючНастроек, "Тема", Настройки.Тема);
	ХранилищеОбщихНастроек.Сохранить(КлючНастроек, "ИмяТемы", Настройки.ИмяТемы);
	ХранилищеОбщихНастроек.Сохранить(КлючНастроек, "НеЗагружатьМетаданные", Настройки.НеЗагружатьМетаданные);
	ХранилищеОбщихНастроек.Сохранить(КлючНастроек, "НеОтображатьКартуКода", Настройки.НеОтображатьКартуКода);
	ХранилищеОбщихНастроек.Сохранить(КлючНастроек, "ПодсветкаЯзыкаЗапросов", Настройки.ПодсветкаЯзыкаЗапросов);
	ХранилищеОбщихНастроек.Сохранить(КлючНастроек, "УдалятьВременныеФайлыПриЗакрытии", Настройки.УдалятьВременныеФайлыПриЗакрытии);
	
КонецПроцедуры
