
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	рк_РедакторКода.ОбработчикПриСозданииНаСервере(ЭтотОбъект, рк_РедакторКода.НовыеПараметрыИнициализации(Элементы.ПолеТекст, Элементы.ПолеHTML));
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	рк_РедакторКодаКлиент.ОбработчикОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРедактора(Команда)
	// Редактирование настроек редактора (включая настройки текущей конфигурации) без обновления глобальных настроек
	рк_РедакторКодаКлиент.ОткрытьНастройкиРедактора(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументСформирован(Элемент)
	рк_РедакторКодаКлиент.ОбработчикДокументСформирован(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	рк_РедакторКодаКлиент.ОбработчикПриНажатии(ЭтотОбъект, Элемент, ДанныеСобытия);
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРедакторТекст(Команда)
	// Так же можно переключить настроку "Использовать редактор" по кнопке "НастройкиРедактора"
	рк_РедакторКодаКлиент.ПереключитьРедакторыНаТекст(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРедакторHTML(Команда)
	// Так же можно переключить настроку "Использовать редактор" по кнопке "НастройкиРедактора"
	рк_РедакторКодаКлиент.ПереключитьРедакторыНаHTML(ЭтотОбъект);
КонецПроцедуры
