
&НаКлиенте
&После("ВыбранаКонвертация")
Процедура КД3_ВыбранаКонвертация(РезультатЗакрытия, ДополнительныеПараметры)
	// Обработка включения в состав конвертаций
	КД3_УправлениеФормойКлиент.ПриИзмененииКонвертаций(ЭтотОбъект, Ложь);
КонецПроцедуры

#Область ПодключаемыеОбработчики

//@skip-warning
&НаКлиенте
Процедура КД3_Подключаемый_ПриИзмененииКонфигурации(Элемент)
	КД3_УправлениеФормойКлиент.ОчиститьМетаданныеКонфигурации(ЭтотОбъект, Ложь);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура КД3_Подключаемый_ПриИзмененииКонфигурацииКорреспондента(Элемент)
	КД3_УправлениеФормойКлиент.ОчиститьМетаданныеКонфигурации(ЭтотОбъект, Истина);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура КД3_Подключаемый_ДокументСформирован(Элемент)
	КД3_УправлениеФормойКлиент.ИнициализацияРедактора(ЭтотОбъект, Элемент.Имя, Объект);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ИнициализацияМетаданных() Экспорт
	КД3_УправлениеФормойКлиент.ИнициализацияМетаданных(ЭтотОбъект, Ложь);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура КД3_Подключаемый_HTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	КД3_УправлениеФормойКлиент.ОбработатьСобытиеHTML(ЭтотОбъект, Элемент, ДанныеСобытия);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура КД3_Подключаемый_КомандаРедактора(Команда)
	КД3_УправлениеФормойКлиент.КомандаРедактора(ЭтотОбъект, Команда);
КонецПроцедуры

#КонецОбласти

#Область ЗаменяемыеОбработчики

//@skip-warning
&НаСервере
Процедура КД3_Подключаемый_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ПриСозданииНаСервере(Отказ, СтандартнаяОбработка); // Типовой
	
	Обработчики = Новый СписокЗначений;
	Обработчики.Добавить("ТекстЗапроса", , Объект.ИспользуетсяПриЗагрузке);
	
	КД3_УправлениеФормой.ПриСозданииНаСервере(ЭтотОбъект, Отказ, Ложь, "Запрос", Обработчики, Элементы.ТекстЗапроса);
	
	УстановитьДействие("ПриОткрытии", "КД3_Подключаемый_ПриОткрытииПосле");
	УстановитьДействие("ПередЗаписью", "КД3_Подключаемый_ПередЗаписьюПосле");
	УстановитьДействие("ОбработкаВыбора", "КД3_Подключаемый_ОбработкаВыбора");
	Элементы.ИспользуетсяПриЗагрузке.УстановитьДействие("ПриИзменении", "КД3_Подключаемый_ИспользуетсяПриЗагрузкеПриИзмененииПосле");
	
	Элементы.КД3_Конфигурация.Доступность = НЕ Объект.ИспользуетсяПриЗагрузке;
	Элементы.КД3_КонфигурацияКорреспондент.Доступность = Объект.ИспользуетсяПриЗагрузке;
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ПриОткрытииПосле(Отказ)
	ПриОткрытии(Отказ); // Типовой
	КД3_УправлениеФормойКлиент.ПриСменеСтраницы(ЭтотОбъект, "ТекстЗапроса");
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	КД3_УправлениеФормойКлиент.ПередЗаписью(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора); // Типовой
	// Обработка исключения из состава конвертаций
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		КД3_УправлениеФормойКлиент.ПриИзмененииКонвертаций(ЭтотОбъект, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ИспользуетсяПриЗагрузкеПриИзмененииПосле(Элемент)
	
	ЭтотОбъект.КД3_Обработчики[0].Пометка = Объект.ИспользуетсяПриЗагрузке;
	
	Элементы.КД3_Конфигурация.Доступность = НЕ Объект.ИспользуетсяПриЗагрузке;
	Элементы.КД3_КонфигурацияКорреспондент.Доступность = Объект.ИспользуетсяПриЗагрузке;
	
	КД3_УправлениеФормойКлиент.ОчиститьМетаданныеКонфигурации(ЭтотОбъект, Объект.ИспользуетсяПриЗагрузке);
	
КонецПроцедуры

#Если Сервер Тогда
КД3_УправлениеФормой.ПриПервомОткрытииФормы(ЭтотОбъект);
#КонецЕсли

#КонецОбласти
