
#Область ОбработчикиЭлементовФормы

&НаСервере
Процедура КД3_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	рк_РедакторКода.КД3_ОбработчикПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура КД3_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	рк_РедакторКода.ОбработчикПриЧтенииНаСервере(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КД3_ПриОткрытииПосле(Отказ)
	рк_РедакторКодаКлиент.КД3_ОбработчикПриОткрытии(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КД3_ОбработчикОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	рк_РедакторКодаКлиент.КД3_ОбработчикОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

&НаКлиенте
Процедура КД3_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	рк_РедакторКодаКлиент.ОбработчикПередЗаписью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КД3_ИспользуетсяПриЗагрузкеПриИзмененииПосле(Элемент)
	рк_РедакторКодаКлиент.КД3_ИспользуетсяПриЗагрузкеПриИзменении(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КД3_ОбработчикОжиданияПроверитьИзменениеОбъекта() Экспорт
	рк_РедакторКодаКлиент.ПроверитьИзменениеОбъекта(ЭтотОбъект, Объект.ВерсияДанных);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КД3_СтраницыОбработчикиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	рк_РедакторКодаКлиент.ОбработчикПриСменеСтраницы(ЭтотОбъект, ТекущаяСтраница);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовHTML

&НаКлиенте
Процедура Подключаемый_рк_ДокументСформирован(Элемент)
	рк_РедакторКодаКлиент.ОбработчикДокументСформирован(ЭтотОбъект, Элемент, Истина);
	ПодключитьОбработчикОжидания("КД3_ОбработчикОжиданияДокументСформированОтложено", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КД3_ОбработчикОжиданияДокументСформированОтложено()
	рк_РедакторКодаКлиент.ОбработчикДокументСформированОтложено(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_рк_ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	рк_РедакторКодаКлиент.ОбработчикПриНажатии(ЭтотОбъект, Элемент, ДанныеСобытия);
КонецПроцедуры

#КонецОбласти
