
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	рк_РедакторКода.ОбработчикПриСозданииНаСервере(ЭтотОбъект, Элементы.HTML);
КонецПроцедуры

&НаКлиенте
Процедура HTMLДокументСформирован(Элемент)
	рк_РедакторКодаКлиент.ОбработчикДокументСформирован(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура HTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	рк_РедакторКодаКлиент.ОбработчикПриНажатии(ЭтотОбъект, Элемент, ДанныеСобытия);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	рк_РедакторКодаКлиент.ОбработчикОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

&НаКлиенте
Процедура ГлобальныеНастройкиРедактора(Команда)
	
	рк_РедакторКодаКлиент.ОткрытьНастройкиРедактора();
	
	ОбщиеПараметры = рк_РедакторКодаКлиентСервер.ОбщиеПараметры(ЭтотОбъект);
	Если НЕ ОбщиеПараметры.ГлобальныеНастройки Тогда
		ПоказатьПредупреждение(,
			"Для формы заданы собственные настройки,
			|глобальные настройки применяться не будут!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛокальныеНастройкиРедактора(Команда)
	рк_РедакторКодаКлиент.ОткрытьНастройкиРедактора(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТестКод1С(Команда)
	Текст = ПолучитьТекстМакетаНаСервере("ТестКод");
	
	рк_РедакторКодаКлиент.ОчиститьТекст(ЭтотОбъект);
	рк_РедакторКодаКлиент.УстановитьТекст(ЭтотОбъект, Текст);
	рк_РедакторКодаКлиент.УстановитьРежимЯзыка(ЭтотОбъект, "bsl");
	
	Элементы.HTML.Заголовок = "HTML Код 1С";
КонецПроцедуры

&НаКлиенте
Процедура ТекстЗапрос1С(Команда)
	Текст = ПолучитьТекстМакетаНаСервере("ТестЗапрос");
	
	рк_РедакторКодаКлиент.ОчиститьТекст(ЭтотОбъект);
	рк_РедакторКодаКлиент.УстановитьТекст(ЭтотОбъект, Текст);
	рк_РедакторКодаКлиент.УстановитьРежимЯзыка(ЭтотОбъект, "bsl_query");
	
	Элементы.HTML.Заголовок = "HTML Запрос 1С";
КонецПроцедуры

&НаКлиенте
Процедура ТестСКД(Команда)
	Текст = ПолучитьТекстМакетаНаСервере("ТестСКД");
	
	рк_РедакторКодаКлиент.ОчиститьТекст(ЭтотОбъект);
	рк_РедакторКодаКлиент.УстановитьТекст(ЭтотОбъект, Текст);
	рк_РедакторКодаКлиент.УстановитьРежимЯзыка(ЭтотОбъект, "dcs_query");
	
	Элементы.HTML.Заголовок = "HTML СКД 1С";
КонецПроцедуры

&НаКлиенте
Процедура ТестXML(Команда)
	Текст = ПолучитьТекстМакетаНаСервере("ТестXML");
	
	рк_РедакторКодаКлиент.ОчиститьТекст(ЭтотОбъект);
	рк_РедакторКодаКлиент.УстановитьТекст(ЭтотОбъект, Текст);
	рк_РедакторКодаКлиент.УстановитьРежимЯзыка(ЭтотОбъект, "xml");
	
	Элементы.HTML.Заголовок = "HTML XML";
КонецПроцедуры

&НаКлиенте
Процедура ТестYAML(Команда)
	Текст = ПолучитьТекстМакетаНаСервере("ТестYAML");
	
	рк_РедакторКодаКлиент.ОчиститьТекст(ЭтотОбъект);
	рк_РедакторКодаКлиент.УстановитьТекст(ЭтотОбъект, Текст);
	рк_РедакторКодаКлиент.УстановитьРежимЯзыка(ЭтотОбъект, "yaml");
	
	Элементы.HTML.Заголовок = "HTML YAML";
КонецПроцедуры

&НаКлиенте
Процедура ТестJSON(Команда)
	Текст = ПолучитьТекстМакетаНаСервере("ТестJSON");
	
	рк_РедакторКодаКлиент.ОчиститьТекст(ЭтотОбъект);
	рк_РедакторКодаКлиент.УстановитьТекст(ЭтотОбъект, Текст);
	рк_РедакторКодаКлиент.УстановитьРежимЯзыка(ЭтотОбъект, "json");
	
	Элементы.HTML.Заголовок = "HTML JSON";
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстМакетаНаСервере(ИмяМакета)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
	
КонецФункции
