#Область Индексы_метаданных

Функция НастройкиКонфигурации(Конфигурация) Экспорт
	
	КэшНастроек = ПараметрыПриложения["КД3_НастройкиКонфигурации"];
	Если КэшНастроек = Неопределено Тогда
		КэшНастроек = Новый Соответствие;
		ПараметрыПриложения["КД3_НастройкиКонфигурации"] = КэшНастроек;
	КонецЕсли;
	
	НастройкиКонфигурации = КэшНастроек[Конфигурация];
	Если НастройкиКонфигурации = Неопределено Тогда
		НастройкиКонфигурации = КД3_Метаданные.НастройкиКонфигурации(Конфигурация);
		КэшНастроек.Вставить(Конфигурация, НастройкиКонфигурации);
	КонецЕсли;
	Возврат НастройкиКонфигурации;
	
КонецФункции

Функция СброситьНастройкиКонфигурацииВКэше(Конфигурация) Экспорт
	
	КэшНастроек = ПараметрыПриложения["КД3_НастройкиКонфигурации"];
	Если КэшНастроек <> Неопределено Тогда
		КэшНастроек.Вставить(Конфигурация, Неопределено);
	КонецЕсли;
	
КонецФункции

Функция ОписаниеМетаданных(Конфигурация, КлючКоллекции) Экспорт
	
	КэшКонфигурации = ПараметрыПриложения[Конфигурация];
	Если КэшКонфигурации = Неопределено Тогда
		КэшКонфигурации = Новый Соответствие;
		ПараметрыПриложения[Конфигурация] = КэшКонфигурации;
	КонецЕсли;
	
	ОписаниеМетаданных = КэшКонфигурации[КлючКоллекции];
	Если ОписаниеМетаданных = Неопределено Тогда
		ОписаниеМетаданных = КД3_Метаданные.ОписаниеМетаданных(Конфигурация, КлючКоллекции);
		Если ОписаниеМетаданных <> Неопределено Тогда
			КэшКонфигурации.Вставить(КлючКоллекции, ОписаниеМетаданных);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОписаниеМетаданных;
	
КонецФункции

Функция СброситьОписаниеМетаданныхВКэше(Конфигурация) Экспорт
	ПараметрыПриложения.Вставить(Конфигурация, Неопределено);
КонецФункции

#КонецОбласти
