#Область Индексы_метаданных

Функция НастройкиКонфигурации(Конфигурация) Экспорт
	
	КэшНастроек = ПараметрыПриложения["КД3_НастройкиКонфигурации"];
	Если КэшНастроек = Неопределено Тогда
		КэшНастроек = Новый Соответствие;
		ПараметрыПриложения["КД3_НастройкиКонфигурации"] = КэшНастроек;
	КонецЕсли;
	
	НастройкиКонфигурации = КэшНастроек[Конфигурация];
	Если НастройкиКонфигурации = Неопределено Тогда
		НастройкиКонфигурации = КД3_Метаданные.НастройкиКонфигурации(Конфигурация);
		КэшНастроек.Вставить(Конфигурация, НастройкиКонфигурации);
	КонецЕсли;
	Возврат НастройкиКонфигурации;
	
КонецФункции

Процедура СброситьНастройкиКонфигурацииВКэше(Конфигурация) Экспорт
	
	КэшНастроек = ПараметрыПриложения["КД3_НастройкиКонфигурации"];
	Если КэшНастроек <> Неопределено Тогда
		КэшНастроек.Вставить(Конфигурация, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеМетаданных(Конфигурация, КлючКоллекции) Экспорт
	
	КэшКонфигурации = ПараметрыПриложения[Конфигурация];
	Если КэшКонфигурации = Неопределено Тогда
		КэшКонфигурации = Новый Соответствие;
		ПараметрыПриложения[Конфигурация] = КэшКонфигурации;
	КонецЕсли;
	
	ОписаниеМетаданных = КэшКонфигурации[КлючКоллекции];
	Если ОписаниеМетаданных = Неопределено Тогда
		ОписаниеМетаданных = КД3_Метаданные.ОписаниеМетаданных(Конфигурация, КлючКоллекции);
		Если ОписаниеМетаданных <> Неопределено Тогда
			КэшКонфигурации.Вставить(КлючКоллекции, ОписаниеМетаданных);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОписаниеМетаданных;
	
КонецФункции

Функция ОписаниеСпискаМетаданных(Конфигурация, СписокМетаданных) Экспорт
	
	КэшКонфигурации = ПараметрыПриложения[Конфигурация];
	Если КэшКонфигурации = Неопределено Тогда
		КэшКонфигурации = Новый Соответствие;
		ПараметрыПриложения[Конфигурация] = КэшКонфигурации;
	КонецЕсли;
	
	ОписанияМетаданных = Новый Соответствие;
	ОписанияМетаданныхСервер = Новый Соответствие;
	Для Каждого ПолноеИмяМетаданного Из СтрРазделить(СписокМетаданных, ",") Цикл
		ОписаниеМетаданных = КэшКонфигурации[ПолноеИмяМетаданного];
		Если ОписаниеМетаданных = Неопределено Тогда
			ОписанияМетаданныхСервер.Вставить(ПолноеИмяМетаданного);
		Иначе
			ОписанияМетаданных.Вставить(ПолноеИмяМетаданного, ОписаниеМетаданных);
		КонецЕсли;
	КонецЦикла;
	
	КД3_Метаданные.ЗаполнитьОписаниеСпискаМетаданных(Конфигурация, ОписанияМетаданныхСервер);
	Для Каждого КлючИЗначение Из ОписанияМетаданныхСервер Цикл
		ОписанияМетаданных.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		Если КлючИЗначение.Значение <> Неопределено Тогда
			КэшКонфигурации.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОписанияМетаданных;
	
КонецФункции

Процедура СброситьОписаниеМетаданныхВКэше(Конфигурация) Экспорт
	ПараметрыПриложения.Вставить(Конфигурация, Неопределено);
КонецПроцедуры

#КонецОбласти
