#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьМетодыМодуля(ДанныеМодуля, ТекстМодуля, ЭтоРасширение) Экспорт
	
	Если ТекстМодуля = Неопределено Тогда
		Возврат; // Пустой модуль
	КонецЕсли;
	
	Выражение = "^(^&[А-Яа-я\w]*\s*)?\s*((?:^[^\n\S]*\/\/[^\r\n]*\n)*)\s*(^&[А-Яа-я\w]*\s*)?(асинх\s+)?(процедура|функция)\s+([А-ЯЁа-яё\w]+)\s*\(([^)]*)\)\s*(экспорт)";
	Совпадения = ВычислительНайтиСовпадения(ТекстМодуля, Выражение, "Директива0,Описание,Директива1,Асинх,Тип,Имя,Параметры,Экспорт");
	
	Для Каждого Совпадение Из Совпадения Цикл
		ОписаниеМетода = Совпадение.Описание;
		ВыделитьБлокОписания(ОписаниеМетода, "Пример");
		ВыделитьБлокОписания(ОписаниеМетода, "Возвращаемое значение");
		ОписаниеПараметры = ВыделитьБлокОписания(ОписаниеМетода, "Параметры");
		ОписаниеМетода = УдалитьСлешиИзКомментария(ОписаниеМетода);
		
		СтруктураПараметров = Новый Структура;
		
		ЗаполнитьПараметрыМетодаПоЗаголовку(СтруктураПараметров, Совпадение.Параметры);
		ЗаполнитьПараметрыМетодаПоОписанию(СтруктураПараметров, ОписаниеПараметры);
		
		ДанныеМетода = Новый Структура;
		ДанныеМетода.Вставить("name", Совпадение.Имя);
		ДанныеМетода.Вставить("name_en", Совпадение.Имя);
		ДанныеМетода.Вставить("description", УдалитьСлешиИзКомментария(Совпадение.Описание));
		ДанныеМетода.Вставить("detail", ОписаниеМетода);
		ДанныеМетода.Вставить("returns", "");
		ДанныеМетода.Вставить("signature", Новый Структура("default", Новый Структура));
		
		ДанныеМетода.signature.default.Вставить("СтрокаПараметров", "(" + Совпадение.Параметры + ")");
		ДанныеМетода.signature.default.Вставить("Параметры", СтруктураПараметров);
		
		ДанныеМодуля.module.Вставить(Совпадение.Имя, ДанныеМетода);
	КонецЦикла;
	
	ДанныеМодуля.count = ДанныеМодуля.module.Количество();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыделитьБлокОписания(ОписаниеМетода, ИмяБлока)
	
	Если ПустаяСтрока(ОписаниеМетода) Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяБлокаРег = СтрЗаменить(НРег(ИмяБлока), " ", "\s+");
	Выражение = СтрЗаменить("^\s*\/\/\s*ИмяБлока\s*[:][\s\S]*", "ИмяБлока", ИмяБлокаРег);
	
	Совпадения = ВычислительНайтиСовпадения(ОписаниеМетода, Выражение, "");
	Если Совпадения.Количество() <> 1 Тогда
		Возврат "";
	КонецЕсли;
	
	ОписаниеМетода = Лев(ОписаниеМетода, Совпадения[0].Индекс);
	
	Возврат УдалитьСлешиИзКомментария(Совпадения[0].Текст);
	
КонецФункции

Процедура ЗаполнитьПараметрыМетодаПоОписанию(СтруктураПараметров, ОписаниеПараметры)
	
	Если СтруктураПараметров.Количество() = 0 ИЛИ ПустаяСтрока(ОписаниеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Имя");
	ТЗ.Колонки.Добавить("Индекс");
	
	Для Каждого КлючИЗначение Из СтруктураПараметров Цикл
		Выражение = СтрЗаменить("^[\s]*Параметр\s*[-–]\s*\S*\s*[-–]", "Параметр", КлючИЗначение.Ключ);
		Совпадения = ВычислительНайтиСовпадения(ОписаниеПараметры, Выражение, "");
		Если Совпадения.Количество() = 1 Тогда
			СтрокаТЗ = ТЗ.Добавить();
			СтрокаТЗ.Имя = КлючИЗначение.Ключ;
			СтрокаТЗ.Индекс = Совпадения[0].Индекс;
		КонецЕсли;
	КонецЦикла;
	ТЗ.Сортировать("Индекс");
	
	ИндексСтроки = 0;
	КоличествоСтрок = ТЗ.Количество();
	Пока ИндексСтроки < КоличествоСтрок Цикл
		СтрокаТЗ = ТЗ[ИндексСтроки];
		ИндексСтроки = ИндексСтроки + 1;
		Если ИндексСтроки = КоличествоСтрок Тогда
			ОписаниеПараметра = Сред(ОписаниеПараметры, СтрокаТЗ.Индекс);
		Иначе
			ОписаниеПараметра = Сред(ОписаниеПараметры, СтрокаТЗ.Индекс, ТЗ[ИндексСтроки].Индекс  - СтрокаТЗ.Индекс);
		КонецЕсли;
		СтруктураПараметров.Вставить(СтрокаТЗ.Имя, СокрЛ(ОписаниеПараметра));
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыМетодаПоЗаголовку(СтруктураПараметров, СтрокаПараметров)
	
	Если СтрокаПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьКомментарииИзЗаголовкаПараметров(СтрокаПараметров);
	
	Выражение = "[знач]?([А-Яа-я\w]+)\s*(?:=\s*[^,]*)?,";
	Совпадения = ВычислительНайтиСовпадения(СтрокаПараметров + ",", Выражение, "Имя");
	Для Каждого Совпадение Из Совпадения Цикл
		СтруктураПараметров.Вставить(Совпадение.Имя, "");
	КонецЦикла;
	
КонецПроцедуры

Функция УдалитьСлешиИзКомментария(ТекстКомментария)
	Возврат ВычеслительЗаменитьСовпадения(ТекстКомментария, "(^\s*\/\/\s{0,2})", "");
КонецФункции

// Удаление комментариев из описания параметров метода
// Пример:
// Процедура ИмяПроцедуры(П1, //П2,
//		П3, П4 = Неопределено) Экспорт
//
Процедура УдалитьКомментарииИзЗаголовкаПараметров(СтрокаПараметров)
	
	ПозКомментария = СтрНайти(СтрокаПараметров, "//");
	НачПоз = 1;
	
	Пока ПозКомментария > 0 Цикл
		ПозРавно = СтрНайти(СтрокаПараметров, "=",, НачПоз);
		// Проверка "комментария" в случае: Функция Имя(П = " //", П2)
		Если ПозРавно = 0 ИЛИ ПозРавно > ПозКомментария Тогда
			ПозКавычек = 0; // Если равно перед комментарием нет, то и строкового значения быть не может
		Иначе
			ПозКавычек = СтрНайти(СтрокаПараметров, """", , ПозРавно + 1);
		КонецЕсли;
		Если ПозКавычек = 0 ИЛИ ПозКавычек > ПозКомментария Тогда
			// Удаление комментария
			ПозКонецСтроки = СтрНайти(СтрокаПараметров, Символы.ПС, , ПозКомментария);
			СтрокаПараметров = Лев(СтрокаПараметров, ПозКомментария - 1) + ?(ПозКонецСтроки = 0, "", Сред(СтрокаПараметров, ПозКонецСтроки + 1));
			Если ПозКонецСтроки = 0 Тогда
				Возврат; // Комментарий до конца строки
			КонецЕсли;
			// Поиск следующего комментария
			НачПоз = ПозКомментария;
			ПозКомментария = СтрНайти(СтрокаПараметров, "//",, НачПоз);
			Продолжить;
		КонецЕсли;
		// Строковое значение по умолчанию начинается до комментария.
		// Получение конечных кавычек и проверка их позиции до комментария
		Пока Истина Цикл
			ПозКавычек = СтрНайти(СтрокаПараметров, """", , ПозКавычек + 1);
			Если ПозКавычек =  0 ИЛИ ПозКавычек = СтрДлина(СтрокаПараметров) ИЛИ Сред(СтрокаПараметров, ПозКавычек + 1, 1) <> """" Тогда
				Прервать;
			КонецЕсли;
			ПозКавычек = ПозКавычек + 2; // Внутренние кавычки
		КонецЦикла;
		Если ПозКавычек = 0 Тогда
			Возврат; // Некорректный формат, не найдены конечные кавычки
		КонецЕсли;
		НачПоз = ПозКавычек + 1;
		Если ПозКавычек > ПозКомментария Тогда
			// Комментарий внутри кавычек. Поиск следующего комментария
			ПозКомментария = СтрНайти(СтрокаПараметров, "//",, НачПоз);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ВычислительНайтиСовпадения(Текст, Выражение, ИменаГрупп)
	
	Совпадения = Новый Массив;
	МассивГрупп = СтрРазделить(ИменаГрупп, ",", Ложь);
	
	РезультатыПоиска = Вычислить("СтрНайтиВсеПоРегулярномуВыражению(Текст, Выражение, Истина, Истина)");
	
	Для Каждого РезультатПоиска Из РезультатыПоиска Цикл
		Совпадение = Новый Структура;
		Если МассивГрупп.Количество() = 0 Тогда
			Совпадение.Вставить("Индекс", РезультатПоиска.НачальнаяПозиция);
			Совпадение.Вставить("Текст", РезультатПоиска.Значение);
		Иначе
			Индекс = 0;
			Для Каждого ЗначениеГруппы Из РезультатПоиска.ПолучитьГруппы() Цикл
				Совпадение.Вставить(МассивГрупп[Индекс], ЗначениеГруппы.Значение);
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЕсли;
		Совпадения.Добавить(Совпадение);
	КонецЦикла;
	
	Возврат Совпадения;
	
КонецФункции

Функция ВычеслительЗаменитьСовпадения(Текст, Выражение, ТекстЗамены)
	Возврат Вычислить("СтрЗаменитьПоРегулярномуВыражению(Текст, Выражение, ТекстЗамены, Истина, Истина)");
КонецФункции

#КонецОбласти