
&НаСервере
Процедура КД3_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Обработчики = Новый СписокЗначений;
	Обработчики.Добавить("АлгоритмПередВыгрузкойОбъекта");
	Обработчики.Добавить("АлгоритмПриВыгрузкеОбъекта");
	Обработчики.Добавить("АлгоритмПослеВыгрузкиОбъекта");
	Обработчики.Добавить("АлгоритмПослеВыгрузкиОбъектаВФайлОбмена");
	Обработчики.Добавить("АлгоритмПередЗагрузкойОбъекта", Истина);
	Обработчики.Добавить("АлгоритмПриЗагрузкеОбъекта", Истина);
	Обработчики.Добавить("АлгоритмПослеЗагрузкиОбъекта", Истина);
	КД3_Метаданные.ПриСозданииНаСервере(ЭтотОбъект, Отказ, Ложь, Обработчики, Элементы.ОбработчикиXML);
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	КД3_МетаданныеКлиент.ПередЗаписью(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура КД3_ПередЗакрытиемПосле(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КД3_МетаданныеКлиент.ПередЗаписью(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура КД3_СтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ОбработчикиСобытий Тогда
		КД3_ОбработчикиXMLПриСменеСтраницыПосле(Элементы.ОбработчикиXML, Элементы.ОбработчикиXML.ТекущаяСтраница);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_ОбработчикиXMLПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.Страница_ПередВыгрузкой Тогда
		ИмяОбработчика = "АлгоритмПередВыгрузкойОбъекта";
	ИначеЕсли ТекущаяСтраница = Элементы.Страница_ПриВыгрузке Тогда
		ИмяОбработчика = "АлгоритмПриВыгрузкеОбъекта";
	ИначеЕсли ТекущаяСтраница = Элементы.Страница_ПослеВыгрузки Тогда
		ИмяОбработчика = "АлгоритмПослеВыгрузкиОбъекта";
	ИначеЕсли ТекущаяСтраница = Элементы.Страница_ПослеВыгрузкиВФайл Тогда
		ИмяОбработчика = "АлгоритмПослеВыгрузкиОбъектаВФайлОбмена";
	ИначеЕсли ТекущаяСтраница = Элементы.Страница_ПередЗагрузкой Тогда
		ИмяОбработчика = "АлгоритмПередЗагрузкойОбъекта";
	ИначеЕсли ТекущаяСтраница = Элементы.Страница_ПриЗагрузке Тогда
		ИмяОбработчика = "АлгоритмПриЗагрузкеОбъекта";
	ИначеЕсли ТекущаяСтраница = Элементы.Страница_ПослеЗагрузки Тогда
		ИмяОбработчика = "АлгоритмПослеЗагрузкиОбъекта";
	Иначе
		Возврат;
	КонецЕсли;
	КД3_МетаданныеКлиент.ПриСменеСтраницы(ЭтотОбъект, ИмяОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ДокументСформирован(Элемент)
	ИмяОбработчика = Сред(Элемент.Имя, 5);
	КД3_МетаданныеКлиент.ИнициализацияРедактора(ЭтотОбъект, Элемент.Имя);
	КД3_МетаданныеКлиент.УстановитьТекст(ЭтотОбъект, Элемент.Имя, Объект[ИмяОбработчика]);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_HTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	КД3_МетаданныеКлиент.ОбработатьСобытиеHTML(ЭтотОбъект, Элемент, ДанныеСобытия);
КонецПроцедуры
