////////////////////////////////////////////////////////////////////////////////
// рк_РедакторКодаВызовСервера: Серверные функции для вызова с клиента
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РаботаСМетаданными

// Используется при обновлении настроек редактора для формы по глобальным настройкам
//
// Параметры:
//  АдресНастроек - Строка - адрес во временном хранилище формы для хранения настроек
//
Функция ОбновитьНастройки(Знач АдресНастроек) Экспорт
	
	Возврат ПоместитьВоВременноеХранилище(рк_РедакторКода.Настройки(), АдресНастроек);
	
КонецФункции

// Используется при обновлении настроек конфигурации для формы по глобальным настройкам
//
// Параметры:
//  АдресНастроек - Строка - адрес во временном хранилище формы для хранения настроек
//
Функция ОбновитьНастройкиКонфигурации(Знач АдресНастроек) Экспорт
	
	Возврат ПоместитьВоВременноеХранилище(рк_РедакторКода.НастройкиКонфигурации(), АдресНастроек);
	
КонецФункции

Функция ПодготовитьФайлыРедактора(Знач УникальныйИдентификаторФормы) Экспорт
	
	ФайлыРедактора = рк_РедакторКода.ПодготовитьФайлыРедактора(УникальныйИдентификаторФормы);
	Возврат ПоместитьВоВременноеХранилище(ФайлыРедактора, УникальныйИдентификаторФормы);
	
КонецФункции

Функция ОбработатьЗапросМетаданных(Знач СписокПараметровЗапроса, Знач АдресНастройкиКонфигурации, Знач АдресОбщиеРеквизиты) Экспорт
	
	НастройкиКонфигурации = ПолучитьИзВременногоХранилища(АдресНастройкиКонфигурации);
	
	НастройкиКонфигурации.Вставить("ОбщиеРеквизиты", АдресОбщиеРеквизиты);
	
	РезультатыЗапроса = Новый Соответствие;
	
	рк_РедакторКода.ОбработатьЗапросМетаданных(РезультатыЗапроса, СтрРазделить(СписокПараметровЗапроса, ","), НастройкиКонфигурации);
	
	Возврат ПоместитьВоВременноеХранилище(РезультатыЗапроса);
	
КонецФункции

Функция ИнициализироватьГлобальныйКонтекст(Знач АдресНастройкиКонфигурации, Знач УникальныйИдентификаторФормы) Экспорт
	
	Попытка
		МодульДлительныеОперации = Вычислить("ДлительныеОперации");
		ВыполнениеВФоне = Истина;
	Исключение
		ВыполнениеВФоне = Ложь;
	КонецПопытки;
	
	НастройкиКонфигурации = ПолучитьИзВременногоХранилища(АдресНастройкиКонфигурации);
	
	Если ВыполнениеВФоне Тогда
		ПараметрыВыполнения = МодульДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификаторФормы);
		ИмяФункции = "рк_РедакторКода.ЗаданиеИнициализироватьГлобальныйКонтекст";
		
		Результат = МодульДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяФункции, НастройкиКонфигурации);
	Иначе
		АдресГлобальныйКонтекст = рк_РедакторКода.ЗаданиеИнициализироватьГлобальныйКонтекст(НастройкиКонфигурации);
		
		Результат = Новый Структура;
		Результат.Вставить("Статус", "Выполнено");
		Результат.Вставить("АдресРезультата", ПоместитьВоВременноеХранилище(АдресГлобальныйКонтекст, УникальныйИдентификаторФормы));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьПеременную(Знач АдресКонтекста, Знач ИмяПеременной, Знач ЗначениеПеременной = Неопределено) Экспорт
	
	РезультатыЗапроса = ПолучитьИзВременногоХранилища(АдресКонтекста);
	
	Контекст = рк_РедактоРКода.ДанныеИзJSON(РезультатыЗапроса["Контекст"].Данные);
	
	рк_РедактоРКода.ДобавитьПеременную(Контекст, ИмяПеременной, ЗначениеПеременной);
	
	РезультатыЗапроса["Контекст"].Данные = рк_РедактоРКода.ДанныеВJSON(Контекст);
	
	Возврат ПоместитьВоВременноеХранилище(РезультатыЗапроса, АдресКонтекста);
	
КонецФункции

#КонецОбласти

#КонецОбласти
