#Область Модуль_КД3_РедакторКода

Процедура КД3_ОбработчикПриСозданииНаСервере(Форма) Экспорт
	
	КонтекстФормы = КД3_ОпределитьКонтекстФормы(Форма);
	
	Если КонтекстФормы.ИмяКонтекста = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("КД3: Форма не поддерживается. Имя формы: " + Форма.ИмяФормы);
		Возврат;
	КонецЕсли;
	
	Если КонтекстФормы.Обработчики.Количество() = 0 Тогда
		Возврат; // Для текущих настроек формы редакторы не доступны
	КонецЕсли;
	
	// Получение данных конфигураций
	
	КД3_ЗаполнитьДоступныеКонфигурации(Форма, КонтекстФормы);
	
	// Обработка параметров инициализации
	
	НовыеРедакторы = Новый Массив;
	НовыеРеквизиты = Новый Массив;
	НастройкиКонфигураций = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из рк_РедакторКодаКлиентСервер.ИменаСлужебныхРеквизитов() Цикл
		НовыеРеквизиты.Добавить(Новый РеквизитФормы(КлючИЗначение.Значение.Имя, КлючИЗначение.Значение.Тип));
	КонецЦикла;
	
	КонтекстФормы.Вставить("ЕстьКорреспондент", Ложь);
	
	Для Каждого ЭлементСписка Из КонтекстФормы.Обработчики Цикл
		
		ДляКорреспондента = ЭлементСписка.Пометка;
		ЭлементТекст = ЭлементСписка.Значение;
		ИмяЭлементаHTML = ?(ПустаяСтрока(ЭлементСписка.Представление), "КД3_" + ЭлементТекст.Имя, ЭлементСписка.Представление);
		
		ПараметрыИнициализации = НовыеПараметрыИнициализации(ЭлементТекст,,ИмяЭлементаHTML);
		ПараметрыИнициализации.РежимЯзыка = КонтекстФормы.РежимЯзыка;
		
		Если ТипЗнч(ЭлементТекст.Родитель) <> Тип("ФормаКлиентскогоПриложения") Тогда
			ПараметрыИнициализации.ЭлементСтраница = ЭлементТекст.Родитель;
		КонецЕсли;
		
		Если ДляКорреспондента Тогда
			КонтекстФормы.ЕстьКорреспондент = Истина;
			ПараметрыИнициализации.Конфигурация = КонтекстФормы.КонфигурацияКорреспондент;
		Иначе
			ПараметрыИнициализации.Конфигурация = КонтекстФормы.Конфигурация;
		КонецЕсли;
		
		ПараметрыИнициализации.Параметры.Вставить("КД3_ДляКорреспондента", ДляКорреспондента);
		
		НовыеРедакторы.Добавить(ПараметрыИнициализации);
		
		НовыеРеквизиты.Добавить(Новый РеквизитФормы(ПараметрыИнициализации.РеквизитHTML, Новый ОписаниеТипов("Строка")));
	КонецЦикла;
	
	НастройкиКонфигураций[КонтекстФормы.Конфигурация] = КД3_НастройкиКонфигурации(КонтекстФормы.Конфигурация);
	Если КонтекстФормы.ЕстьКорреспондент Тогда
		НастройкиКонфигураций[КонтекстФормы.КонфигурацияКорреспондент] = КД3_НастройкиКонфигурации(КонтекстФормы.КонфигурацияКорреспондент);
	КонецЕсли;
	
	Попытка
		Форма.ИзменитьРеквизиты(НовыеРеквизиты, Новый Массив);
	Исключение
		Инфо = ИнформацияОбОшибке();
		Сообщить("КД3_ОбработчикПриСозданииНаСервере ИзменитьРеквизиты " + Символы.ПС + ПодробноеПредставлениеОшибки(Инфо));
		Возврат;
	КонецПопытки;
	
	Если КонтекстФормы.ИмяКонтекста = "Запросы" ИЛИ КонтекстФормы.ИмяКонтекста = "Алгоритмы" И НЕ КонтекстФормы.ЭтоКонвертацияXDTO Тогда
		
		// Для запросов и конвертации XML алгоритмов создается 2 страницы на один и тот же реквизит Текст для ускорения обработки флага "Используется при загрузке"
		
		ЭлементСтраницы = Форма.Элементы.Добавить("КД3_СтраницыОбработчики", Тип("ГруппаФормы"), НовыеРедакторы[0].ЭлементТекст.Родитель);
		ЭлементСтраницы.Вид = ВидГруппыФормы.Страницы;
		ЭлементСтраницы.УстановитьДействие("ПриСменеСтраницы", "Подключаемый_КД3_СтраницыОбработчикиПриСменеСтраницы");
		ЭлементСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		
		Для Каждого ПараметрыИнициализации Из НовыеРедакторы Цикл
			ИмяЭлементаHTML = ПараметрыИнициализации.РеквизитHTML;
			
			ЭлементСтраница = Форма.Элементы.Добавить(ИмяЭлементаHTML + "Страница", Тип("ГруппаФормы"), ЭлементСтраницы);
			ЭлементСтраница.Вид = ВидГруппыФормы.Страница;
			
			ПараметрыИнициализации.ЭлементСтраница = ЭлементСтраница;
			
			Если Форма.Объект.ИспользуетсяПриЗагрузке = ПараметрыИнициализации.Параметры.КД3_ДляКорреспондента Тогда
				ЭлементСтраницы.ТекущаяСтраница = ЭлементСтраница;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

	ОбщиеПараметры = рк_РедакторКодаКлиентСервер.ОбщиеПараметры(Форма);
	ОбщиеПараметры.Вставить("КД3_ИмяКонтекста", КонтекстФормы.ИмяКонтекста);
	ОбщиеПараметры.Вставить("КД3_ЭтоКонвертацияXDTO", КонтекстФормы.ЭтоКонвертацияXDTO);
	
	ОбработчикПриСозданииНаСервере(Форма, НовыеРедакторы, НастройкиКонфигураций);
	
	КД3_ЗаполнитьЛокальныйКонтекст(Форма, КонтекстФормы);
	
КонецПроцедуры

Функция КД3_НастройкиКонфигурации(Релиз) Экспорт
	
	ОщиеНастройки = НастройкиКонфигурации();
	
	Если НЕ ЗначениеЗаполнено(Релиз) Тогда
		Возврат ОщиеНастройки; // Настройки текущей конфигурации
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Релизы.ИсточникДанных КАК ИсточникДанных,
	|	Релизы.КаталогЗагрузки КАК КаталогЗагрузки,
	|	Релизы.Расширения.(
	|		ИмяКаталогаЗагрузки КАК ИмяКаталогаЗагрузки
	|	) КАК Расширения
	|ИЗ
	|	Справочник.Релизы КАК Релизы
	|ГДЕ
	|	Релизы.Ссылка = &Релиз";
	
	Запрос.УстановитьПараметр("Релиз", Релиз);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Настройки = НовыеНастройкиКонфигурации();
	
	Настройки.ОбработчикМодулей = ОщиеНастройки.ОбработчикМодулей; // Обработчик модулей общий для всех конфигураций
	Настройки.ВнешниеМетаданные = Истина;
	Настройки.ЭтоИсходникиEDT = Выборка.ИсточникДанных <> 0;
	Настройки.ПутьКИсходникамКонфигурации = рк_РедакторКодаКлиентСервер.НормализоватьПутьФайла(Выборка.КаталогЗагрузки);
	
	Если НЕ Настройки.ЭтоИсходникиEDT Тогда
		ВыборкаРасширения = Выборка.Расширения.Выбрать();
		Пока ВыборкаРасширения.Следующий() Цикл
			Настройки.ПутьКИсходникамРасширений.Добавить(рк_РедакторКодаКлиентСервер.НормализоватьПутьФайла(ВыборкаРасширения.ИмяКаталогаЗагрузки));
		КонецЦикла;
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

Функция КД3_ОпределитьКонтекстФормы(Форма)
	
	Обработчики = Новый СписокЗначений; // Значение - ЭлементТекст, Пометка - для корреспондента, Представление [Не обязательно] - имя элемента HTML
	ФормаЭлементы = Форма.Элементы;
	ИмяФормы = Форма.ИмяФормы;
	
	КонтекстФормы = Новый Структура;
	КонтекстФормы.Вставить("ИмяКонтекста");
	КонтекстФормы.Вставить("ЭтоКонвертацияXDTO");
	КонтекстФормы.Вставить("Обработчики", Обработчики);
	КонтекстФормы.Вставить("РежимЯзыка", "bsl");
	
	Если ИмяФормы = "Справочник.Конвертации.Форма.ФормаЭлемента" Тогда
		
		КонтекстФормы.ИмяКонтекста = "Конвертации";
		КонтекстФормы.ЭтоКонвертацияXDTO = Форма.КонвертацияXDTO;
		
		Если КонтекстФормы.ЭтоКонвертацияXDTO Тогда
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередКонвертацией);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередОтложеннымЗаполнением);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередОбработкойУдаления);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеКонвертации);
		Иначе
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеЗагрузкиПравилОбмена);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередВыгрузкойДанных);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередПолучениемИзмененныхОбъектов);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередВыгрузкойОбъекта);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередОтправкойИнформацииОбУдалении);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередКонвертациейОбъекта);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеВыгрузкиОбъекта);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеВыгрузкиДанных);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередЗагрузкойДанных,, Истина);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеЗагрузкиПараметров,, Истина);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеПолученияИнформацииОбУзлахОбмена,, Истина);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередЗагрузкойОбъекта,, Истина);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПриПолученииИнформацииОбУдалении,, Истина);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеЗагрузкиОбъекта,, Истина);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеЗагрузкиДанных,, Истина);
		КонецЕсли;
		
	ИначеЕсли ИмяФормы = "Справочник.ПравилаКонвертацииОбъектов.Форма.ФормаЭлемента" Тогда
		
		КонтекстФормы.ИмяКонтекста = "ПКО";
		КонтекстФормы.ЭтоКонвертацияXDTO = Форма.ЭтоКонвертацияXDTO;
		
		Если КонтекстФормы.ЭтоКонвертацияXDTO Тогда
			КД3_ВидимостьПакетныеСтраницы =
					Форма.ОтборСобытийПоМоделиXDTO = Перечисления.ВариантыМоделейОбмена.ПакетнаяМодель
				ИЛИ Форма.ОтборСобытийПоМоделиXDTO = Перечисления.ВариантыМоделейОбмена.КомбинированнаяМодель;
			
			Если КД3_ВидимостьПакетныеСтраницы Тогда
				Если Форма.Объект.ИспользоватьДляОтправки Тогда
					Обработчики.Добавить(ФормаЭлементы.АлгоритмПакетноеСобытиеПриОтправкеДанных);
				КонецЕсли;
				Если Форма.Объект.ИспользоватьДляПолучения Тогда
					Обработчики.Добавить(ФормаЭлементы.АлгоритмПакетноеСобытиеПриПолученииЗапросаВыгрузкиОбъекта);
					Обработчики.Добавить(ФормаЭлементы.АлгоритмПакетноеСобытиеПередПолучениемДанных);
					Обработчики.Добавить(ФормаЭлементы.АлгоритмПакетноеСобытиеПриПолученииДанных);
				КонецЕсли;
				//Обработчики.Добавить(Форма.Элементы.АлгоритмПакетноеСобытиеПослеЗагрузкиВсехДанных, );
			КонецЕсли;
			
			КД3_ВидимостьОбъектныеСтраницы =
					Форма.ОтборСобытийПоМоделиXDTO = Перечисления.ВариантыМоделейОбмена.ОбъектнаяМодель
				ИЛИ Форма.ОтборСобытийПоМоделиXDTO = Перечисления.ВариантыМоделейОбмена.КомбинированнаяМодель;
			
			Если КД3_ВидимостьОбъектныеСтраницы Тогда
				Если Форма.Объект.ИспользоватьДляОтправки Тогда
					Обработчики.Добавить(ФормаЭлементы.АлгоритмОбъектноеСобытиеПриОтправкеДанных);
				КонецЕсли;
				Если Форма.Объект.ИспользоватьДляПолучения Тогда
					Обработчики.Добавить(ФормаЭлементы.АлгоритмОбъектноеСобытиеПриПолученииЗапросаВыгрузкиОбъекта);
					Обработчики.Добавить(ФормаЭлементы.АлгоритмОбъектноеСобытиеПриУдаленииОбъектаИБ);
					Обработчики.Добавить(ФормаЭлементы.АлгоритмОбъектноеСобытиеПередПолучениемДанных);
					Обработчики.Добавить(ФормаЭлементы.АлгоритмОбъектноеСобытиеПриПолученииДанных);
					Обработчики.Добавить(ФормаЭлементы.АлгоритмОбъектноеСобытиеПослеКонвертацииОбъекта);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередВыгрузкойОбъекта);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПриВыгрузкеОбъекта);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеВыгрузкиОбъекта);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПоследовательностьПолейПоиска,, Истина);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередЗагрузкойОбъекта,, Истина);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПриЗагрузкеОбъекта,, Истина);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеЗагрузкиОбъекта,, Истина);
		КонецЕсли;
		
	ИначеЕсли ИмяФормы = "Справочник.ПравилаКонвертацииПредопределенныхДанных.Форма.ФормаЭлементаXML" Тогда
		
		КонтекстФормы.ИмяКонтекста = "ПКПД";
		КонтекстФормы.ЭтоКонвертацияXDTO = Ложь;
		
		Обработчики.Добавить(ФормаЭлементы.АлгоритмПередВыгрузкойОбъекта);
		Обработчики.Добавить(ФормаЭлементы.АлгоритмПриВыгрузкеОбъекта);
		Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеВыгрузкиОбъекта);
		Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена);
		Обработчики.Добавить(ФормаЭлементы.АлгоритмПередЗагрузкойОбъекта,, Истина);
		Обработчики.Добавить(ФормаЭлементы.АлгоритмПриЗагрузкеОбъекта,, Истина);
		Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеЗагрузкиОбъекта,, Истина);
		
	ИначеЕсли ИмяФормы = "Справочник.ПравилаКонвертацииСвойств.Форма.ФормаЭлемента" Тогда
		
		КонтекстФормы.ИмяКонтекста = "ПКС";
		КонтекстФормы.ЭтоКонвертацияXDTO = Форма.ЭтоКонвертацияXDTO;
		
		Если НЕ КонтекстФормы.ЭтоКонвертацияXDTO Тогда
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередВыгрузкойСвойства);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПриВыгрузкеСвойства);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеВыгрузкиСвойства);
		КонецЕсли;
		
	ИначеЕсли ИмяФормы = "Справочник.ПравилаКонвертацииСвойств.Форма.ФормаГруппы" Тогда
		
		КонтекстФормы.ИмяКонтекста = "ПКГС";
		КонтекстФормы.ЭтоКонвертацияXDTO = Форма.ЭтоКонвертацияXDTO;
		
		Если НЕ КонтекстФормы.ЭтоКонвертацияXDTO Тогда
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередОбработкойВыгрузки);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередВыгрузкойСвойства);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПриВыгрузкеСвойства);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеВыгрузкиСвойства);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеОбработкиВыгрузки);
		КонецЕсли;
		
	ИначеЕсли ИмяФормы = "Справочник.ПравилаОбработкиДанных.Форма.ФормаЭлемента" Тогда
		
		КонтекстФормы.ИмяКонтекста = "ПОД";
		КонтекстФормы.ЭтоКонвертацияXDTO = Форма.КонвертацияXDTO;
		
		Если КонтекстФормы.ЭтоКонвертацияXDTO Тогда
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПриОбработке);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмВыборкаДанных);
		Иначе
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередОбработкойПравила);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПередВыгрузкойОбъекта);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеВыгрузкиОбъекта);
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеОбработкиПравила);
		КонецЕсли;
		
	ИначеЕсли ИмяФормы = "Справочник.ПравилаРегистрацииОбъектов.Форма.ФормаЭлемента" Тогда
		
		КонтекстФормы.ИмяКонтекста = "ПРО";
		КонтекстФормы.ЭтоКонвертацияXDTO = Ложь;
		
		Обработчики.Добавить(ФормаЭлементы.АлгоритмПередОбработкойПравила);
		Обработчики.Добавить(ФормаЭлементы.АлгоритмПриОбработкеПравила);
		Обработчики.Добавить(ФормаЭлементы.АлгоритмПриОбработкеДополнительныйПравила);
		Обработчики.Добавить(ФормаЭлементы.АлгоритмПослеОбработкиПравила);
		Если Форма.ЭтоСсылочныйТип Тогда
			Обработчики.Добавить(ФормаЭлементы.АлгоритмПакетнаяОбработкаРегистрации);
		КонецЕсли;
		
	ИначеЕсли ИмяФормы = "Справочник.Алгоритмы.Форма.ФормаЭлемента" Тогда
		
		КонтекстФормы.ИмяКонтекста = "Алгоритмы";
		КонтекстФормы.ЭтоКонвертацияXDTO = Форма.ЭтоКонвертацияXDTO;
		
		Обработчики.Добавить(ФормаЭлементы.Алгоритм, "КД3_ОбработчикПриВыгрузке");
		Если НЕ Форма.ЭтоКонвертацияXDTO Тогда
			// Для одного элемента Текст добавляются два обработчика для переключения флагом "Используется при загрузке"
			Обработчики.Добавить(ФормаЭлементы.Алгоритм, "КД3_ОбработчикПриЗагрузке", Истина);
		КонецЕсли;
		
	ИначеЕсли ИмяФормы = "Справочник.Запросы.Форма.ФормаЭлемента" Тогда
		
		КонтекстФормы.ИмяКонтекста = "Запросы";
		КонтекстФормы.ЭтоКонвертацияXDTO = Ложь;
		КонтекстФормы.РежимЯзыка = "bsl_query";
		
		// Для одного элемента Текст добавляются два обработчика для переключения флагом "Используется при загрузке"
		Обработчики.Добавить(ФормаЭлементы.ТекстЗапроса, "КД3_ОбработчикПриВыгрузке");
		Обработчики.Добавить(ФормаЭлементы.ТекстЗапроса, "КД3_ОбработчикПриЗагрузке", Истина);
		
	КонецЕсли;
	
	Возврат КонтекстФормы;
	
КонецФункции

Процедура КД3_ЗаполнитьДоступныеКонфигурации(Форма, КонтекстФормы)
	
	КонтекстФормы.Вставить("Конфигурация");
	КонтекстФормы.Вставить("Конфигурации");
	КонтекстФормы.Вставить("Конвертации");
	Если НЕ КонтекстФормы.ЭтоКонвертацияXDTO Тогда
		КонтекстФормы.Вставить("КонфигурацияКорреспондент");
		КонтекстФормы.Вставить("КонфигурацииКорреспондент");
	КонецЕсли;
	
	Если КонтекстФормы.ИмяКонтекста = "ПРО" Тогда
		КонтекстФормы.Конфигурация = Форма.Конфигурация;
		
	ИначеЕсли КонтекстФормы.ИмяКонтекста = "Конвертации" Тогда
		КонтекстФормы.Конфигурация = Форма.Объект.Конфигурация;
		Если НЕ КонтекстФормы.ЭтоКонвертацияXDTO Тогда
			КонтекстФормы.КонфигурацияКорреспондент = Форма.Объект.КонфигурацияКорреспондент;
		КонецЕсли;
		КонтекстФормы.Конвертации = Новый Массив;
		КонтекстФормы.Конвертации.Добавить(Форма.Объект.Ссылка);
	Иначе
		ДанныеОбъекта = Новый Структура("ОбъектКонфигурации,ОбъектКонфигурацииКорреспондент");
		
		Если КонтекстФормы.ИмяКонтекста = "ПКС" Тогда
			СписокКонвертаций = Новый СписокЗначений;
			КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Форма.Объект.Владелец, СписокКонвертаций);
			
			ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Форма);
			
		ИначеЕсли КонтекстФормы.ИмяКонтекста = "ПКГС" Тогда
			СписокКонвертаций = Новый СписокЗначений;
			КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Форма.Объект.Владелец, СписокКонвертаций);
			
			ЗаполнитьЗначенияСвойств(ДанныеОбъекта, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Форма.Объект.Владелец, "ОбъектКонфигурации,ОбъектКонфигурацииКорреспондент"));
		Иначе
			СписокКонвертаций = Форма.СписокКонвертаций;
			
			Если КонтекстФормы.ИмяКонтекста = "ПКО" ИЛИ КонтекстФормы.ИмяКонтекста = "ПКПД" Тогда
				ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Форма.Объект);
				
				// Список конфигураций уже есть на форме и получать его дополнительно не надо
				Если Форма.СписокКонфигураций.Количество() > 0 Тогда
					КонтекстФормы.Конфигурации = Форма.СписокКонфигураций.ВыгрузитьЗначения();
				КонецЕсли;
				Если НЕ КонтекстФормы.ЭтоКонвертацияXDTO И Форма.СписокКонфигурацийКорреспондент.Количество() > 0 Тогда
					КонтекстФормы.КонфигурацииКорреспондент = Форма.СписокКонфигурацийКорреспондент.ВыгрузитьЗначения();
				КонецЕсли;
				
			ИначеЕсли КонтекстФормы.ИмяКонтекста = "ПОД" Тогда
				ДанныеОбъекта.ОбъектКонфигурации = Форма.Объект.ОбъектВыборки;
			КонецЕсли;
		КонецЕсли;
		
		КонтекстФормы.Конвертации = СписокКонвертаций.ВыгрузитьЗначения();
		
		Если КонтекстФормы.Конфигурации = Неопределено Тогда
			КонтекстФормы.Конфигурации = КонвертацияДанныхXDTOВызовСервера.ПолучитьКонфигурацииДляКонвертаций(СписокКонвертаций);
		КонецЕсли;
		
		Если НЕ КонтекстФормы.ЭтоКонвертацияXDTO И КонтекстФормы.КонфигурацииКорреспондент = Неопределено Тогда
			КонтекстФормы.КонфигурацииКорреспондент = КонвертацияДанныхXDTOВызовСервера.ПолучитьКонфигурацииДляКонвертаций(СписокКонвертаций, "КонфигурацияКорреспондент");
		КонецЕсли;
		
		// Если есть выбор конкретного объекта конфигурации, то определяем текущую конфигурацию по нему
		Если ЗначениеЗаполнено(ДанныеОбъекта.ОбъектКонфигурации) Тогда
			Конфигурация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъекта.ОбъектКонфигурации, "Владелец");
			Если КонтекстФормы.Конфигурации.Найти(Конфигурация) <> Неопределено Тогда
				КонтекстФормы.Конфигурация = Конфигурация;
			КонецЕсли;
		КонецЕсли;
		Если НЕ КонтекстФормы.ЭтоКонвертацияXDTO И ЗначениеЗаполнено(ДанныеОбъекта.ОбъектКонфигурацииКорреспондент) Тогда
			Конфигурация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъекта.ОбъектКонфигурацииКорреспондент, "Владелец");
			Если КонтекстФормы.КонфигурацииКорреспондент.Найти(Конфигурация) <> Неопределено Тогда
				КонтекстФормы.КонфигурацияКорреспондент = Конфигурация;
			КонецЕсли;
		КонецЕсли;
		
		Если КонтекстФормы.Конфигурация = Неопределено Тогда
			КонтекстФормы.Конфигурация = КонтекстФормы.Конфигурации[0];
		КонецЕсли;
		Если НЕ КонтекстФормы.ЭтоКонвертацияXDTO И КонтекстФормы.КонфигурацияКорреспондент = Неопределено Тогда
			КонтекстФормы.КонфигурацияКорреспондент = КонтекстФормы.КонфигурацииКорреспондент[0];
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КД3_ЗаполнитьЛокальныйКонтекст(Форма, КонтекстФормы)
	
	Если КонтекстФормы = Неопределено Тогда
		КонтекстФормы = КД3_ОпределитьКонтекстФормы(Форма);
	КонецЕсли;
	
	Если КонтекстФормы.ИмяКонтекста = "Запросы" Тогда
		Возврат; // Для запросов нет контекста
	КонецЕсли;
	
	ВсеРедакторы = рк_РедакторКодаКлиентСервер.ПараметрыВсехРедакторов(Форма);
	УникальныйИдентификаторФормы = Форма.УникальныйИдентификатор;
	
	// Общий контекст для всех обработчиков
	
	КонтекстОбщий = Новый Соответствие; // Ключ Истина - контекст для корреспондента
	
	// Общий контекст для всех обработчиков
	
	Если КонтекстФормы.ИмяКонтекста = "ПРО" Тогда
		КонтекстОбщий[Ложь] = НовыйКонтекст();
		
	ИначеЕсли КонтекстФормы.ЭтоКонвертацияXDTO Тогда
		
		КонтекстОбщий[Ложь] = ДанныеИзJSON(ПолучитьОбщийМакет("КД3_ЛокальныйКонтекстXDTO").ПолучитьТекст());
		
		ПараметрыКонвертации = КД3_ЛокальныйКонтекст_ПараметрыКонвертации(КонтекстФормы, Форма.Объект);
		ДобавитьПеременную(КонтекстОбщий[Ложь], "КомпонентыОбмена.ПараметрыКонвертации", ПараметрыКонвертации[Ложь]);
		
		КД3_ЛокальныйКонтекстXDTO_ДобавитьАлгоритмы(КонтекстОбщий[Ложь], КонтекстФормы);
	Иначе
		КонтекстОбщий[Ложь] = ДанныеИзJSON(ПолучитьОбщийМакет("КД3_ЛокальныйКонтекстXML").ПолучитьТекст());
		
		Если КонтекстФормы.ЕстьКорреспондент Тогда
			КонтекстОбщий[Истина] = НовыйКонтекст();
			ДополнитьКонтекст(КонтекстОбщий[Истина], КонтекстОбщий[Ложь]);
		КонецЕсли;
		
		ПараметрыКонвертации = КД3_ЛокальныйКонтекст_ПараметрыКонвертации(КонтекстФормы, Форма.Объект);
		ДобавитьПеременную(КонтекстОбщий[Ложь], "Параметры", ПараметрыКонвертации[Ложь]);
		Если КонтекстФормы.ЕстьКорреспондент Тогда
			ДобавитьПеременную(КонтекстОбщий[Истина], "Параметры", ПараметрыКонвертации[Истина]);
		КонецЕсли;
		
		АлгоритмыКонвертации = КД3_ЛокальныйКонтекстXML_ЗапросыАлгоритмы(КонтекстФормы, "Алгоритмы");
		ДобавитьПеременную(КонтекстОбщий[Ложь], "Алгоритмы", АлгоритмыКонвертации[Ложь]);
		Если КонтекстФормы.ЕстьКорреспондент Тогда
			ДобавитьПеременную(КонтекстОбщий[Истина], "Алгоритмы", АлгоритмыКонвертации[Истина]);
		КонецЕсли;
		
		ЗапросыКонвертации = КД3_ЛокальныйКонтекстXML_ЗапросыАлгоритмы(КонтекстФормы, "Запросы");
		ДобавитьПеременную(КонтекстОбщий[Ложь], "Запросы", ЗапросыКонвертации[Ложь]);
		Если КонтекстФормы.ЕстьКорреспондент Тогда
			ДобавитьПеременную(КонтекстОбщий[Истина], "Запросы", ЗапросыКонвертации[Истина]);
		КонецЕсли;
	КонецЕсли;
	
	// Контекст для каждого обработчика
	
	Для Каждого ЭлементСписка Из ВсеРедакторы Цикл
		ПараметрыРедактора = ЭлементСписка.Значение;
		
		КонтекстОбработчика = НовыйКонтекст();
		
		ДополнитьКонтекст(КонтекстОбработчика, КонтекстОбщий[ПараметрыРедактора.КД3_ДляКорреспондента]);
		
		ИмяОбработчика = ПараметрыРедактора.ИмяЭлементаТекст;
		
		Если КонтекстФормы.ИмяКонтекста = "ПРО" Тогда
			
			Если ИмяОбработчика = "АлгоритмПередОбработкойПравила" Тогда
				ДобавитьПеременную(КонтекстОбработчика, "Отказ");
				ДобавитьПеременную(КонтекстОбработчика, "Объект");
				ДобавитьПеременную(КонтекстОбработчика, "ОбъектМетаданных");
				ДобавитьПеременную(КонтекстОбработчика, "Выгрузка");
				ДобавитьПеременную(КонтекстОбработчика, "ПРО");
			ИначеЕсли ИмяОбработчика = "АлгоритмПередОбработкойПравила" Тогда
				ДобавитьПеременную(КонтекстОбработчика, "Отказ");
				ДобавитьПеременную(КонтекстОбработчика, "Объект");
				ДобавитьПеременную(КонтекстОбработчика, "ТекстЗапроса");
				ДобавитьПеременную(КонтекстОбработчика, "ПараметрыЗапроса");
				ДобавитьПеременную(КонтекстОбработчика, "ИспользоватьКэш");
				ДобавитьПеременную(КонтекстОбработчика, "Выгрузка");
			ИначеЕсли ИмяОбработчика = "АлгоритмПриОбработкеПравила" Тогда
				ДобавитьПеременную(КонтекстОбработчика, "Отказ");
				ДобавитьПеременную(КонтекстОбработчика, "Объект");
				ДобавитьПеременную(КонтекстОбработчика, "ТекстЗапроса");
				ДобавитьПеременную(КонтекстОбработчика, "ПараметрыЗапроса");
				ДобавитьПеременную(КонтекстОбработчика, "ИспользоватьКэш");
			ИначеЕсли ИмяОбработчика = "АлгоритмПослеОбработкиПравила" Тогда
				ДобавитьПеременную(КонтекстОбработчика, "Отказ");
				ДобавитьПеременную(КонтекстОбработчика, "Объект");
				ДобавитьПеременную(КонтекстОбработчика, "ОбъектМетаданных");
				ДобавитьПеременную(КонтекстОбработчика, "Выгрузка");
				ДобавитьПеременную(КонтекстОбработчика, "Получатели");
			КонецЕсли;
			
		ИначеЕсли КонтекстФормы.ЭтоКонвертацияXDTO Тогда
			
			Если КонтекстФормы.ИмяКонтекста = "ПКО" Тогда
				
				Если ИмяОбработчика = "АлгоритмПриОтправкеДанных" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ДанныеИБ");
					ДобавитьПеременную(КонтекстОбработчика, "ДанныеXDTO", Новый Структура);
					ДобавитьПеременную(КонтекстОбработчика, "СтекВыгрузки");
					ДобавитьПеременную(КонтекстОбработчика, "ДанныеИБ");
				ИначеЕсли ИмяОбработчика = "АлгоритмПередПолучениемДанных" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ДанныеXDTO", Новый Структура);
					ДобавитьПеременную(КонтекстОбработчика, "ПолученныеДанные");
				ИначеЕсли ИмяОбработчика = "АлгоритмПриПолученииДанных" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ПолученныеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ДанныеИБ");
					ДобавитьПеременную(КонтекстОбработчика, "КонвертацияСвойств", Новый ТаблицаЗначений);
				КонецЕсли;
				
			ИначеЕсли КонтекстФормы.ИмяКонтекста = "ПОД" Тогда
				
				Если ИмяОбработчика = "АлгоритмПриОбработке" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектОбработки");
					ДобавитьПеременную(КонтекстОбработчика, "ИспользованиеПКО", Новый Структура);
				КонецЕсли;
			КонецЕсли;
			
		Иначе // Конвертация XML
			
			Если КонтекстФормы.ИмяКонтекста = "ПКО" Тогда
				
				Если ИмяОбработчика = "АлгоритмПередВыгрузкойОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ВыгруженныеОбъекты");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "КлючВыгружаемыхДанных");
					ДобавитьПеременную(КонтекстОбработчика, "ЗапоминатьВыгруженные");
					ДобавитьПеременную(КонтекстОбработчика, "НеЗамещатьОбъектПриЗагрузке");
					ДобавитьПеременную(КонтекстОбработчика, "ВсеОбъектыВыгружены");
					ДобавитьПеременную(КонтекстОбработчика, "ТолькоПолучитьУзелСсылки");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "РежимЗаписи");
					ДобавитьПеременную(КонтекстОбработчика, "РежимПроведения");
					ДобавитьПеременную(КонтекстОбработчика, "НеСоздаватьЕслиНеНайден");
				ИначеЕсли ИмяОбработчика = "АлгоритмПриВыгрузкеОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ВыгруженныеОбъекты");
					ДобавитьПеременную(КонтекстОбработчика, "КлючВыгружаемыхДанных");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "СтандартнаяОбработка");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "УзелСсылки");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеВыгрузкиОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ВыгруженныеОбъекты");
					ДобавитьПеременную(КонтекстОбработчика, "КлючВыгружаемыхДанных");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "УзелСсылки");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеВыгрузкиОбъектаВФайлОбмена" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ВыгруженныеОбъекты");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "УзелСсылки");
				ИначеЕсли ИмяОбработчика = "АлгоритмПоследовательностьПолейПоиска" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "НомерВариантаПоиска");
					ДобавитьПеременную(КонтекстОбработчика, "СвойстваПоиска");
					ДобавитьПеременную(КонтекстОбработчика, "ПараметрыОбъекта");
					ДобавитьПеременную(КонтекстОбработчика, "ПрекратитьПоиск");
					ДобавитьПеременную(КонтекстОбработчика, "СсылкаНаОбъект");
					ДобавитьПеременную(КонтекстОбработчика, "УстанавливатьУОбъектаВсеСвойстваПоиска");
					ДобавитьПеременную(КонтекстОбработчика, "СтрокаИменСвойствПоиска");
				ИначеЕсли ИмяОбработчика = "АлгоритмПередЗагрузкойОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "Нпп");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПравила");
					ДобавитьПеременную(КонтекстОбработчика, "Правило");
					ДобавитьПеременную(КонтекстОбработчика, "ГенерироватьНовыйНомерИлиКодЕслиНеУказан");
					ДобавитьПеременную(КонтекстОбработчика, "ТипОбъектаСтрокой");
					ДобавитьПеременную(КонтекстОбработчика, "ТипОбъекта");
					ДобавитьПеременную(КонтекстОбработчика, "НеЗамещатьОбъект");
					ДобавитьПеременную(КонтекстОбработчика, "РежимЗаписи");
					ДобавитьПеременную(КонтекстОбработчика, "РежимПроведения");
				ИначеЕсли ИмяОбработчика = "АлгоритмПриЗагрузкеОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектНайден");
					ДобавитьПеременную(КонтекстОбработчика, "Объект");
					ДобавитьПеременную(КонтекстОбработчика, "НеЗамещатьОбъект");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектМодифицирован");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеЗагрузкиОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "Ссылка");
					ДобавитьПеременную(КонтекстОбработчика, "Объект");
					ДобавитьПеременную(КонтекстОбработчика, "ПараметрыОбъекта");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектМодифицирован");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяТипаОбъекта");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектНайден");
				КонецЕсли;
				
			ИначеЕсли КонтекстФормы.ИмяКонтекста = "ПКПД" Тогда
				
				Если ИмяОбработчика = "АлгоритмПередВыгрузкойОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ВыгруженныеОбъекты");
					ДобавитьПеременную(КонтекстОбработчика, "КлючВыгружаемыхДанных");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "ЗапоминатьВыгруженные");
					ДобавитьПеременную(КонтекстОбработчика, "НеЗамещатьОбъектПриЗагрузке");
					ДобавитьПеременную(КонтекстОбработчика, "ВсеОбъектыВыгружены");
					ДобавитьПеременную(КонтекстОбработчика, "ТолькоПолучитьУзелСсылки");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "РежимЗаписи");
					ДобавитьПеременную(КонтекстОбработчика, "РежимПроведения");
					ДобавитьПеременную(КонтекстОбработчика, "НеСоздаватьЕслиНеНайден");
				ИначеЕсли ИмяОбработчика = "АлгоритмПриВыгрузкеОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ВыгруженныеОбъекты");
					ДобавитьПеременную(КонтекстОбработчика, "КлючВыгружаемыхДанных");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "УзелСсылки");
					ДобавитьПеременную(КонтекстОбработчика, "СтандартнаяОбработка");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеВыгрузкиОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ВыгруженныеОбъекты");
					ДобавитьПеременную(КонтекстОбработчика, "КлючВыгружаемыхДанных");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "УзелСсылки");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеВыгрузкиОбъектаВФайлОбмена" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ВыгруженныеОбъекты");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "УзелСсылки");
				ИначеЕсли ИмяОбработчика = "АлгоритмПередЗагрузкойОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "Нпп");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПравила");
					ДобавитьПеременную(КонтекстОбработчика, "Правило");
					ДобавитьПеременную(КонтекстОбработчика, "ГенерироватьНовыйНомерИлиКодЕслиНеУказан");
					ДобавитьПеременную(КонтекстОбработчика, "ТипОбъектаСтрокой");
					ДобавитьПеременную(КонтекстОбработчика, "ТипОбъекта");
					ДобавитьПеременную(КонтекстОбработчика, "НеЗамещатьОбъект");
					ДобавитьПеременную(КонтекстОбработчика, "РежимЗаписи");
					ДобавитьПеременную(КонтекстОбработчика, "РежимПроведения");
				ИначеЕсли ИмяОбработчика = "АлгоритмПриЗагрузкеОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектНайден");
					ДобавитьПеременную(КонтекстОбработчика, "Объект");
					ДобавитьПеременную(КонтекстОбработчика, "НеЗамещатьОбъект");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектМодифицирован");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеЗагрузкиОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "Ссылка");
					ДобавитьПеременную(КонтекстОбработчика, "Объект");
					ДобавитьПеременную(КонтекстОбработчика, "ПараметрыОбъекта");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектМодифицирован");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяТипаОбъекта");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектНайден");
				КонецЕсли;
				
			ИначеЕсли КонтекстФормы.ИмяКонтекста = "ПКГС" Тогда
				
				Если ИмяОбработчика = "АлгоритмПередОбработкойВыгрузки" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКГС");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "КоллекцияОбъектов");
					ДобавитьПеременную(КонтекстОбработчика, "НеЗамещать");
					ДобавитьПеременную(КонтекстОбработчика, "УзелКоллекцииСвойств");
					ДобавитьПеременную(КонтекстОбработчика, "НеОчищать");
				ИначеЕсли ИмяОбработчика = "АлгоритмПередВыгрузкойСвойства" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКГС");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектКоллекции");
					ДобавитьПеременную(КонтекстОбработчика, "УзелКоллекцииСвойств");
					ДобавитьПеременную(КонтекстОбработчика, "УзелКоллекцииОбъектов");
				ИначеЕсли ИмяОбработчика = "АлгоритмПриВыгрузкеСвойства" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКГС");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектКоллекции");
					ДобавитьПеременную(КонтекстОбработчика, "УзелКоллекцииСвойств");
					ДобавитьПеременную(КонтекстОбработчика, "УзелКоллекцииОбъектов");
					ДобавитьПеременную(КонтекстОбработчика, "УзелОбъектаКоллекции");
					ДобавитьПеременную(КонтекстОбработчика, "СтандартнаяОбработка");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеВыгрузкиСвойства" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКГС");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектКоллекции");
					ДобавитьПеременную(КонтекстОбработчика, "УзелКоллекцииСвойств");
					ДобавитьПеременную(КонтекстОбработчика, "УзелКоллекцииОбъектов");
					ДобавитьПеременную(КонтекстОбработчика, "УзелОбъектаКоллекции");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеОбработкиВыгрузки" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКГС");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "УзелКоллекцииСвойств");
					ДобавитьПеременную(КонтекстОбработчика, "УзелКоллекцииОбъектов");
				КонецЕсли;
				
			ИначеЕсли КонтекстФормы.ИмяКонтекста = "ПКС" Тогда
				
				Если ИмяОбработчика = "АлгоритмПередВыгрузкойСвойства" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКС");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектКоллекции");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "Значение");
					ДобавитьПеременную(КонтекстОбработчика, "ТипПриемника");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКОВидСубконто");
					ДобавитьПеременную(КонтекстОбработчика, "Пусто");
					ДобавитьПеременную(КонтекстОбработчика, "Выражение");
					ДобавитьПеременную(КонтекстОбработчика, "УзелКоллекцииСвойств");
					ДобавитьПеременную(КонтекстОбработчика, "НеЗамещать");
					ДобавитьПеременную(КонтекстОбработчика, "ВыгрузитьОбъект");
				ИначеЕсли ИмяОбработчика = "АлгоритмПриВыгрузкеСвойства" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКС");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектКоллекции");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "Значение");
					ДобавитьПеременную(КонтекстОбработчика, "КлючИЗначение");
					ДобавитьПеременную(КонтекстОбработчика, "ВидСубконто");
					ДобавитьПеременную(КонтекстОбработчика, "Субконто");
					ДобавитьПеременную(КонтекстОбработчика, "Пусто");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКОСвойств");
					ДобавитьПеременную(КонтекстОбработчика, "УзелСвойства");
					ДобавитьПеременную(КонтекстОбработчика, "УзелКоллекцииСвойств");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКОВидСубконто");
					ДобавитьПеременную(КонтекстОбработчика, "ВыгрузитьОбъект");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеВыгрузкиСвойства" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКС");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектКоллекции");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "Значение");
					ДобавитьПеременную(КонтекстОбработчика, "КлючИЗначение");
					ДобавитьПеременную(КонтекстОбработчика, "ВидСубконто");
					ДобавитьПеременную(КонтекстОбработчика, "Субконто");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКОВидСубконто");
					ДобавитьПеременную(КонтекстОбработчика, "ПКОСвойств");
					ДобавитьПеременную(КонтекстОбработчика, "УзелСвойства");
					ДобавитьПеременную(КонтекстОбработчика, "УзелКоллекцииСвойств");
					ДобавитьПеременную(КонтекстОбработчика, "УзелСсылки");
					ДобавитьПеременную(КонтекстОбработчика, "УзелСубконто");
				КонецЕсли;
				
			ИначеЕсли КонтекстФормы.ИмяКонтекста = "ПОД" Тогда
				
				Если ИмяОбработчика = "АлгоритмПередОбработкойПравила" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "Правило");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ВыборкаДанных");
				ИначеЕсли ИмяОбработчика = "АлгоритмПередВыгрузкойОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "Правило");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "Объект");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеВыгрузкиОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Объект");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "УзелСсылки");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеОбработкиПравила" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "Правило");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
				КонецЕсли;
				
			ИначеЕсли КонтекстФормы.ИмяКонтекста = "Конвертации" Тогда
				
				Если ИмяОбработчика = "АлгоритмПередВыгрузкойДанных" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
				ИначеЕсли ИмяОбработчика = "АлгоритмПередПолучениемИзмененныхОбъектов" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "Получатель");
					ДобавитьПеременную(КонтекстОбработчика, "УзелДляФоновогоОбмена");
				ИначеЕсли ИмяОбработчика = "АлгоритмПередВыгрузкойОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "Правило");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "Объект");
				ИначеЕсли ИмяОбработчика = "АлгоритмПередОтправкойИнформацииОбУдалении" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "Ссылка");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
				ИначеЕсли ИмяОбработчика = "АлгоритмПередКонвертациейОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ВыгруженныеОбъекты");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "КлючВыгружаемыхДанных");
					ДобавитьПеременную(КонтекстОбработчика, "ЗапоминатьВыгруженные");
					ДобавитьПеременную(КонтекстОбработчика, "НеЗамещатьОбъектПриЗагрузке");
					ДобавитьПеременную(КонтекстОбработчика, "ВсеОбъектыВыгружены");
					ДобавитьПеременную(КонтекстОбработчика, "ТолькоПолучитьУзелСсылки");
					ДобавитьПеременную(КонтекстОбработчика, "Приемник");
					ДобавитьПеременную(КонтекстОбработчика, "РежимЗаписи");
					ДобавитьПеременную(КонтекстОбработчика, "РежимПроведения");
					ДобавитьПеременную(КонтекстОбработчика, "НеСоздаватьЕслиНеНайден");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеВыгрузкиОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Объект");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПКО");
					ДобавитьПеременную(КонтекстОбработчика, "ВходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "ИсходящиеДанные");
					ДобавитьПеременную(КонтекстОбработчика, "УзелСсылки");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеВыгрузкиДанных" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
				ИначеЕсли ИмяОбработчика = "АлгоритмПередЗагрузкойДанных" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеЗагрузкиПараметров" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "ПричинаОтказа");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеПолученияИнформацииОбУзлахОбмена" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "УзелОбменаЗагрузкаДанных");
				ИначеЕсли ИмяОбработчика = "АлгоритмПередЗагрузкойОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "Нпп");
					ДобавитьПеременную(КонтекстОбработчика, "Источник");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяПравила");
					ДобавитьПеременную(КонтекстОбработчика, "Правило");
					ДобавитьПеременную(КонтекстОбработчика, "ГенерироватьНовыйНомерИлиКодЕслиНеУказан");
					ДобавитьПеременную(КонтекстОбработчика, "ТипОбъектаСтрокой");
					ДобавитьПеременную(КонтекстОбработчика, "ТипОбъекта");
					ДобавитьПеременную(КонтекстОбработчика, "НеЗамещатьОбъект");
					ДобавитьПеременную(КонтекстОбработчика, "РежимЗаписи");
					ДобавитьПеременную(КонтекстОбработчика, "РежимПроведения");
				ИначеЕсли ИмяОбработчика = "АлгоритмПриПолученииИнформацииОбУдалении" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "Объект");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
				ИначеЕсли ИмяОбработчика = "АлгоритмПослеЗагрузкиОбъекта" Тогда
					ДобавитьПеременную(КонтекстОбработчика, "ФайлОбмена");
					ДобавитьПеременную(КонтекстОбработчика, "Отказ");
					ДобавитьПеременную(КонтекстОбработчика, "Ссылка");
					ДобавитьПеременную(КонтекстОбработчика, "Объект");
					ДобавитьПеременную(КонтекстОбработчика, "ПараметрыОбъекта");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектМодифицирован");
					ДобавитьПеременную(КонтекстОбработчика, "ИмяТипаОбъекта");
					ДобавитьПеременную(КонтекстОбработчика, "ОбъектНайден");
				КонецЕсли;
				
			ИначеЕсли КонтекстФормы.ИмяКонтекста = "Алгоритмы" Тогда
				
				ПараметрыАлгоритма = СтрРазделить(Форма.Объект.Параметры, ",", Ложь);
				Для Каждого ИмяПараметра Из ПараметрыАлгоритма  Цикл
					ИмяПараметра = СокрЛП(ИмяПараметра);
					Если СтрНачинаетсяС(НРег(ИмяПараметра), "знач ") Тогда
						ИмяПараметра = СокрЛ(Сред(ИмяПараметра, 5));
					КонецЕсли;
					ПозРавно = СтрНайти(ИмяПараметра, "=");
					Если ПозРавно > 0 Тогда
						ИмяПараметра = СокрП(Лев(ИмяПараметра, ПозРавно - 1));
					КонецЕсли;
					ДобавитьПеременную(КонтекстОбработчика, ИмяПараметра);
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
		
		рк_РедакторКода.УстановитьКонтекстРедактора(Форма, ПараметрыРедактора, КонтекстОбработчика);
	КонецЦикла;
	
КонецПроцедуры

Функция КД3_ЛокальныйКонтекст_ПараметрыКонвертации(КонтекстФормы, ФормаОбъект)
	
	Переменные = Новый Соответствие;
	Переменные[Ложь] = Новый Структура;
	Если НЕ КонтекстФормы.ЭтоКонвертацияXDTO Тогда
		Переменные[Истина] = Новый Структура;
	КонецЕсли;
	
	Если КонтекстФормы.ИмяКонтекста = "Конвертации" Тогда
		ТаблицаПараметров = ФормаОбъект.Параметры;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КонвертацииПараметры.Параметр КАК Параметр,
		|	КонвертацииПараметры.ИспользуетсяПриЗагрузке КАК ИспользуетсяПриЗагрузке,
		|	КонвертацииПараметры.ПередаватьПараметрПриВыгрузке КАК ПередаватьПараметрПриВыгрузке,
		|	КонвертацииПараметры.ТипОбъекта КАК ТипОбъекта
		|ИЗ
		|	Справочник.Конвертации.Параметры КАК КонвертацииПараметры
		|ГДЕ
		|	КонвертацииПараметры.Ссылка В(&Конвертации)";
		Запрос.УстановитьПараметр("Конвертации", КонтекстФормы.Конвертации);
		ТаблицаПараметров = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Для Каждого СтрокаПараметра Из ТаблицаПараметров Цикл
		
		ДляКорреспондента = НЕ КонтекстФормы.ЭтоКонвертацияXDTO И (СтрокаПараметра.ИспользуетсяПриЗагрузке ИЛИ СтрокаПараметра.ПередаватьПараметрПриВыгрузке);
		Переменные[ДляКорреспондента].Вставить(СокрЛП(СтрокаПараметра.Параметр));
		
	КонецЦикла;
	
	Возврат Переменные;
	
КонецФункции

Функция КД3_ЛокальныйКонтекстXML_ЗапросыАлгоритмы(КонтекстФормы, ИмяСправочника)
	
	Переменные = Новый Соответствие;
	Переменные[Ложь] = Новый Структура;
	Если НЕ КонтекстФормы.ЭтоКонвертацияXDTO Тогда
		Переменные[Истина] = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Правила.Код КАК Имя,
	|	Правила.ИспользуетсяПриЗагрузке КАК ИспользуетсяПриЗагрузке
	|ИЗ
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник." + ИмяСправочника + " КАК Правила
	|		ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|ГДЕ
	|	СоставыКонвертаций.Владелец В (&Конвертации)
	|	И НЕ Правила.ПометкаУдаления";
	Запрос.УстановитьПараметр("Конвертации", КонтекстФормы.Конвертации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДляКорреспондента = НЕ КонтекстФормы.ЭтоКонвертацияXDTO И Выборка.ИспользуетсяПриЗагрузке;
		Переменные[ДляКорреспондента].Вставить(СокрЛП(Выборка.Имя));
	КонецЦикла;
	
	Возврат Переменные;
	
КонецФункции

Процедура КД3_ЛокальныйКонтекстXDTO_ДобавитьАлгоритмы(Контекст, КонтекстФормы)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Правила.Код КАК Имя,
	|	Правила.Параметры КАК Параметры
	|ИЗ
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Алгоритмы КАК Правила
	|		ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|ГДЕ
	|	СоставыКонвертаций.Владелец В(&Конвертации)
	|	И НЕ Правила.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Конвертации", КонтекстФормы.Конвертации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьФункцию(Контекст, СокрЛП(Выборка.Имя), Выборка.Параметры, "");
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область Настройки

// Проверяет версию платформы 1С на соответствие требуемой
//
// Параметры:
//  ТребуемаяВерсия - Строка - версия в формате "X.Y.Z"
//
// Возвращаемое значение:
// Булево - Истина, если номер ерсии платформы 1С больше или равна требуемой
//
Функция СравнитьВерсиюПлатформы(ТребуемаяВерсия) Экспорт
	
	Инфо = Новый СистемнаяИнформация;
	
	ЧастиВерсии1 = СтрРазделить(Инфо.ВерсияПриложения, ".");
	ЧастиВерсии2 = СтрРазделить(ТребуемаяВерсия, ".");
	
	Для НомРазряда = 0 По 2 Цикл
		Разница = Число(ЧастиВерсии1[НомРазряда]) - Число(ЧастиВерсии2[НомРазряда]);
		Если Разница <> 0 Тогда
			Возврат Разница >= 0;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ИспользоватьРедактор(НовоеЗначение = Неопределено) Экспорт
	
	КлючНастроек = "ИспользоватьРедактор";
	Если НовоеЗначение = Неопределено Тогда
		Возврат ЗагрузитьНастройкиИзХранилища(КлючНастроек, Истина);
	Иначе
		Возврат СохранитьНастройкиВХранилище(КлючНастроек, НовоеЗначение);
	КонецЕсли;
	
КонецФункции

Функция ПодсказкаПоМетаданным(НовоеЗначение = Неопределено) Экспорт
	
	КлючНастроек = "ПодсказкаПоМетаданным";
	Если НовоеЗначение = Неопределено Тогда
		Возврат ЗагрузитьНастройкиИзХранилища(КлючНастроек, Истина);
	Иначе
		Возврат СохранитьНастройкиВХранилище(КлючНастроек, НовоеЗначение);
	КонецЕсли;
	
КонецФункции

// Получает настройки редактора кода для текущего пользователя
// 
// Возвращаемое значение:
//   Структура - Настройки редактора:
//     * ПодсказкаПоМетаданным - Булево - получать и отображать метаданные для подсказки
//     * ОбработчикМодуулей - Строка - имя обработчика для разбора кода модулей или Неопределено, если используется обработчик bsl_console
//     * Тема - Строка - название темы
//     * БыстрыеПодсказки - Булево - включены ли быстрые подсказки
//     * КартаКода - Булево - отображать ли карту кода
//     * ПробелыИТабуляции - Булево - отображать ли пробелы и табуляции
//     * СтрокаСостояния - Булево - отображать ли строку состояния
//     * ЯзыкПодсказок - Строка - имя языка подсказок
//     * ОтключитьВстроенныеСниппеты - Булево - использовать встроенные в bsl_console сниппеты или нет
//     * ПутьКШаблонамКода - Строка - путь к файлу шаблонов кода
//
Функция НовыеНастройки() Экспорт
	
	Настройки = Новый Структура;
	
	Настройки.Вставить("Тема", "bsl-white");
	Настройки.Вставить("БыстрыеПодсказки", Истина);
	Настройки.Вставить("КартаКода", Истина);
	Настройки.Вставить("ПробелыИТабуляции", Ложь);
	Настройки.Вставить("СтрокаСостояния", Истина);
	Настройки.Вставить("ЯзыкПодсказок", "ru");
	Настройки.Вставить("ОтключитьВстроенныеСниппеты", Ложь);
	Настройки.Вставить("ПутьКШаблонамКода", "");
	
	Возврат Настройки;
	
КонецФункции

Функция Настройки(Настройки = Неопределено) Экспорт
	
	КлючНастроек = "Настройки";
	Если Настройки = Неопределено Тогда
		Возврат ЗагрузитьНастройкиИзХранилища(КлючНастроек, НовыеНастройки());
	Иначе
		Возврат СохранитьНастройкиВХранилище(КлючНастроек, Настройки);
	КонецЕсли;
	
КонецФункции

Функция НовыеНастройкиКонфигурации() Экспорт
	
	Настройки = Новый Структура;
	
	Настройки.Вставить("ОбработчикМодулей", "");
	Настройки.Вставить("ВнешниеМетаданные", Ложь);
	Настройки.Вставить("ЭтоИсходникиEDT", Ложь);
	Настройки.Вставить("ПутьКИсходникамКонфигурации", "");
	Настройки.Вставить("ПутьКИсходникамРасширений", Новый Массив);
	
	Возврат Настройки;
	
КонецФункции

Функция НастройкиКонфигурации(Настройки = Неопределено) Экспорт
	
	КлючНастроек = "НастройкиКонфигурации";
	Если Настройки = Неопределено Тогда
		Возврат ЗагрузитьНастройкиИзХранилища(КлючНастроек, НовыеНастройкиКонфигурации());
	Иначе
		Возврат СохранитьНастройкиВХранилище(КлючНастроек, Настройки);
	КонецЕсли;
	
КонецФункции

Функция СлужебныеНастройки(Настройки = Неопределено) Экспорт
	
	КлючНастроек = "СлужебныеНастройки";
	Если Настройки = Неопределено Тогда
		Возврат ЗагрузитьНастройкиИзХранилища(КлючНастроек, НовыеСлужебныеНастройки());
	Иначе
		Возврат СохранитьНастройкиВХранилище(КлючНастроек, Настройки);
	КонецЕсли;
	
КонецФункции

Функция НовыеСлужебныеНастройки() Экспорт
	
	Настройки = Новый Структура;
	
	Настройки.Вставить("ЯзыкКонсоли", "ru");
	Настройки.Вставить("МакетРедактора", "рк_РедакторКодаУпакованный");
	Настройки.Вставить("ПоддержкаXML", Истина);
	Настройки.Вставить("ПоддержкаYAML", Истина);
	Настройки.Вставить("ПоддержкаJSON", Истина);
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

#Область Инициализация

Функция НовыеПараметрыИнициализации(ЭлементТекст = Неопределено, ЭлементHTML  = Неопределено, РеквизитHTML  = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("РежимЯзыка", "bsl");
	Результат.Вставить("ЭлементHTML", ЭлементHTML);
	Результат.Вставить("РеквизитHTML", РеквизитHTML);
	Результат.Вставить("ЭлементТекст", ЭлементТекст);
	Результат.Вставить("РеквизитТекст");
	Результат.Вставить("ЭлементСтраница");
	
	Результат.Вставить("Конфигурация");
	Результат.Вставить("Параметры", Новый Структура); // Произвольные параметры для сохранения в редакторе
	Результат.Вставить("Настройки", Новый Структура); // Переопределяемые общие настройки
	Результат.Вставить("Контекст", Новый Структура);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработчикПриСозданииНаСервере(Форма, НовыеРедакторы, НастройкиКонфигураций = Неопределено) Экспорт
	
	НормализованныеПараметры = НормализоватьПараметрыИнициализации(Форма, НовыеРедакторы);
	
	ДобавитьРеквизитыФормы(Форма, НормализованныеПараметры);
	
	ОбщиеПараметры = рк_РедакторКодаКлиентСервер.ОбщиеПараметры(Форма);
	ОбщиеПараметры.Вставить("АдресНастройки", ПоместитьВоВременноеХранилище(Настройки(), Форма.УникальныйИдентификатор));
	ОбщиеПараметры.Вставить("ИспользоватьРедактор", ИспользоватьРедактор());
	ОбщиеПараметры.Вставить("ПодсказкаПоМетаданным", ПодсказкаПоМетаданным());
	
	Если НормализованныеПараметры.Количество() = 1 И НормализованныеПараметры[0].ЭлементТекст = Неопределено Тогда
		// Если указан только один редактор HTML, то он будет доступен по-умолчанию
		ОбщиеПараметры.ИспользоватьРедактор = Истина;
	КонецЕсли;
	
	КонфигурацииРедакторов = ДобавитьРедакторы(Форма, НормализованныеПараметры);
	
	СохранитьНастройкиКонфигураций(Форма, КонфигурацииРедакторов, НастройкиКонфигураций);
	
	Если ОбщиеПараметры.ИспользоватьРедактор Тогда
		УстановитьВебСтраницыРедакторов(Форма, ОбщиеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Необходим для обновления текста редактора при нажатии кнопки "Перечитать" в форме объекта
// Дополнительно нужно подключить обработчик ожидания, в котором будет проверяться текущая версия
//
Процедура ОбработчикПриЧтенииНаСервере(Форма) Экспорт
	
	ОбщиеПараметры = рк_РедакторКодаКлиентСервер.ОбщиеПараметры(Форма);
	Если ОбщиеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщиеПараметры.Вставить("ВерсияДанныхОбъекта", "");
	
КонецПроцедуры

#КонецОбласти

Функция ДанныеВJSON(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ДанныеИзJSON(ДанныеJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеJSON);
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

#Область ПользовательскийКонтекст

Функция НовыйКонтекст() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("customObjects", Новый Структура);
	Результат.Вставить("customFunctions", Новый Структура);
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьКонтекст(КонтекстПрименик, КонтекстИсточник) Экспорт
	
	Для Каждого КлючИЗначение Из КонтекстИсточник.customObjects Цикл
		КонтекстПрименик.customObjects.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	Для Каждого КлючИЗначение Из КонтекстИсточник.customFunctions Цикл
		КонтекстПрименик.customFunctions.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьКонтекстРедактора(Форма, ПараметрыРедактора, Контекст) Экспорт
	
	ОписаниеЗапроса = Новый Структура;
	ОписаниеЗапроса.Вставить("Тип", "Контекст");
	ОписаниеЗапроса.Вставить("Данные", ДанныеВJSON(Контекст));
	
	РезультатыЗапроса = Новый Соответствие;
	РезультатыЗапроса["Контекст"] = ОписаниеЗапроса;
	
	ПараметрыРедактора.Вставить("АдресКонтекст", ПоместитьВоВременноеХранилище(РезультатыЗапроса, Форма.УникальныйИдентификатор));
	
КонецПроцедуры

Процедура ДобавитьПеременную(Контекст, ИмяПеременной, ЗначениеПеременной = Неопределено) Экспорт
	
	Если ЗначениеПеременной = Неопределено Тогда
		ОписаниеЗначения = Новый Структура;
	Иначе
		ОписаниеЗначения = НовоеЗначение(ЗначениеПеременной, 1);
	КонецЕсли;
	
	ЧастиИмени = СтрРазделить(ИмяПеременной, ".");
	Если ЧастиИмени.Количество() = 1 Тогда
		Контекст.customObjects.Вставить(ИмяПеременной, ОписаниеЗначения);
	Иначе
		ВладелецЗначения = Контекст.customObjects;
		Для Ном = 0 По ЧастиИмени.ВГраница() - 1 Цикл
			ИмяСвойства = ЧастиИмени[Ном];
			Если НЕ ВладелецЗначения.Свойство(ИмяСвойства) Тогда
				ВладелецЗначения.Вставить(ИмяСвойства);
			КонецЕсли;
			ВладелецЗначения = ВладелецЗначения[ИмяСвойства];
			Если НЕ ВладелецЗначения.Свойство("properties") Тогда
				ВладелецЗначения.Вставить("properties", Новый Структура);
			КонецЕсли;
			ВладелецЗначения = ВладелецЗначения.properties;
		КонецЦикла;
		ВладелецЗначения.Вставить(ЧастиИмени[Ном], ОписаниеЗначения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьФункцию(Контекст, Имя, Параметры = "", Описание = "") Экспорт
	
	ОписаниеПараметров = Новый Структура;
	
	Для Каждого ИмяПараметра Из СтрРазделить(Параметры, ",", Ложь) Цикл
		
		ИмяПараметра = СокрЛ(ИмяПараметра);
		Если НРег(Лев(ИмяПараметра, 5)) = "знач " Тогда
			ИмяПараметра = Сред(ИмяПараметра, 5);
		КонецЕсли;
		ПозРавно = СтрНайти(ИмяПараметра, "=");
		Если ПозРавно <> 0 Тогда
			ИмяПараметра = Лев(ИмяПараметра, ПозРавно - 1);
		КонецЕсли;
		ОписаниеПараметров.Вставить(ИмяПараметра, СокрЛП(ИмяПараметра));
		
	КонецЦикла;
	
	ОписаниеМетода = Новый Структура;
	ОписаниеМетода.Вставить("name", Имя);
	ОписаниеМетода.Вставить("description", Описание);
	ОписаниеМетода.Вставить("signature", Новый Структура("default", Новый Структура));
	
	ОписаниеМетода.signature.default.Вставить("СтрокаПараметров", СтрШаблон("(%1)", Параметры));
	ОписаниеМетода.signature.default.Вставить("Параметры", ОписаниеПараметров);
	
	Контекст.customFunctions.Вставить(Имя, ОписаниеМетода);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Настройки

Функция ЗагрузитьНастройкиИзХранилища(КлючНастроек, НовыеНастройки)
	
	КлючОбъекта = "рк_РедакторКода";
	СохраненныеНастройки = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек);
	Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(НовыеНастройки, СохраненныеНастройки);
	ИначеЕсли ТипЗнч(СохраненныеНастройки) = ТипЗнч(НовыеНастройки) Тогда
		НовыеНастройки = СохраненныеНастройки;
	КонецЕсли;
	Возврат НовыеНастройки;
	
КонецФункции

Функция СохранитьНастройкиВХранилище(КлючНастроек, Настройки)
	
	КлючОбъекта = "рк_РедакторКода";
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, Настройки);
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

#Область Инициализация

Функция ПодготовитьФайлыРедактора(УникальныйИдентификаторФормы) Экспорт
	
	СлужебныеНастройки = СлужебныеНастройки();
	Если СлужебныеНастройки.МакетРедактора = "рк_РедакторКода" Тогда
		Возврат ПодготовитьФайлыРедактораОбычный(УникальныйИдентификаторФормы);
	ИначеЕсли СлужебныеНастройки.МакетРедактора = "рк_РедакторКодаУпакованный" Тогда
		Возврат ПодготовитьФайлыРедактораУпакованный(УникальныйИдентификаторФормы);
	КонецЕсли;
	
	Возврат Неопределено; // Не известный макет файлов редактора
	
КонецФункции

// Получение и подготовка веб-страниц на основе уже измененных веб-страниц и общих скриптов
// Описание процесса изменения веб-страниц и объединения скриптов см. ПодготовитьФайлыРедактораОбычный()
//
Функция ПодготовитьФайлыРедактораУпакованный(УникальныйИдентификаторФормы)
	
	// Извлечение файлов исходников редактора из макета
	
	Если рк_РедакторКодаКлиентСервер.СравнитьВерсиюПлатформы("8.3.26") Тогда
		МенеджерАрхива = Новый ("ЧтениеФайлаАрхива");
	Иначе
		МенеджерАрхива = Новый ("ЧтениеZipФайла");
	КонецЕсли;
	
	КаталогВременныхФайлов = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(КаталогВременныхФайлов);
	
	ДвоичныеДанныеАрхива = ПолучитьОбщийМакет("рк_РедакторКодаУпакованный");
	
	МенеджерАрхива.Открыть(ДвоичныеДанныеАрхива.ОткрытьПотокДляЧтения());
	МенеджерАрхива.ИзвлечьВсе(КаталогВременныхФайлов);
	МенеджерАрхива.Закрыть();
	МенеджерАрхива = Неопределено;
	
	ДвоичныеДанныеАрхива = Неопределено;
	
	// Подготовка таблицы файлов и веб-страниц исходников редактора
	
	ФайлыПрочие = Новый Соответствие;
	ВебСтраницы = Новый Соответствие;
	
	НайденныеФайлы = НайтиФайлы(КаталогВременныхФайлов, "*.*", Истина);
	
	ДлинаКорневогоПути = СтрДлина(КаталогВременныхФайлов);
	Для Каждого НайденныйФайл Из НайденныеФайлы Цикл
		
		Если НайденныйФайл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяФайла = СтрЗаменить(Сред(НайденныйФайл.ПолноеИмя, ДлинаКорневогоПути + 2), "\", "/");
		
		Если НайденныйФайл.Расширение = ".html" Тогда
			
			ЧтениеТекста = Новый ЧтениеТекста(НайденныйФайл.ПолноеИмя);
			ДанныеФайла = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();
			
			ВебСтраницы[ИмяФайла] = ДанныеФайла;
		Иначе
			ФайлыПрочие[ИмяФайла] = Новый ДвоичныеДанные(НайденныйФайл.ПолноеИмя);
		КонецЕсли;
		
	КонецЦикла;
	
	УдалитьФайлы(КаталогВременныхФайлов);
	
	// Подготовка веб-страниц
	
	Для Каждого ОписаниеВебСтраницы Из ВебСтраницы Цикл
		
		ТекстHTML = ОписаниеВебСтраницы.Значение;
		
		Для Каждого ОписаниеФайла Из ФайлыПрочие Цикл
			
			ДанныеФайла = ОписаниеФайла.Значение;
			ИмяФайла = ОписаниеФайла.Ключ;
			
			ТекстЭлемента = СтрШаблон("src=""%1""", ИмяФайла);
			ПозСтроки = СтрНайти(ТекстHTML, ТекстЭлемента);
			Если ПозСтроки > 0 Тогда
				// Замены ссылки с файлом на ссылку с адресом временного хранилища. При открытии страницы будет вызов сервера
				АдресФайла = ПоместитьВоВременноеХранилище(ДанныеФайла, УникальныйИдентификаторФормы);
				НовыйТекстЭлемента = СтрШаблон("src=""%1""", АдресФайла);
				ТекстHTML = СтрЗаменить(ТекстHTML, ТекстЭлемента, НовыйТекстЭлемента);
			КонецЕсли;
		КонецЦикла;
		
		ВебСтраницы[ОписаниеВебСтраницы.Ключ] = ТекстHTML;
		
	КонецЦикла;
	
	Возврат ВебСтраницы;
	
КонецФункции

// Подготовка веб-страниц и объединение скриптов для отображения веб-страницы в виде одного файла
//
Функция ПодготовитьФайлыРедактораОбычный(УникальныйИдентификаторФормы)
	
	СлужебныеНастройки = СлужебныеНастройки();
	
	// Извлечение файлов исходников редактора из макета
	
	Если рк_РедакторКодаКлиентСервер.СравнитьВерсиюПлатформы("8.3.26") Тогда
		МенеджерАрхива = Новый ("ЧтениеФайлаАрхива");
	Иначе
		МенеджерАрхива = Новый ("ЧтениеZipФайла");
	КонецЕсли;
	
	КаталогВременныхФайлов = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(КаталогВременныхФайлов);
	
	ДвоичныеДанныеАрхива = ПолучитьОбщийМакет("рк_РедакторКода");
	
	МенеджерАрхива.Открыть(ДвоичныеДанныеАрхива.ОткрытьПотокДляЧтения());
	МенеджерАрхива.ИзвлечьВсе(КаталогВременныхФайлов);
	МенеджерАрхива.Закрыть();
	МенеджерАрхива = Неопределено;
	
	ДвоичныеДанныеАрхива = Неопределено;
	
	// Подготовка таблицы файлов и веб-страниц исходников редактора
	
	ФайлыСтилей = Новый Соответствие;
	ФайлыПрочие = Новый Соответствие;
	ВебСтраницы = Новый Соответствие;
	
	НайденныеФайлы = НайтиФайлы(КаталогВременныхФайлов, "*.*", Истина);
	
	// Имена файлов js, которые будут объединены в единый скрипт в указанной последовательности
	
	ИсключитьФайлы = Новый Массив;
	ОбщиеСкрипты = Новый Массив;
	
	ОбщиеСкрипты.Добавить("tingle.js");
	
	ОбщиеСкрипты.Добавить("vs/loader.js");
	
	Если СлужебныеНастройки.ЯзыкКонсоли = "ru" Тогда
		ФайлыПрочие["#config#"] = "require.config({'vs/nls':{availableLanguages:{'*':'ru'}}});";
		ОбщиеСкрипты.Добавить("#config#");
		ОбщиеСкрипты.Добавить("vs/editor/editor.main.nls.ru.js");
		ИсключитьФайлы.Добавить("vs/editor/editor.main.nls.js");
	Иначе
		ОбщиеСкрипты.Добавить("vs/editor/editor.main.nls.js");
		ИсключитьФайлы.Добавить("vs/editor/editor.main.nls.ru.js");
	КонецЕсли;
	
	Если СлужебныеНастройки.ПоддержкаXML Тогда
		ОбщиеСкрипты.Добавить("vs/basic-languages/xml/xml.js");
	КонецЕсли;
	Если СлужебныеНастройки.ПоддержкаJSON Тогда
		ОбщиеСкрипты.Добавить("vs/basic-languages/json/json.js");
	КонецЕсли;
	Если СлужебныеНастройки.ПоддержкаYAML Тогда
		ОбщиеСкрипты.Добавить("vs/basic-languages/yaml/yaml.js");
	КонецЕсли;
	
	ОбщиеСкрипты.Добавить("vs/editor/editor.main.js");
	
	ОбщиеСкрипты.Добавить("bslMetadata.js");
	ОбщиеСкрипты.Добавить("bslGlobals.js");
	ОбщиеСкрипты.Добавить("snippets.js");
	ОбщиеСкрипты.Добавить("bsl_helper.js");
	ОбщиеСкрипты.Добавить("bsl_language.js");
	ОбщиеСкрипты.Добавить("actions.js");
	ОбщиеСкрипты.Добавить("bslQuery.js");
	ОбщиеСкрипты.Добавить("bslDCS.js");
	ОбщиеСкрипты.Добавить("colors.js");
	ОбщиеСкрипты.Добавить("finder.js");
	ОбщиеСкрипты.Добавить("parsers.js");
	ОбщиеСкрипты.Добавить("editor.js");
	
	ДлинаКорневогоПути = СтрДлина(КаталогВременныхФайлов);
	Для Каждого НайденныйФайл Из НайденныеФайлы Цикл
		
		Если НайденныйФайл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяФайла = СтрЗаменить(Сред(НайденныйФайл.ПолноеИмя, ДлинаКорневогоПути + 2), "\", "/");
		
		Если НайденныйФайл.Расширение = ".html" Тогда
			
			ЧтениеТекста = Новый ЧтениеТекста(НайденныйФайл.ПолноеИмя);
			ВебСтраницы[ИмяФайла] = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();
			
		ИначеЕсли НайденныйФайл.Расширение = ".css" Тогда
			
			ЧтениеТекста = Новый ЧтениеТекста(НайденныйФайл.ПолноеИмя, КодировкаТекста.UTF8);
			ФайлыСтилей[ИмяФайла] = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();
			
		ИначеЕсли НайденныйФайл.Расширение = ".js" И ОбщиеСкрипты.Найти(ИмяФайла) <> Неопределено Тогда
			
			ЧтениеТекста = Новый ЧтениеТекста(НайденныйФайл.ПолноеИмя, КодировкаТекста.UTF8);
			ФайлыПрочие[ИмяФайла] = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();
			
		ИначеЕсли ИсключитьФайлы.Найти(ИмяФайла) = Неопределено Тогда
			ФайлыПрочие[ИмяФайла] = Новый ДвоичныеДанные(НайденныйФайл.ПолноеИмя);
		КонецЕсли;
		
	КонецЦикла;
	
	УдалитьФайлы(КаталогВременныхФайлов);
	
	// Изменение файлов

	// Удаление из css загрузки шрифта из файла, т.к. он добавлен ранее в "decorations.css"
	ФайлыСтилей["vs/editor/editor.main.css"] = СтрЗаменить(ФайлыСтилей["vs/editor/editor.main.css"], "@font-face{font-family:codicon;src:url(../base/browser/ui/codiconLabel/codicon/codicon.ttf) format(""truetype"")}", "");
	
	// Удаление зависимости "editor.main.js" от "vs/editor/editor.main.css", т.к. стили будут вставлены в веб-страницу, а в загрузчике используется обработчик после загрузки элемента CSS
	// Зависимость заменяется на предыдущую, а не удаляется, т.к. код editor.main.js использует номер зависимости в массиве зависимостей
	ФайлыПрочие["vs/editor/editor.main.js"] = СтрЗаменить(ФайлыПрочие["vs/editor/editor.main.js"], "vs/css!vs/editor/editor.main", "vs/nls!vs/editor/editor.main");
	
	Если СлужебныеНастройки.ПоддержкаJSON Тогда
		ТекстФайла = ФайлыПрочие["vs/editor/editor.main.js"];
		// Удаление строки с описанием форматов json через WebWorker
		// Удаление зависимости в define от удаленного описания json
		ПозНачала = СтрНайти(ТекстФайла, "define(""vs/language/json/monaco.contribution""");
		ПозКонца = СтрНайти(ТекстФайла, Символы.ПС, НаправлениеПоиска.СНачала, ПозНачала);
		ТекстФайла = Лев(ТекстФайла, ПозНачала - 1) + СтрЗаменить(Сред(ТекстФайла, ПозКонца + 1), ",""vs/language/json/monaco.contribution""", "");
		// Добавление упрощенного кода формата json без использования WebWorker (по аналогии с кодом формата xml) перед кодом формата xml. define добавлять не надо, т.к. блок с описанием xml входит в блок общих define форматов
		ТекстПоиска = ",define(""vs/basic-languages/xml/xml.contribution""";
		ТекстЗамены = ",define(""vs/basic-languages/json/json.contribution"",[""require"",""exports"",""../_.contribution""],(function(e,i,t){""use strict"";Object.defineProperty(i,""__esModule"",{value:!0}),t.registerLanguage({id:""json"",extensions:["".json""],aliases:[""JSON"", ""json""],mimetypes:[""application/json""],loader:function(){return new Promise((function(i,t){e([""./json""],i,t)}))}})}))"
			+ ТекстПоиска;
		ФайлыПрочие["vs/editor/editor.main.js"] = СтрЗаменить(ТекстФайла, ТекстПоиска, ТекстЗамены);
	КонецЕсли;
	
	// Подготовка файла общего скрипта
	
	ИмяФайлаОбщегоСкрипта = ПолучитьИмяВременногоФайла();
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаОбщегоСкрипта, КодировкаТекста.UTF8);
	
	Для Каждого ИмяФайла Из ОбщиеСкрипты Цикл
		ДанныеФайла = ФайлыПрочие[ИмяФайла];
		Если ДанныеФайла = Неопределено Тогда
			Продолжить; // Сообщить("Не найден файл " + ИмяФайла);
		КонецЕсли;
		ЗаписьТекста.Записать(ДанныеФайла);
		ЗаписьТекста.Записать(Символы.ПС);
		ФайлыПрочие[ИмяФайла] = Неопределено;
	КонецЦикла;
	ЗаписьТекста.Закрыть();
	// Замена загрузки loader.js на общий скрипт
	ФайлыПрочие["vs/loader.js"] = Новый ДвоичныеДанные(ИмяФайлаОбщегоСкрипта);
	
	УдалитьФайлы(ИмяФайлаОбщегоСкрипта);
	
	// Подготовка веб-страниц для использования в 1С
	
	Для Каждого ОписаниеВебСтраницы Из ВебСтраницы Цикл
		
		ТекстHTML = ОписаниеВебСтраницы.Значение;
		
		Для Каждого ОписаниеФайла Из ФайлыПрочие Цикл
			
			ДанныеФайла = ОписаниеФайла.Значение;
			ИмяФайла = ОписаниеФайла.Ключ;
			
			ТекстЭлемента = СтрШаблон("src=""%1""", ИмяФайла);
			ПозСтроки = СтрНайти(ТекстHTML, ТекстЭлемента);
			Если ПозСтроки > 0 Тогда
				НачПоз = СтрНайти(ТекстHTML, "<script", НаправлениеПоиска.СКонца, ПозСтроки);
				КонПоз = СтрНайти(ТекстHTML, ">", НаправлениеПоиска.СНачала, ПозСтроки, 2);
				ПолныйТекстЭлемента = Сред(ТекстHTML, НачПоз, КонПоз - НачПоз + 1);
				Если ДанныеФайла = Неопределено Тогда
					// Файл добавлен в общий скрипт - удаление ссылки загрузки
					ТекстHTML = СтрЗаменить(ТекстHTML, ПолныйТекстЭлемента, "");
				Иначе
					// Замены ссылки с файлом на ссылку с адресом временного хранилища
					АдресФайла = ПоместитьВоВременноеХранилище(ДанныеФайла, УникальныйИдентификаторФормы);
					НовыйТекстЭлемента = СтрШаблон("<script async=""async"" src=""%1""></script>", АдресФайла);
					ТекстHTML = СтрЗаменить(ТекстHTML, ПолныйТекстЭлемента, НовыйТекстЭлемента);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Замена файлов CSS на веб-странице
		
		Для Каждого ОписаниеСтиля Из ФайлыСтилей Цикл
			
			ТекстФайлаСтиля = ОписаниеСтиля.Значение;
			ПолноеИмяФайла = ОписаниеСтиля.Ключ;
			
			ТекстЭлемента = СтрШаблон("href=""%1""", ПолноеИмяФайла);
			ПозСтроки = СтрНайти(ТекстHTML, ТекстЭлемента);
			Если ПозСтроки > 0 Тогда
				НачПоз = СтрНайти(ТекстHTML, "<link", НаправлениеПоиска.СКонца, ПозСтроки);
				КонПоз = СтрНайти(ТекстHTML, ">", НаправлениеПоиска.СНачала, ПозСтроки);
				ПолныйТекстЭлемента = Сред(ТекстHTML, НачПоз, КонПоз - НачПоз + 1);
				
				НовыйТекстЭлемента = СтрШаблон("<style>%1</style>", ТекстФайлаСтиля);
				ТекстHTML = СтрЗаменить(ТекстHTML, ПолныйТекстЭлемента, НовыйТекстЭлемента);
			КонецЕсли;
			
		КонецЦикла;
		
		ВебСтраницы[ОписаниеВебСтраницы.Ключ] = ТекстHTML;
	КонецЦикла;
	
	Возврат ВебСтраницы;
	
КонецФункции

// Нормализует параметры инициализации
//
// Параметры:
//   ПараметрыИнициализации - Строка, ЭлементФормы, Структура, Неопределено - параметры инициализации
//
// Возвращаемое значение:
//   Массив - Нормализованные параметры. Массив структур рк_РедакторКода.ПараметрыИнициализации()
//     *Имя - ЭлементФорм - Элемент редактора на форме
//     *ЗаменитьЭлементНаФорме - Булево - Истина, если в Имя элемент формы с текстовым полем, которое нужно заменить на редактор
//     *ПереопределитьНастройки - Структура рк_РедакторКода.НастройкиПоУмолчанию(). Все текущие настройки с учетом переданныых в ПараметрыИнициализации
//
Функция НормализоватьПараметрыИнициализации(Форма, НовыеРедакторы)
	
	НормализованныеПараметры = Новый Массив;
	
	Если ТипЗнч(НовыеРедакторы) = Тип("Массив") Тогда
		МассивПараметров = НовыеРедакторы;
	Иначе
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(НовыеРедакторы);
	КонецЕсли;
	Для Каждого ИмяИлиЭлементИлиПараметры Из МассивПараметров Цикл
		
		Если ТипЗнч(ИмяИлиЭлементИлиПараметры) = Тип("Структура") Тогда
			// Переданы готовые параметры инициализации
			ПараметрыЭлемента = ИмяИлиЭлементИлиПараметры;
		Иначе
			ПараметрыЭлемента = НовыеПараметрыИнициализации();
			
			Если ТипЗнч(ИмяИлиЭлементИлиПараметры) = Тип("Строка") Тогда
				Элемент = Форма.Элементы.Найти(ИмяИлиЭлементИлиПараметры);
			Иначе
				Элемент = ИмяИлиЭлементИлиПараметры;
			КонецЕсли;
			Если Элемент.Вид = ВидПоляФормы.ПолеHTMLДокумента Тогда
				ПараметрыЭлемента.ЭлементHTML = ИмяИлиЭлементИлиПараметры;
			Иначе
				ПараметрыЭлемента.ЭлементТекст = ИмяИлиЭлементИлиПараметры;
			КонецЕсли;
		КонецЕсли;
		
		НормализованныеПараметры.Добавить(ПараметрыЭлемента);
	КонецЦикла;
	
	Для Каждого ПараметрыЭлемента Из НормализованныеПараметры Цикл
		
		Если ТипЗнч(ПараметрыЭлемента.ЭлементТекст) = Тип("Строка") Тогда
			Элемент = Форма.Элементы.Найти(ПараметрыЭлемента.ЭлементТекст);
			Если Элемент = Неопределено Тогда
				ВызватьИсключение СтрШаблон(НСтр("ru='Не найден элемент Текст %1'"), ПараметрыЭлемента.ЭлементТекст);
			КонецЕсли;
			ПараметрыЭлемента.ЭлементТекст = Элемент;
		КонецЕсли;
		Если ПараметрыЭлемента.ЭлементТекст <> Неопределено И ПараметрыЭлемента.РеквизитТекст = Неопределено Тогда
			ПараметрыЭлемента.РеквизитТекст = ПараметрыЭлемента.ЭлементТекст.ПутьКДанным;
		КонецЕсли;
		
		Если ТипЗнч(ПараметрыЭлемента.ЭлементHTML) = Тип("Строка") Тогда
			Элемент = Форма.Элементы.Найти(ПараметрыЭлемента.ЭлементHTML);
			Если Элемент = Неопределено Тогда
				ВызватьИсключение СтрШаблон(НСтр("ru='Не найден элемент HTML %1'"), ПараметрыЭлемента.ЭлементHTML);
			КонецЕсли;
			ПараметрыЭлемента.ЭлементHTML = Элемент;
		КонецЕсли;
		Если ПараметрыЭлемента.ЭлементHTML <> Неопределено И ПараметрыЭлемента.РеквизитHTML = Неопределено Тогда
			ПараметрыЭлемента.РеквизитHTML = ПараметрыЭлемента.ЭлементHTML.ПутьКДанным;
		КонецЕсли;
		
		Если ТипЗнч(ПараметрыЭлемента.ЭлементСтраница) = Тип("Строка") Тогда
			Элемент = Форма.Элементы.Найти(ПараметрыЭлемента.ЭлементСтраница);
			Если Элемент = Неопределено Тогда
				ВызватьИсключение СтрШаблон(НСтр("ru='Не найден элемент-страница %1'"), ПараметрыЭлемента.ЭлементСтраница);
			КонецЕсли;
			ПараметрыЭлемента.ЭлементСтраница = Элемент;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НормализованныеПараметры;
	
КонецФункции

Процедура ДобавитьРеквизитыФормы(Форма, НормализованныеПараметры)
	
	НовыеРеквизиты = Новый Массив;
	
	КлючПроверки = Новый УникальныйИдентификатор;
	Для Каждого КлючИЗначение Из рк_РедакторКодаКлиентСервер.ИменаСлужебныхРеквизитов() Цикл
		ИмяРеквизита = КлючИЗначение.Значение.Имя;
		ТекстФорма = Новый Структура(ИмяРеквизита, КлючПроверки);
		ЗаполнитьЗначенияСвойств(ТекстФорма, Форма);
		Если ТекстФорма[ИмяРеквизита] = КлючПроверки Тогда
			НовыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита, КлючИЗначение.Значение.Тип));
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ПараметрыЭлемента Из НормализованныеПараметры Цикл
		Если ПараметрыЭлемента.РеквизитHTML = Неопределено Тогда
			ПараметрыЭлемента.РеквизитHTML = "рк_HTML" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
			НовыеРеквизиты.Добавить(Новый РеквизитФормы(ПараметрыЭлемента.РеквизитHTML, Новый ОписаниеТипов("Строка")));
		КонецЕсли;
	КонецЦикла;
	
	Если НовыеРеквизиты.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(НовыеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьРедакторы(Форма, НормализованныеПараметры)
	
	ИспользоватьРедактор = рк_РедакторКодаКлиентСервер.ОбщиеПараметры(Форма).ИспользоватьРедактор;
	
	КонфигурацииРедакторов = Новый Массив;
	
	Для Каждого ПараметрыЭлемента Из НормализованныеПараметры Цикл
		
		Если ПараметрыЭлемента.ЭлементHTML = Неопределено Тогда
			Если ПараметрыЭлемента.ЭлементТекст = Неопределено Тогда
				Продолжить; // Не передан заменяемый элемент Текст
			КонецЕсли;
			// Добавление нового элемента HTML редактора кода для замены элемента Текст
			Если ПараметрыЭлемента.ЭлементСтраница = Неопределено Тогда
				// Добавление элемента HTML в группу элемента Текст
				ЭлементРедактора = Форма.Элементы.Вставить(ПараметрыЭлемента.РеквизитHTML, Тип("ПолеФормы"), ПараметрыЭлемента.ЭлементТекст.Родитель, ПараметрыЭлемента.ЭлементТекст);
			Иначе
				// Добавление элемента HTML на указанную страницу
				ЭлементРедактора = Форма.Элементы.Добавить(ПараметрыЭлемента.РеквизитHTML, Тип("ПолеФормы"), ПараметрыЭлемента.ЭлементСтраница);
			КонецЕсли;
			ЭлементРедактора.Вид = ВидПоляФормы.ПолеHTMLДокумента;
			ЭлементРедактора.ПутьКДанным = ПараметрыЭлемента.РеквизитHTML;
			ЭлементРедактора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ЭлементРедактора.Видимость = Ложь;
			ЭлементРедактора.УстановитьДействие("ДокументСформирован", "Подключаемый_рк_ДокументСформирован");
			ЭлементРедактора.УстановитьДействие("ПриНажатии", "Подключаемый_рк_ПриНажатии");
			ЭлементРедактора.ТолькоПросмотр = ПараметрыЭлемента.ЭлементТекст.ТолькоПросмотр;
			
			ПараметрыЭлемента.ЭлементHTML = ЭлементРедактора;
		КонецЕсли;
		
		ПараметрыРедактора = рк_РедакторКодаКлиентСервер.ПараметрыРедактора(Форма, ПараметрыЭлемента.ЭлементHTML);
		ПараметрыРедактора.РеквизитHTML = ПараметрыЭлемента.РеквизитHTML;
		
		Если НЕ ПустаяСтрока(ПараметрыЭлемента.РеквизитТекст) Тогда
			ПараметрыРедактора.Вставить("РеквизитТекст", ПараметрыЭлемента.РеквизитТекст);
			ПараметрыРедактора.Вставить("ИмяЭлементаТекст", ПараметрыЭлемента.ЭлементТекст.Имя);
		КонецЕсли;
		
		Если ПараметрыЭлемента.ЭлементСтраница <> Неопределено Тогда
			// Веб-страница редактора будет установлена при обработке события ОбработчикПриСменеСтраницы, когда ТекущаяСтраница равна указанной
			ПараметрыРедактора.Вставить("ИмяЭлементаСтраница", рк_РедакторКодаКлиентСервер.НормализоватьИмяЭлемента(ПараметрыЭлемента.ЭлементСтраница));
		КонецЕсли;
		
		Если ПараметрыЭлемента.РежимЯзыка <> "bsl" Тогда
			ПараметрыРедактора.Вставить("РежимЯзыка", ПараметрыЭлемента.РежимЯзыка);
		КонецЕсли;
		
		ПараметрыРедактора.Конфигурация = ПараметрыЭлемента.Конфигурация;
		
		Если ПараметрыЭлемента.Параметры.Количество() > 0 Тогда
			// Произвольные внешние параметры добавляются в параметры редактора
			Для Каждого КлючИЗначение Из ПараметрыЭлемента.Параметры Цикл
				ПараметрыРедактора.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЦикла;
		КонецЕсли;
		
		Если ИспользоватьРедактор Тогда
			// Переключение на элемент редактора HTML
			Если ПараметрыЭлемента.ЭлементТекст <> Неопределено Тогда
				ПараметрыЭлемента.ЭлементТекст.Видимость = Ложь;
			КонецЕсли;
			ПараметрыЭлемента.ЭлементHTML.Видимость = Истина;
		КонецЕсли;
		
		// Постоянные настройки, которые заменяют общие при обновлении настроек
		Если ПараметрыЭлемента.Настройки.Количество() > 0 Тогда
			ПараметрыРедактора.Вставить("АдресНастройки", ПоместитьВоВременноеХранилище(ПараметрыЭлемента.Настройки, Форма.УникальныйИдентификатор));
		КонецЕсли;
		
		Если КонфигурацииРедакторов.Найти(ПараметрыРедактора.Конфигурация) = Неопределено Тогда
			КонфигурацииРедакторов.Добавить(ПараметрыРедактора.Конфигурация);
		КонецЕсли;
		
		Если ПараметрыЭлемента.Контекст.Количество() > 0 Тогда
			РезультатыЗапроса = Новый Соответствие;
			РезультатыЗапроса.Вставить("#locals", Новый Структура("Тип,Данные", "Контекст", ДанныеВJSON(ПараметрыЭлемента.Контекст)));
			ПараметрыРедактора.Вставить("АдресКонтекст", ПоместитьВоВременноеХранилище(РезультатыЗапроса, Форма.УникальныйИдентификатор));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КонфигурацииРедакторов;
	
КонецФункции

Процедура СохранитьНастройкиКонфигураций(Форма, КонфигурацииРедакторов, НастройкиКонфигураций)
	
	ОбщиеПараметры = рк_РедакторКодаКлиентСервер.ОбщиеПараметры(Форма);
	
	Если НастройкиКонфигураций = Неопределено Тогда
		НастройкиКонфигураций = Новый Соответствие;
		НастройкиКонфигураций[Неопределено] = НастройкиКонфигурации(); // Настройки текущей конфигурации
	КонецЕсли;
	
	Для Каждого Конфигурация Из КонфигурацииРедакторов Цикл
		НастройкиКонфигурации = НастройкиКонфигураций[Конфигурация];
		ОбщиеПараметры.НастройкиКонфигурации[Конфигурация] = ПоместитьВоВременноеХранилище(НастройкиКонфигурации, Форма.УникальныйИдентификатор);
		Если НастройкиКонфигурации.ВнешниеМетаданные Тогда
			ОбщиеПараметры.ОбщиеРеквизиты[Конфигурация] = ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьВебСтраницыРедакторов(Форма, ОбщиеПараметры)
	
	ВсеРедактора = рк_РедакторКодаКлиентСервер.ПараметрыВсехРедакторов(Форма);
	
	ЕстьУстановкаВебСтраницы = Ложь;
	Для Каждого ЭлементСписка Из ВсеРедактора Цикл
		ПараметрыРедактора = ЭлементСписка.Значение;
		Если НЕ ПараметрыРедактора.Свойство("ИмяЭлементаСтраница") Тогда
			ЕстьУстановкаВебСтраницы = Истина; // Для редактора не указана его элемент-страница - веб-страница устанавливается сразу
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьУстановкаВебСтраницы Тогда
		Возврат; // Получение файлов редактора будет выполняться на клиенте при первом переключении на редактор
	КонецЕсли;
	
	ФайлыРедактора = ПодготовитьФайлыРедактора(Форма.УникальныйИдентификатор);
	Если ФайлыРедактора = Неопределено Тогда
		Возврат; // не удалось подготовить файлы редактора
	КонецЕсли;
	ОбщиеПараметры.Вставить("АдресФайлыРедактора", ПоместитьВоВременноеХранилище(ФайлыРедактора, Форма.УникальныйИдентификатор));
	
	ТекстHTML = ФайлыРедактора["index.html"];
	
	Для Каждого ЭлементСписка Из ВсеРедактора Цикл
		ПараметрыРедактора = ЭлементСписка.Значение;
		Если НЕ ПараметрыРедактора.Свойство("ИмяЭлементаСтраница") Тогда
			Форма[ПараметрыРедактора.РеквизитHTML] = ТекстHTML;
			ПараметрыРедактора.Удалить("РеквизитHTML"); // Имя реквизита больше не нужно
			ПараметрыРедактора.Удалить("ФлагНетВебСтраницы");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаданиеИнициализироватьГлобальныйКонтекст(НастройкиКонфигурации) Экспорт
	
	ПараметрыЗапроса = Новый Массив;
	ПараметрыЗапроса.Добавить("#globals");
	
	РезультатыЗапроса = Новый Соответствие;
	ОбработатьЗапросМетаданных(РезультатыЗапроса, ПараметрыЗапроса, НастройкиКонфигурации);
	
	Возврат РезультатыЗапроса;
	
КонецФункции

#КонецОбласти

#Область ОбщиеМетаданные

Процедура ОбработатьЗапросМетаданных(РезультатыЗапроса, ПараметрыЗапроса, НастройкиКонфигурации) Экспорт
	
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		
		РезультатЗапроса = Неопределено;
		
		Если ПараметрЗапроса = "#globals" ИЛИ ПараметрЗапроса = "общиемодули" Тогда
			
			Если РезультатыЗапроса["#globals"] <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			КоллекцияГлобальныеМодули = Новый Массив;
			
			РезультатЗапроса = КоллекцияОбъектовМетаданных("общиемодули", НастройкиКонфигурации, КоллекцияГлобальныеМодули);
			РезультатыЗапроса.Вставить("общиемодули", РезультатЗапроса);
			
			РезультатЗапроса = ТекстыОбщегоМодуля(КоллекцияГлобальныеМодули, НастройкиКонфигурации);
			РезультатыЗапроса.Вставить("#globals", РезультатЗапроса);
			
		Иначе
			ЧастиЗапроса = СтрРазделить(ПараметрЗапроса, ".");
			Если НРег(ЧастиЗапроса[0]) = "module" Тогда
				
				Если ЧастиЗапроса.Количество() = 4 Тогда
					// Текст модуля объекта или модуля менеджера (например "module.manager.справочники.номенклатура." или "module.object.справочники.номенклатура."
					РезультатЗапроса = ТекстыМодуляОбъекта(ЧастиЗапроса[2], ЧастиЗапроса[3], НРег(ЧастиЗапроса[1]), НастройкиКонфигурации);
				Иначе
					// Текст общего модуля (например, "общегоназначения"
					РезультатЗапроса = ТекстыОбщегоМодуля(ЧастиЗапроса[1], НастройкиКонфигурации);
				КонецЕсли;
				
			ИначеЕсли ЧастиЗапроса.Количество() = 1 Тогда
				
				// Запрос содержимого коллекции метаданных (например, "справочники")
				РезультатЗапроса = КоллекцияОбъектовМетаданных(ПараметрЗапроса, НастройкиКонфигурации);
				
			ИначеЕсли ЧастиЗапроса.Количество() = 2 Тогда
				
				// Запрос конкретного объекта метаданных (например, "справочники.номенклатура")
				РезультатЗапроса = ОписаниеОбъектаМетаданных(ЧастиЗапроса[0], ЧастиЗапроса[1], НастройкиКонфигурации);
				
			КонецЕсли;
			
			Если РезультатЗапроса <> Неопределено Тогда
				РезультатыЗапроса.Вставить(ПараметрЗапроса, РезультатЗапроса);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОбработатьМодули(ТекстыМодуля, ОбработчикМодулей) Экспорт
	
	Результат = Новый СписокЗначений;
	
	ДанныеМодуля = Новый Структура;
	ДанныеМодуля.Вставить("module", Новый Структура);
	ДанныеМодуля.Вставить("count", 0);
	
	Для Каждого ЭлементСписка Из ТекстыМодуля Цикл
		Если ОбработчикМодулей = "RegExp" Тогда
			рк_ОбработчикМодулейRegExp.ЗаполнитьМетодыМодуля(ДанныеМодуля, ЭлементСписка.Значение, ЭлементСписка.Пометка);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Добавить(ДанныеВJSON(ДанныеМодуля));
	
	Возврат Результат;
	
КонецФункции

// Получает список объектов определённой коллекции метаданных в формате консоли кода
//
Функция КоллекцияОбъектовМетаданных(ИмяКоллекции, НастройкиКонфигурации, ГлобальныеМодули = Неопределено)
	
	Перем Маппинг;
	
	ИмяКоллекцииРедактора = МаппингConsole(ИмяКоллекции, Маппинг);
	Если ИмяКоллекцииРедактора = Неопределено Тогда
		Возврат Неопределено; // Объект не поддерживается в консоли
	КонецЕсли;
	
	СписокОбъектов = Новый Структура;
	ЭтоОбщиеМодули = ГлобальныеМодули <> Неопределено;
	
	Если НастройкиКонфигурации.ВнешниеМетаданные Тогда
		Коллекция = Новый СписокЗначений;
		
		ИмяКаталогаКоллекции = МаппингМнEng(ИмяКоллекции, Маппинг);
		
		Если НастройкиКонфигурации.ЭтоИсходникиEDT Тогда
			ИмяКаталогаКоллекции = "src" + ПолучитьРазделительПути() + ИмяКаталогаКоллекции;
		КонецЕсли;
		
		ПрочитатьОбъектыКоллекцииXML(Коллекция, НастройкиКонфигурации.ПутьКИсходникамКонфигурации + ИмяКаталогаКоллекции, ЭтоОбщиеМодули, НастройкиКонфигурации.ЭтоИсходникиEDT);
		
		Для Каждого ПутьКИсходникамРасширения Из НастройкиКонфигурации.ПутьКИсходникамРасширений Цикл
			ПрочитатьОбъектыКоллекцииXML(Коллекция, ПутьКИсходникамРасширения + ИмяКаталогаКоллекции, ЭтоОбщиеМодули, НастройкиКонфигурации.ЭтоИсходникиEDT);
		КонецЦикла;
		
		Для Каждого ЭлементСписка Из Коллекция Цикл
			// Пометка ЭлементСписка - признак глобального модуля
			Если ЭтоОбщиеМодули И ЭлементСписка.Пометка Тогда
				ГлобальныеМодули.Добавить(ЭлементСписка.Значение);
			Иначе
				СписокОбъектов.Вставить(ЭлементСписка.Значение, Новый Структура);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Попытка
			Для Каждого ОбъектМД Из Метаданные[ИмяКоллекции] Цикл
				Если ЭтоОбщиеМодули И ОбъектМД.Глобальный Тогда
					ГлобальныеМодули.Добавить(ОбъектМД.Имя);
				Иначе
					СписокОбъектов.Вставить(ОбъектМД.Имя, Новый Структура);
				КонецЕсли;
			КонецЦикла;
		Исключение
			Инфо = ИнформацияОбОшибке();
		КонецПопытки;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Тип", "Метаданные");
	Результат.Вставить("Адрес", СтрШаблон("%1.items", ИмяКоллекцииРедактора));
	Результат.Вставить("Данные", ДанныеВJSON(СписокОбъектов));
	
	Возврат Результат;
	
КонецФункции

// Получает описание конкретного объекта метаданных в формате консоли кода
//
Функция ОписаниеОбъектаМетаданных(ИмяКоллекции, ИмяОбъекта, НастройкиКонфигурации)
	
	Если НастройкиКонфигурации.ВнешниеМетаданные Тогда
		ОписаниеОбъекта = ОписаниеОбъектаМетаданныхXML(ИмяКоллекции, ИмяОбъекта, НастройкиКонфигурации);
	Иначе
		ОписаниеОбъекта = ОписаниеОбъектаМетаданныхИБ(ИмяКоллекции, ИмяОбъекта);
	КонецЕсли;
	
	Если ОписаниеОбъекта = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Тип", "Метаданные");
	Результат.Вставить("Адрес", СтрШаблон("%1.items.%2", ОписаниеОбъекта.ИмяКоллекцииРедактора, ОписаниеОбъекта.ИмяОбъектаМетаданных));
	Результат.Вставить("Данные", ДанныеВJSON(ОписаниеОбъекта.Данные));
	
	Возврат Результат;
	
КонецФункции

// Читает текст общего модуля из файла исходников.
// 
// Параметры:
//   НастройкиКонфигурации - Структура
//   ИмяМодуля - Строка - имя модуля
//
// Возвращаемое значение:
//   Структура, Неопределено - данные модуля
//
Функция ТекстыОбщегоМодуля(ИмяМодуляИлиМассив, НастройкиКонфигурации)
	
	Если ПустаяСтрока(НастройкиКонфигурации.ПутьКИсходникамКонфигурации) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Данные", Новый СписокЗначений);
	Результат.Вставить("Тип", "Модуль");
	Результат.Вставить("Обработан", Ложь);
	
	Если ТипЗнч(ИмяМодуляИлиМассив) = Тип("Массив") Тогда
		ИменаМодулей = ИмяМодуляИлиМассив;
		Глобальный = Истина;
		
		Результат.Вставить("Адрес", "globalfunctions");
	Иначе
		ИменаМодулей = Новый Массив;
		ИменаМодулей.Добавить(ИмяМодуляИлиМассив);
		Глобальный = Ложь;
		
		Результат.Вставить("Адрес", СтрШаблон("commonModules.items.%1", НРег(ИмяМодуляИлиМассив)));
	КонецЕсли;
	
	РазделительПути = ПолучитьРазделительПути();
	
	Для Каждого ИмяМодуля Из ИменаМодулей Цикл
		
		Если НастройкиКонфигурации.ЭтоИсходникиEDT Тогда
			ИмяФайлаБезКаталога = СтрШаблон("src%1CommonModules%1%2%1Module.bsl", РазделительПути, ИмяМодуля);
		Иначе
			ИмяФайлаБезКаталога = СтрШаблон("CommonModules%1%2%1Ext%1Module.bsl", РазделительПути, ИмяМодуля);
		КонецЕсли;
		
		ПрочитатьТекстыМодуля(Результат.Данные, ИмяФайлаБезКаталога, Глобальный, НастройкиКонфигурации);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НастройкиКонфигурации.ОбработчикМодулей) Тогда
		Результат.Данные = ОбработатьМодули(Результат.Данные, НастройкиКонфигурации.ОбработчикМодулей);
		Результат.Обработан = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Читает текст модуля объекта (менеджера или объекта) из файла исходников.
// 
// Параметры:
//   КаталогИсходногоКода - Строка - путь к каталогу с исходниками
//   ТипМодуля - Строка - "manager" или "object"
//   КоллекцияМетаданных - Строка - имя коллекции
//   ИмяОбъекта - Строка - имя объекта метаданных
//
// Возвращаемое значение:
//   Структура, Неопределено - данные модуля
//
Функция ТекстыМодуляОбъекта(ИмяКоллекции, ИмяОбъекта, ТипМодуля, НастройкиКонфигурации)
	
	Перем Маппинг;
	
	Если ПустаяСтрока(НастройкиКонфигурации.ПутьКИсходникамКонфигурации) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// TODO сделать в bsl_console поиск модулей по имени в нижнем регистре как и для других объектов чтобы не читать файл с описанием модуля
	
	ИмяОбъектаМетаданных = Неопределено;
	
	// Получение имени объекта как в метаданных, так как в редакторе сведения хранятся для этого имени
	Если НастройкиКонфигурации.ВнешниеМетаданные Тогда
		РазделительПути = ПолучитьРазделительПути();
		
		ИмяКаталогаМодуля = МаппингМнEng(ИмяКоллекции, Маппинг);
		
		Если НастройкиКонфигурации.ЭтоИсходникиEDT Тогда
			ИмяФайлаБезКаталога = СтрШаблон("src%1%2%1%3%1%3.mdo", РазделительПути, ИмяКаталогаМодуля, ИмяОбъекта);
		Иначе
			ИмяФайлаБезКаталога = СтрШаблон("%2%1%3.xml", РазделительПути, ИмяКаталогаМодуля, ИмяОбъекта);
		КонецЕсли;
		
		ОписаниеОбъекта = Новый Структура("Name");
		Попытка
			ПрочитатьКраткиеСведенияОбъектаXML(НастройкиКонфигурации.ПутьКИсходникамКонфигурации + ИмяФайлаБезКаталога, ОписаниеОбъекта, НастройкиКонфигурации.ЭтоИсходникиEDT);
		Исключение
			Инфо = ИнформацияОбОшибке();
		КонецПопытки;
		Если ОписаниеОбъекта.Name = Неопределено Тогда
			// Поиск объекта метаданных среди расширений
			Для Каждого ПутьКИсходникамРасширения Из НастройкиКонфигурации.ПутьКИсходникамРасширений Цикл
				Попытка
					ПрочитатьКраткиеСведенияОбъектаXML(ПутьКИсходникамРасширения + ИмяФайлаБезКаталога, ОписаниеОбъекта, НастройкиКонфигурации.ЭтоИсходникиEDT);
				Исключение
				КонецПопытки;
				Если ОписаниеОбъекта.Name <> Неопределено Тогда
					Прервать; // Найден объект метаданных
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ОписаниеОбъекта.Name = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		ИмяОбъектаМетаданных = ОписаниеОбъекта.Name;
	Иначе
		Попытка
			ИмяОбъектаМетаданных = Метаданные[ИмяКоллекции][ИмяОбъекта].Имя;
		Исключение
			Инфо = ИнформацияОбОшибке();
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	// Получение текстов модуля (из конфигурации и расширений)
	РазделительПути = ПолучитьРазделительПути();
	
	ИмяФайлаМодуля = ?(НРег(ТипМодуля) = "manager", "ManagerModule", "ObjectModule");
	ИмяКаталогаМодуля = МаппингМнEng(ИмяКоллекции, Маппинг);
	ИмяКоллекцииРедактора = МаппингConsole(ИмяКоллекции, Маппинг);
	
	Если НастройкиКонфигурации.ЭтоИсходникиEDT Тогда
		ИмяФайлаБезКаталога = СтрШаблон("src%1%2%1%3%1%4.bsl", РазделительПути, ИмяКаталогаМодуля, ИмяОбъекта, ИмяФайлаМодуля);
	Иначе
		ИмяФайлаБезКаталога = СтрШаблон("%2%1%3%1Ext%1%4.bsl", РазделительПути, ИмяКаталогаМодуля, ИмяОбъекта, ИмяФайлаМодуля);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Данные", Новый СписокЗначений);
	Результат.Вставить("Тип", "Модуль");
	Результат.Вставить("Обработан", Ложь);
	Результат.Вставить("Адрес", СтрШаблон("%1.items.%2.%3", ИмяКоллекцииРедактора, ИмяОбъектаМетаданных, НРег(ТипМодуля)));
	
	ПрочитатьТекстыМодуля(Результат.Данные, ИмяФайлаБезКаталога, Ложь, НастройкиКонфигурации);
	
	Если ЗначениеЗаполнено(НастройкиКонфигурации.ОбработчикМодулей) Тогда
		Результат.Данные = ОбработатьМодули(Результат.Данные, НастройкиКонфигурации.ОбработчикМодулей);
		Результат.Обработан = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МаппингИменМетаданных(Маппинг)
	
	Если Маппинг <> Неопределено Тогда
		Возврат Маппинг;
	КонецЕсли;
	
	Маппинг = рк_РедакторКодаПовтИсп.МаппингИменМетаданных();
	
	Возврат Маппинг;
	
КонецФункции

Функция МаппингМнRus(ИмяМнRus, Маппинг)
	Возврат МаппингИменМетаданных(Маппинг).МнRus[НРег(ИмяМнRus)];
КонецФункции

Функция МаппингЕдEng(ИмяМнRus, Маппинг)
	Возврат МаппингИменМетаданных(Маппинг).ЕдEng[НРег(ИмяМнRus)];
КонецФункции

Функция МаппингМнEng(ИмяМнRus, Маппинг)
	Возврат МаппингИменМетаданных(Маппинг).МнEng[НРег(ИмяМнRus)];
КонецФункции

Функция МаппингConsole(ИмяМнRus, Маппинг)
	Возврат МаппингИменМетаданных(Маппинг).console[НРег(ИмяМнRus)];
КонецФункции

Функция ЕстьПредопределенные(ИмяМнRus, Маппинг)
	Возврат МаппингИменМетаданных(Маппинг).ЕстьПредопределенные[НРег(ИмяМнRus)] = Истина;
КонецФункции

Функция ЕстьОбщиеРеквизиты(ИмяМнRus, Маппинг)
	Возврат МаппингИменМетаданных(Маппинг).ЕстьОбщиеРеквизиты[НРег(ИмяМнRus)] = Истина;
КонецФункции

Функция ЕстьТЧ(ИмяМнRus, Маппинг)
	Возврат МаппингИменМетаданных(Маппинг).ЕстьТЧ[НРег(ИмяМнRus)] = Истина;
КонецФункции

Процедура ПрочитатьТекстыМодуля(ТекстыМодуля, ИмяФайлаБезКаталога, БезРасширений, НастройкиКонфигурации)
	
	ТекстМодуля = ПрочитатьТекстФайла(НастройкиКонфигурации.ПутьКИсходникамКонфигурации + ИмяФайлаБезКаталога);
	Если ТекстМодуля <> Неопределено Тогда
		ТекстыМодуля.Добавить(ТекстМодуля);
	КонецЕсли;
	
	Если БезРасширений Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПутьКИсходникамРасширения Из НастройкиКонфигурации.ПутьКИсходникамРасширений Цикл
		
		ТекстМодуля = ПрочитатьТекстФайла(ПутьКИсходникамРасширения + ИмяФайлаБезКаталога);
		Если ТекстМодуля <> Неопределено Тогда
			ТекстыМодуля.Добавить(ТекстМодуля);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПрочитатьТекстФайла(ПутьКФайлу)
	
	Попытка
		Текст = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8,,, Ложь);
		Возврат Текст.Прочитать();
	Исключение
		инфо = ИнформацияОбОшибке();
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область МетаданныеИБ

Функция ОписаниеОбъектаМетаданныхИБ(ИмяКоллекции, ИмяОбъекта)
	
	Перем Маппинг;
	
	ИмяКоллекцииРедактора = МаппингConsole(ИмяКоллекции, Маппинг);
	
	Если НЕ ЗначениеЗаполнено(ИмяКоллекцииРедактора) Тогда
		Возврат Неопределено; // Объект не поддерживается в консоли
	КонецЕсли;
	
	Попытка
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(СтрШаблон("%1.%2", ИмяКоллекции, ИмяОбъекта));
	Исключение
		ОбъектМетаданных = Неопределено;
	КонецПопытки;
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Данные", Новый Структура);
	Результат.Вставить("ИмяКоллекцииРедактора", ИмяКоллекцииРедактора);
	Результат.Вставить("ИмяОбъектаМетаданных", ОбъектМетаданных.Имя);
	
	КорневойТип = СтрРазделить(ОбъектМетаданных.ПолноеИмя(), ".")[0];
	
	ОписанияТипов = Новый Структура;
	ОписанияТипов.Вставить("Типы", Новый Соответствие);
	ОписанияТипов.Вставить("Маппинг", Маппинг);
	ОписанияТипов.Вставить("ИмяКоллекцииМетаданных",  МаппингМнRus(КорневойТип, Маппинг));
	
	ОписаниеРеквизитов = Новый Структура;
	ОписаниеРесурсов = Новый Структура;
	ОписаниеПредопределенных = Новый Структура;
	ОписаниеТабличныхЧастей = Новый Структура;
	СлужебныеДанные = Новый Структура;
	
	// Проверяем тип метаданных - для перечислений особая обработка
	Если ИмяКоллекции = "Перечисления" Тогда
		Для Каждого Реквизит Из ОбъектМетаданных.ЗначенияПеречисления Цикл
			ОписаниеРеквизитов.Вставить(Реквизит.Имя, Новый Структура("name", Реквизит.Синоним));
		КонецЦикла;
	Иначе
		Попытка
			Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
				ДобавитьРеквизитИБ(ОписаниеРеквизитов, Реквизит, ОписанияТипов);
			КонецЦикла;
		Исключение
			// Нет стандартных реквизитов
		КонецПопытки;
		
		Попытка
			Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
				ДобавитьРеквизитИБ(ОписаниеРеквизитов, Реквизит, ОписанияТипов);
			КонецЦикла;
		Исключение
			// Нет реквизитов
		КонецПопытки;
		
		Если ЕстьОбщиеРеквизиты(ИмяКоллекции, Маппинг) Тогда
			
			АвтоИспользованиеОбщегоРеквизита = Метаданные.СвойстваОбъектов.АвтоИспользованиеОбщегоРеквизита.Использовать;
			НеИспользоватьОбщийРеквизит = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.НеИспользовать;
			
			Для Каждого Реквизит Из Метаданные.ОбщиеРеквизиты Цикл
				Автоиспользование = (Реквизит.АвтоИспользование = АвтоИспользованиеОбщегоРеквизита);
				ЭлементСостава = Реквизит.Состав.Найти(ОбъектМетаданных);
				ИспользованиеОбъекта = ?(ЭлементСостава = Неопределено, Неопределено, ЭлементСостава.Использование);
				
				Если (АвтоИспользование И ИспользованиеОбъекта <> НеИспользоватьОбщийРеквизит)
				 ИЛИ (НЕ АвтоИспользование И ИспользованиеОбъекта <> Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать) Тогда
					ДобавитьРеквизитИБ(ОписаниеРеквизитов, Реквизит, ОписанияТипов);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если ИмяКоллекции = "РегистрыСведений"
		 ИЛИ ИмяКоллекции = "РегистрыНакопления"
		 ИЛИ ИмяКоллекции = "РегистрыБухгалтерии"
		 ИЛИ ИмяКоллекции = "РегистрыРасчета" Тогда
			ЗаполнитьИзмеренияРесурсыИБ(ОбъектМетаданных, ОписаниеРеквизитов, ОписаниеРесурсов, СлужебныеДанные, ОписанияТипов);
		КонецЕсли;
		
		Если ЕстьТЧ(ИмяКоллекции, Маппинг) Тогда
			ЗаполнитьТабличныеЧастиИБ(ОбъектМетаданных, ОписаниеРеквизитов, ОписаниеТабличныхЧастей, ОписанияТипов);
		КонецЕсли;
		
		Если ЕстьПредопределенные(ИмяКоллекции, Маппинг) Тогда
			Для Каждого Имя Из ОбъектМетаданных.ПолучитьИменаПредопределенных() Цикл
				ОписаниеПредопределенных.Вставить(Имя, "");
			КонецЦикла;
		КонецЕсли;
	
	КонецЕсли;
	
	Результат.Данные.Вставить("properties", ОписаниеРеквизитов);
	
	Для Каждого КлючИЗначение Из СлужебныеДанные Цикл
		Результат.Данные.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Если ОписаниеРесурсов.Количество() > 0 Тогда
		Результат.Данные.Вставить("resources", ОписаниеРесурсов);
	КонецЕсли;
	
	Если ОписаниеПредопределенных.Количество() > 0 Тогда
		Результат.Данные.Вставить("predefined", ОписаниеПредопределенных);
	КонецЕсли;
	
	Если ОписаниеТабличныхЧастей.Количество() > 0 Тогда
		Результат.Данные.Вставить("tabulars", ОписаниеТабличныхЧастей);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавляет описание реквизита в структуру.
Процедура ДобавитьРеквизитИБ(ОписаниеРеквизитов, Реквизит, ОписанияТипов)
	
	МассивТипов = Новый Массив;
	
	Для Каждого ТипСвойства Из Реквизит.Тип.Типы() Цикл
		
		ОбработанныйТип = ОписанияТипов.Типы[ТипСвойства];
		Если ОбработанныйТип <> Неопределено Тогда
			МассивТипов.Добавить(ОбработанныйТип);
			Продолжить;
		КонецЕсли;
		
		ОбъектМД = Метаданные.НайтиПоТипу(ТипСвойства);
		Если ОбъектМД = Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		КорневойТип = СтрРазделить(ОбъектМД.ПолноеИмя(), ".")[0];
		ИмяДляРедактораEд = МаппингConsole(КорневойТип, ОписанияТипов.Маппинг);
		Если ИмяДляРедактораEд = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОбработанныйТип = ИмяДляРедактораEд + "." + ОбъектМД.Имя;
		МассивТипов.Добавить(ОбработанныйТип);
		ОписанияТипов.Типы[ТипСвойства] = ОбработанныйТип;
		
	КонецЦикла;
	
	ОписаниеРеквизита = Новый Структура("name", Реквизит.Синоним);
	
	Если МассивТипов.Количество() > 0 Тогда
		ОписаниеРеквизита.Вставить("ref", СтрСоединить(МассивТипов, ","));
	КонецЕсли;
	
	ОписаниеРеквизитов.Вставить(Реквизит.Имя, ОписаниеРеквизита);
	
КонецПроцедуры

Процедура ЗаполнитьИзмеренияРесурсыИБ(ОбъектМД, ОписаниеРеквизитов, ОписаниеРесурсов, СлужебныеДанные, ОписанияТипов)
	
	Для Каждого Реквизит Из ОбъектМД.Измерения Цикл
		ДобавитьРеквизитИБ(ОписаниеРеквизитов, Реквизит, ОписанияТипов);
	КонецЦикла;
	
	Для Каждого Реквизит Из ОбъектМД.Ресурсы Цикл
		ДобавитьРеквизитИБ(ОписаниеРесурсов, Реквизит, ОписанияТипов);
	КонецЦикла;
	
	Если ОписанияТипов.ИмяКоллекцииМетаданных = "РегистрыСведений" Тогда
		
		Если ОбъектМД.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
			ТипРегистра = "nonperiodical";
		Иначе
			ТипРегистра = "periodical";
		КонецЕсли;
		СлужебныеДанные.Вставить("type", ТипРегистра);
		
	ИначеЕсли ОписанияТипов.ИмяКоллекцииМетаданных = "РегистрыНакопления" Тогда
		
		Если ОбъектМД.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
			ТипРегистра = "balance";
		Иначе
			ТипРегистра = "turnovers";
		КонецЕсли;
		СлужебныеДанные.Вставить("type", ТипРегистра);
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет описание табличных частей.
Процедура ЗаполнитьТабличныеЧастиИБ(ОбъектМД, ОписаниеРеквизитов, ОписаниеТабличныхЧастей, ОписанияТипов)
	
	Для Каждого ТабличнаяЧасть Из ОбъектМД.ТабличныеЧасти Цикл
		
		ОписаниеРеквизитов.Вставить(ТабличнаяЧасть.Имя, Новый Структура("name", "ТЧ: " + ТабличнаяЧасть.Синоним));
		
		ОписаниеТабличнойЧасти = Новый Структура;
		
		Для Каждого РеквизитТЧ Из ТабличнаяЧасть.СтандартныеРеквизиты Цикл
			ОписаниеТабличнойЧасти.Вставить(РеквизитТЧ.Имя, РеквизитТЧ.Синоним);
		КонецЦикла;
		
		Для Каждого РеквизитТЧ Из ТабличнаяЧасть.Реквизиты Цикл
			ДобавитьРеквизитИБ(ОписаниеТабличнойЧасти, РеквизитТЧ, ОписанияТипов);
		КонецЦикла;
		
		СтруктураТабличнойЧасти = Новый Структура;
		СтруктураТабличнойЧасти.Вставить("properties", ОписаниеТабличнойЧасти);
		
		Если ОписаниеТабличнойЧасти.Количество() > 0 Тогда
			ОписаниеТабличныхЧастей.Вставить(ТабличнаяЧасть.Имя, СтруктураТабличнойЧасти);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВнешниеМетаданные

#Если НЕ ВебКлиент Тогда

Функция ОписаниеОбъектаМетаданныхXML(ИмяКоллекции, ИмяОбъекта, НастройкиКонфигурации)
	
	Перем Маппинг;
	
	ИмяКоллекцииРедактора = МаппингConsole(ИмяКоллекции, Маппинг);
	
	Если НЕ ЗначениеЗаполнено(ИмяКоллекцииРедактора) Тогда
		Возврат Неопределено; // Объект не поддерживается в консоли
	КонецЕсли;
	
	РазделительПути = ПолучитьРазделительПути();
	
	ИмяКаталогаКоллекции = МаппингМнEng(ИмяКоллекции, Маппинг);
	
	Если НастройкиКонфигурации.ЭтоИсходникиEDT Тогда
		ИмяФайлаБезКаталога = СтрШаблон("src%1%2%1%3%1%3.mdo", РазделительПути, ИмяКаталогаКоллекции, ИмяОбъекта);
		ИмяФайлаПредопределенныхБезКаталога = Неопределено;
	Иначе
		ИмяФайлаБезКаталога = СтрШаблон("%2%1%3.xml", РазделительПути, ИмяКаталогаКоллекции, ИмяОбъекта);
		Если ЕстьПредопределенные(ИмяКоллекции, Маппинг) Тогда
			ИмяФайлаПредопределенныхБезКаталога = СтрШаблон("%2%1%3%1Ext%1Predefined.xml", РазделительПути, ИмяКаталогаКоллекции, ИмяОбъекта);
		Иначе
			ИмяФайлаПредопределенныхБезКаталога = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Данные", Новый Структура);
	Результат.Вставить("ИмяКоллекцииРедактора", ИмяКоллекцииРедактора);
	Результат.Вставить("ИмяОбъектаМетаданных");
	
	ОписанияТипов = Новый Структура;
	ОписанияТипов.Вставить("Маппинг", Маппинг);
	ОписанияТипов.Вставить("Типы", Новый Соответствие);
	ОписанияТипов.Вставить("ИмяКоллекцииМетаданных", МаппингМнRus(ИмяКоллекции, Маппинг));
	
	Попытка
		ПрочитатьСведенияОбъектаXML(НастройкиКонфигурации.ПутьКИсходникамКонфигурации + ИмяФайлаБезКаталога, Результат, НастройкиКонфигурации.ЭтоИсходникиEDT, ОписанияТипов);
		
		Если ИмяФайлаПредопределенныхБезКаталога <> Неопределено Тогда
			ПрочитатьОписаниеПредопределенныхXML(НастройкиКонфигурации.ПутьКИсходникамКонфигурации + ИмяФайлаПредопределенныхБезКаталога, Результат, ИмяКоллекции, Маппинг);
		КонецЕсли;
		
		Если ЕстьОбщиеРеквизиты(ИмяКоллекции, Маппинг) Тогда
			Если ТипЗнч(НастройкиКонфигурации.ОбщиеРеквизиты) = Тип("Строка") Тогда
				// Общие реквизиты еще не получались из хранилища
				ОбщиеРеквизиты = ПолучитьИзВременногоХранилища(НастройкиКонфигурации.ОбщиеРеквизиты);
				Если ОбщиеРеквизиты = Неопределено Тогда
					// Общие реквизиты еще не получались из метаданных
					ОбщиеРеквизиты = ПрочитатьОписанияВсехОбщихРеквизитовXML(НастройкиКонфигурации);
					ПоместитьВоВременноеХранилище(ОбщиеРеквизиты, НастройкиКонфигурации.ОбщиеРеквизиты);
					НастройкиКонфигурации.ОбщиеРеквизиты = ОбщиеРеквизиты;
				КонецЕсли;
			КонецЕсли;
			ЗаполнитьОбщиеРеквизитыXML(НастройкиКонфигурации.ОбщиеРеквизиты, Результат, ОписанияТипов);
		КонецЕсли;
	Исключение
		Инфо = ИнформацияОбОшибке();
	КонецПопытки;
	
	Для Каждого ПутьКИсходникамРасширения Из НастройкиКонфигурации.ПутьКИсходникамРасширений Цикл
		Попытка
			ПрочитатьСведенияОбъектаXML(ПутьКИсходникамРасширения + ИмяФайлаБезКаталога, Результат, НастройкиКонфигурации.ЭтоИсходникиEDT, ОписанияТипов);
			
			Если ИмяФайлаПредопределенныхБезКаталога <> Неопределено Тогда
				ПрочитатьОписаниеПредопределенныхXML(ПутьКИсходникамРасширения + ИмяФайлаПредопределенныхБезКаталога, Результат.Данные, ИмяКоллекции, Маппинг);
			КонецЕсли;
		Исключение
			Инфо = ИнформацияОбОшибке();
		КонецПопытки;
	КонецЦикла;
	
	Если Результат.ИмяОбъектаМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПрочитатьОбъектыКоллекцииXML(Коллекция, ИмяКаталогаКоллекции, ЭтоОбщиеМодули, ЭтоИсходникиEDT)
	
	РазделительПути = ПолучитьРазделительПути();
	
	Если ЭтоИсходникиEDT Тогда
		НайденныеФайлы = НайтиФайлы(ИмяКаталогаКоллекции, "*.mdo", Истина);
	Иначе
		НайденныеФайлы = НайтиФайлы(ИмяКаталогаКоллекции, "*.xml", Ложь);
	КонецЕсли;
	
	Для Каждого НайденныйФайл Из НайденныеФайлы Цикл
		
		ЭлементСписка = Коллекция.Добавить(НайденныйФайл.ИмяБезРасширения);
		
		Если ЭтоОбщиеМодули Тогда
			// Для общих модулей дополнительно нужно прочитать признак "Глобальный"
			Если ЭтоИсходникиEDT Тогда
				ПолноеИмяФайла = СтрШаблон("%2%1%3%1%3.mdo", РазделительПути, ИмяКаталогаКоллекции, НайденныйФайл.ИмяБезРасширения);
			Иначе
				ПолноеИмяФайла = СтрШаблон("%2%1%3.xml", РазделительПути, ИмяКаталогаКоллекции, НайденныйФайл.ИмяБезРасширения);
			КонецЕсли;
			
			ОписаниеОбъекта = Новый Структура("Global", "false");
			ПрочитатьКраткиеСведенияОбъектаXML(ПолноеИмяФайла, ОписаниеОбъекта, ЭтоИсходникиEDT);
			
			ЭлементСписка.Пометка = Булево(ОписаниеОбъекта.Global);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьКраткиеСведенияОбъектаXML(ПолноеИмяФайла, ОписаниеОбъекта, ЭтоИсходникиEDT)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
	
	ЧтениеXML.Прочитать();
	
	Если ЭтоИсходникиEDT Тогда
		ЧтениеXML.Прочитать(); // mdclass:Объект
	Иначе
		ЧтениеXML.Прочитать(); // MetaDataObject
		ЧтениеXML.Прочитать(); // Объект
	КонецЕсли;
	
	Если ЭтоУзелXML(ЧтениеXML, "InternalInfo") ИЛИ ЭтоУзелXML(ЧтениеXML, "producedTypes") Тогда
		ЧтениеXML.Пропустить(); // InternalInfo или producedTypes
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
	ОсталосьСвойств = ОписаниеОбъекта.Количество();
	
	Если НЕ ЭтоИсходникиEDT Тогда
		ПрочитатьСвойстваXML(ЧтениеXML, ОписаниеОбъекта, ОсталосьСвойств);
	КонецЕсли;
	
	Если ОсталосьСвойств <> 0 Тогда
	
		Пока НЕ ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Цикл
			ЗначениеПоУмолчанию = Неопределено;
			Если ЭтоИсходникиEDT И ОписаниеОбъекта.Свойство(ЧтениеXML.Имя, ЗначениеПоУмолчанию) Тогда
				ПрочитатьСвойствоСтруктурыXML(ЧтениеXML, ОписаниеОбъекта, ОсталосьСвойств);
				Если ОсталосьСвойств = 0 Тогда
					Прервать;
				КонецЕсли;
			Иначе
				ЧтениеXML.Пропустить();
				ЧтениеXML.Прочитать();
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ЧтениеXML.Закрыть();
	
КонецПроцедуры

Процедура ПрочитатьСведенияОбъектаXML(ПолноеИмяФайла, Результат, ЭтоИсходникиEDT, ОписанияТипов)
	
	// TODO Поддержка расширения типа в расширениях
	
	Файл = Новый Файл(ПолноеИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	
	Попытка
		ЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
		
		ОписаниеРеквизитов = рк_РедакторКодаКлиентСервер.СвойствоСтруктуры(Результат.Данные, "properties", Новый Структура);
		ОписаниеРесурсов = рк_РедакторКодаКлиентСервер.СвойствоСтруктуры(Результат.Данные, "resources", Новый Структура);
		ОписаниеТабличныхЧастей = рк_РедакторКодаКлиентСервер.СвойствоСтруктуры(Результат.Данные, "tabulars", Новый Структура);
		ОписаниеПредопределенных = рк_РедакторКодаКлиентСервер.СвойствоСтруктуры(Результат.Данные, "predefined", Новый Структура);
		
		// Значения по умолчанию
		СлужебныеДанные = Новый Структура;
		СлужебныеДанные.Вставить("Name");
		СлужебныеДанные.Вставить("Hierarchical", Ложь);
		СлужебныеДанные.Вставить("HierarchyType");
		СлужебныеДанные.Вставить("Type", Новый Массив);
		СлужебныеДанные.Вставить("Owners", Новый Массив);
		СлужебныеДанные.Вставить("CodeLength", 0);
		СлужебныеДанные.Вставить("DescriptionLength", 0);
		СлужебныеДанные.Вставить("RegisterType");
		СлужебныеДанные.Вставить("InformationRegisterPeriodicity");
		СлужебныеДанные.Вставить("WriteMode");
		СлужебныеДанные.Вставить("Correspondence", Ложь);
		СлужебныеДанные.Вставить("ActionPeriod", Ложь);
		СлужебныеДанные.Вставить("BasePeriod", Ложь);
		СлужебныеДанные.Вставить("ActionPeriodUse", Ложь);
		СлужебныеДанные.Вставить("ChartOfAccounts");

		ЧтениеXML.Прочитать();
		
		Если ЭтоИсходникиEDT Тогда
			ЧтениеXML.Прочитать(); // mdclass:Объект
			
			ИменаГрупп = Новый Структура;
			ИменаГрупп.Вставить("Атрибуты", "attributes");
			ИменаГрупп.Вставить("Измерения", "dimensions");
			ИменаГрупп.Вставить("Ресурсы", "resources");
			ИменаГрупп.Вставить("ТЧ", "tabularSections");
		Иначе
			ЧтениеXML.Прочитать(); // MetaDataObject
			ЧтениеXML.Прочитать(); // Объект
			
			ИменаГрупп = Новый Структура;
			ИменаГрупп.Вставить("Атрибуты", "Attribute");
			ИменаГрупп.Вставить("Измерения", "Dimension");
			ИменаГрупп.Вставить("Ресурсы", "Resource");
			ИменаГрупп.Вставить("ТЧ", "TabularSection");
		КонецЕсли;
		
		ЧтениеXML.Пропустить(); // InternalInfo или producedTypes
		ЧтениеXML.Прочитать();
		
		Если НЕ ЭтоИсходникиEDT Тогда
			ПрочитатьСвойстваXML(ЧтениеXML, СлужебныеДанные);
		КонецЕсли;
		
		Пока НЕ ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Цикл
			ЗначениеПоУмолчанию = Неопределено;
			Если ЭтоИсходникиEDT И СлужебныеДанные.Свойство(ЧтениеXML.Имя, ЗначениеПоУмолчанию) Тогда
				ПрочитатьСвойствоСтруктурыXML(ЧтениеXML, СлужебныеДанные);
			ИначеЕсли ЭтоУзелXML(ЧтениеXML, ИменаГрупп.Атрибуты) Тогда
				ПрочитатьАтрибутыXML(ЧтениеXML, ОписаниеРеквизитов, ОписанияТипов, ИменаГрупп.Атрибуты)
			ИначеЕсли ЭтоУзелXML(ЧтениеXML, ИменаГрупп.Измерения) Тогда
				ПрочитатьАтрибутыXML(ЧтениеXML, ОписаниеРеквизитов, ОписанияТипов, ИменаГрупп.Измерения)
			ИначеЕсли ЭтоУзелXML(ЧтениеXML, ИменаГрупп.Ресурсы) Тогда
				ПрочитатьАтрибутыXML(ЧтениеXML, ОписаниеРесурсов, ОписанияТипов, ИменаГрупп.Ресурсы);
			ИначеЕсли ЭтоУзелXML(ЧтениеXML, ИменаГрупп.ТЧ) Тогда
				ПрочитатьТабличныеЧастиXML(ЧтениеXML, ОписаниеРеквизитов, ОписаниеТабличныхЧастей, ОписанияТипов, ИменаГрупп.ТЧ, ИменаГрупп.Атрибуты);
			ИначеЕсли ЧтениеXML.Имя = "ChildObjects" Тогда
				ЧтениеXML.Прочитать();
			ИначеЕсли ЭтоИсходникиEDT И ЭтоУзелXML(ЧтениеXML, "predefined") Тогда
				ПрочитатьПредопределенныеXML(ЧтениеXML, ОписаниеПредопределенных, "items", ОписанияТипов);
				ЧтениеXML.Прочитать();
			Иначе
				ЧтениеXML.Пропустить();
				ЧтениеXML.Прочитать();
			КонецЕсли;
		КонецЦикла;
		
		ЧтениеXML.Закрыть();
	Исключение
		Инфо = ИнформацияОбОшибке();
		Возврат;
	КонецПопытки;
	
	ЗаполнитьСтандартныеРеквизитыXML(ОписаниеРеквизитов, СлужебныеДанные, ОписанияТипов, Результат.ИмяКоллекцииРедактора);
	
	Если ОписанияТипов.ИмяКоллекцииМетаданных = "РегистрыСведений" Тогда
		
		Если СлужебныеДанные.InformationRegisterPeriodicity = "Nonperiodical" Тогда
			ТипРегистра = "nonperiodical";
		Иначе
			ТипРегистра = "periodical";
		КонецЕсли;
		Результат.Данные.Вставить("type", ТипРегистра);
		
	ИначеЕсли ОписанияТипов.ИмяКоллекцииМетаданных = "РегистрыНакопления" Тогда
		
		Если СлужебныеДанные.RegisterType = "Turnovers" Тогда
			ТипРегистра = "turnovers";
		Иначе
			ТипРегистра = "balance";
		КонецЕсли;
		Результат.Данные.Вставить("type", ТипРегистра);
	КонецЕсли;
	
	Если ОписаниеРеквизитов.Количество() > 0 Тогда
		Результат.Данные.Вставить("properties", ОписаниеРеквизитов);
	КонецЕсли;
	Если ОписаниеРесурсов.Количество() > 0 Тогда
		Результат.Данные.Вставить("resources", ОписаниеРесурсов);
	КонецЕсли;
	Если ОписаниеТабличныхЧастей.Количество() > 0 Тогда
		Результат.Данные.Вставить("tabulars", ОписаниеТабличныхЧастей);
	КонецЕсли;
	Если ОписаниеПредопределенных.Количество() > 0 Тогда
		Результат.Данные.Вставить("predefined", ОписаниеПредопределенных);
	КонецЕсли;
	
	Результат.ИмяОбъектаМетаданных = СлужебныеДанные.Name;
	
КонецПроцедуры

Функция ПрочитатьОписанияВсехОбщихРеквизитовXML(НастройкиКонфигурации)
	
	ОбщиеРеквизитыОбъектов = Новый Структура;
	
	Если НЕ НастройкиКонфигурации.ВнешниеМетаданные Тогда
		Возврат ОбщиеРеквизитыОбъектов;
	КонецЕсли;
	
	Если НастройкиКонфигурации.ЭтоИсходникиEDT Тогда
		НайденныеФайлы = НайтиФайлы(СтрШаблон("%2src%1CommonAttributes", ПолучитьРазделительПути(), НастройкиКонфигурации.ПутьКИсходникамКонфигурации), "*.mdo", Истина);
	Иначе
		НайденныеФайлы = НайтиФайлы(СтрШаблон("%1CommonAttributes", НастройкиКонфигурации.ПутьКИсходникамКонфигурации), "*.xml", Ложь);
	КонецЕсли;
	
	Для Каждого НайденныйФайл Из НайденныеФайлы Цикл
		Попытка
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.ОткрытьФайл(НайденныйФайл.ПолноеИмя);
			
			Если НастройкиКонфигурации.ЭтоИсходникиEDT Тогда
				ЧтениеXML.Прочитать();
				ЧтениеXML.Прочитать(); // mdclass:Объект
				
				ИмяУзлаСостава = "content";
			Иначе
				ЧтениеXML.Прочитать(); // MetaDataObject
				ЧтениеXML.Прочитать(); // Объект
				ЧтениеXML.Прочитать(); // CommonAttribute
				ЧтениеXML.Прочитать(); // Properties
				
				ИмяУзлаСостава = "Content";
			КонецЕсли;
			
			ОбъектИспользование = Неопределено;
			
			ОписаниеЭлемента = Новый Структура("Name,Synonym,Type");
			ОписаниеЭлемента.Вставить("AutoUse", "Use");
			ОсталосьСвойств = ОписаниеЭлемента.Количество();
			СоставРеквизита = Новый Соответствие;
			
			Пока НЕ ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Цикл
				Если ЭтоУзелXML(ЧтениеXML, ИмяУзлаСостава) Тогда
					Если НастройкиКонфигурации.ЭтоИсходникиEDT Тогда
						Пока ЭтоУзелXML(ЧтениеXML, ИмяУзлаСостава) Цикл
							ЧтениеXML.Прочитать();
							
							ЭлементМетаданные = ПрочитатьЗначениеXML(ЧтениеXML);
							ЭлементИспользование = ПрочитатьЗначениеXML(ЧтениеXML);
							СоставРеквизита.Вставить(ЭлементМетаданные, ЭлементИспользование = "Use");
							
							ЧтениеXML.Прочитать();
						КонецЦикла;
					Иначе
						ЧтениеXML.Прочитать();
						Пока НЕ ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Цикл
							ЧтениеXML.Прочитать();
							
							ЭлементМетаданные = ПрочитатьЗначениеXML(ЧтениеXML);
							ЭлементИспользование = ПрочитатьЗначениеXML(ЧтениеXML);
							СоставРеквизита.Вставить(ЭлементМетаданные, ЭлементИспользование = "Use");
							
							ЧтениеXML.Пропустить(); // ConditionalSeparation
							ЧтениеXML.Прочитать();
							ЧтениеXML.Прочитать();
						КонецЦикла;
						ЧтениеXML.Прочитать();
					КонецЕсли;
				Иначе
					ПрочитатьСвойствоСтруктурыXML(ЧтениеXML, ОписаниеЭлемента, ОсталосьСвойств);
					Если ОсталосьСвойств = 0 Тогда
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ОписаниеРеквизита = Новый Структура;
			ОписаниеРеквизита.Вставить("Состав", Новый Соответствие);
			ОписаниеРеквизита.Вставить("АвтоИспользование", ОписаниеЭлемента.AutoUse = "Use");
			ОписаниеРеквизита.Вставить("Синоним", ОписаниеЭлемента.Synonym);
			ОписаниеРеквизита.Вставить("Тип", ОписаниеЭлемента.Type);
			
			Для Каждого КлючИЗначение Из СоставРеквизита Цикл
				Если ОписаниеРеквизита.АвтоИспользование <> КлючИЗначение.Значение Тогда
					ОписаниеРеквизита.Состав.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
				КонецЕсли;
			КонецЦикла;
			
			ОбщиеРеквизитыОбъектов.Вставить(ОписаниеЭлемента.Name, ОписаниеРеквизита);
		Исключение
			Инфо = ИнформацияОбОшибке();
		КонецПопытки;
	КонецЦикла;
	
	Возврат ОбщиеРеквизитыОбъектов;
	
КонецФункции

Процедура ЗаполнитьОбщиеРеквизитыXML(ВсеОбщиеРеквизиты, Результат, ОписанияТипов)
	
	ОписаниеСвойств = рк_РедакторКодаКлиентСервер.СвойствоСтруктуры(Результат.Данные, "properties", Новый Структура);
	
	ПолноеИмяОбъекта = СтрШаблон("%1.%2", МаппингЕдEng(ОписанияТипов.ИмяКоллекцииМетаданных, ОписанияТипов.Маппинг), Результат.ИмяОбъектаМетаданных);
	Для Каждого КлючИЗначение Из ВсеОбщиеРеквизиты Цикл
		ОписаниеРеквизита = КлючИЗначение.Значение;
		ИспользованиеОбъекта = ОписаниеРеквизита.Состав[ПолноеИмяОбъекта];
		
		Если (ОписаниеРеквизита.АвтоИспользование И ИспользованиеОбъекта <> Ложь)
		 ИЛИ (НЕ ОписаниеРеквизита.АвтоИспользование И ИспользованиеОбъекта <> Истина) Тогда
			ДобавитьРеквизитXML(ОписаниеСвойств, ОписанияТипов, КлючИЗначение.Ключ, ОписаниеРеквизита.Синоним, ОписаниеРеквизита.Тип);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Данные.Вставить("properties", ОписаниеСвойств);
	
КонецПроцедуры

Процедура ПрочитатьОписаниеПредопределенныхXML(ПолноеИмяФайла, Результат, ИмяКоллекции, Маппинг)
	
	Файл = Новый Файл(ПолноеИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПредопределенных = рк_РедакторКодаКлиентСервер.СвойствоСтруктуры(Результат.Данные, "predefined", Новый Структура);
	
	ЧтениеXML = Новый ЧтениеXML;
	
	Попытка
		ЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
		ЧтениеXML.Прочитать();
		
		ПрочитатьПредопределенныеXML(ЧтениеXML, ОписаниеПредопределенных, "Item", МаппингМнRus(ИмяКоллекции, Маппинг));
		
		ЧтениеXML.Закрыть();
	Исключение
		Возврат;
	КонецПопытки;
	
	Результат.Данные.Вставить("predefined", ОписаниеПредопределенных);
	
КонецПроцедуры

Процедура ПрочитатьСвойстваXML(ЧтениеXML, ОписаниеЭлемента, ОсталосьСвойств = Неопределено)
	
	Если ЭтоУзелXML(ЧтениеXML, "Properties") Тогда
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
	Если ОсталосьСвойств = Неопределено Тогда
		Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
			ПрочитатьСвойствоСтруктурыXML(ЧтениеXML, ОписаниеЭлемента);
		КонецЦикла;
	Иначе
		Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
			Если ОсталосьСвойств = 0 Тогда
				Возврат;
			КонецЕсли;
			ПрочитатьСвойствоСтруктурыXML(ЧтениеXML, ОписаниеЭлемента, ОсталосьСвойств);
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтоКонецУзлаXML(ЧтениеXML, "Properties") Тогда
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьПредопределенныеXML(ЧтениеXML, СтруктураПредопределенных, ИмяГруппы, ОписанияТипов)
	
	ЧтениеXML.Прочитать(); // PredefinedData или predefined
	
	Пока ЭтоУзелXML(ЧтениеXML, ИмяГруппы) Цикл
		ЧтениеXML.Прочитать();
		
		ОписаниеЭлемента = Новый Структура("IsFolder,Name,Code", Ложь);
		ПрочитатьСвойстваXML(ЧтениеXML, ОписаниеЭлемента);
		Если НЕ ОписаниеЭлемента.IsFolder Тогда
			Если ОписанияТипов.ИмяКоллекцииМетаданных = "ПланыСчетов" Тогда
				СтруктураПредопределенных.Вставить(ОписаниеЭлемента.Name, СтрШаблон("%1 (%2)", ОписаниеЭлемента.Name, ОписаниеЭлемента.Code));
			Иначе
				СтруктураПредопределенных.Вставить(ОписаниеЭлемента.Name, "");
			КонецЕсли;
		КонецЕсли;
		
		ЧтениеXML.Прочитать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьАтрибутыXML(ЧтениеXML, СтруктураРеквизитов, ОписанияТипов, ИмяГруппы)
	
	Пока ЭтоУзелXML(ЧтениеXML, ИмяГруппы) Цикл
		ЧтениеXML.Прочитать();
		
		ОписаниеЭлемента = Новый Структура("Name,Synonym,Type");
		ПрочитатьСвойстваXML(ЧтениеXML, ОписаниеЭлемента);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, ОписаниеЭлемента.Name, ОписаниеЭлемента.Synonym, ОписаниеЭлемента.Type);
		
		ЧтениеXML.Прочитать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьТабличныеЧастиXML(ЧтениеXML, СтруктураРеквизитов, СтруктураТЧ, ОписанияТипов, ИмяГруппыТЧ, ИмяГруппыАтрибуты)
	
	Пока ЭтоУзелXML(ЧтениеXML, ИмяГруппыТЧ) Цикл
		ЧтениеXML.Прочитать();
		
		ЧтениеXML.Пропустить(); // InternalInfo или producedTypes
		ЧтениеXML.Прочитать();
		
		ОписаниеТЧ = Новый Структура("Name,Synonym");
		ОписаниеРеквизитовТЧ = Неопределено;
		Пока НЕ ЭтоКонецУзлаXML(ЧтениеXML, ИмяГруппыТЧ) Цикл
			Если ЭтоУзелXML(ЧтениеXML, ИмяГруппыАтрибуты) Тогда
				ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, ОписаниеТЧ.Name, "ТЧ: " + ОписаниеТЧ.Synonym, Неопределено);
				
				ОписаниеРеквизитовТЧ = Новый Структура;
				ПрочитатьАтрибутыXML(ЧтениеXML, ОписаниеРеквизитовТЧ, ОписанияТипов, ИмяГруппыАтрибуты);
				СтруктураТЧ.Вставить(ОписаниеТЧ.Name, Новый Структура("properties", ОписаниеРеквизитовТЧ));
				
				ОписаниеТЧ = Новый Структура("Name,Synonym");
				
			ИначеЕсли ЧтениеXML.Имя = "Properties" Тогда
				ЧтениеXML.Прочитать();
			ИначеЕсли ЧтениеXML.Имя = "ChildObjects" Тогда
				ЧтениеXML.Прочитать();
			Иначе
				ПрочитатьСвойствоСтруктурыXML(ЧтениеXML, ОписаниеТЧ);
			КонецЕсли;
		КонецЦикла;
		ЧтениеXML.Прочитать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, ИмяРеквизита, СинонимРеквизита, ТипыРеквизита)
	
	ОписаниеТипаРеквизита = "";
	
	Если ТипЗнч(ТипыРеквизита) = Тип("Строка") Тогда
		// Явно заданный готовый тип
		ОписаниеТипаРеквизита = ТипыРеквизита;
		
	ИначеЕсли ТипыРеквизита <> Неопределено Тогда
		// Прочитанный из XML массив типов
		МассивТипов = Новый Массив;
		Для Каждого ТипСвойства Из ТипыРеквизита Цикл
			
			ОбработанныйТип = ОписанияТипов.Типы[ТипСвойства];
			Если ОбработанныйТип <> Неопределено Тогда
				МассивТипов.Добавить(ОбработанныйТип);
				Продолжить;
			КонецЕсли;
			
			ПозТочки = СтрНайти(ТипСвойства, ".");
			Если ПозТочки > 0 Тогда
				Имя = Сред(ТипСвойства, ПозТочки + 1);
				КорневойТип = Лев(ТипСвойства, ПозТочки - 1);
				Если СтрНачинаетсяС(КорневойТип, "cfg:") Тогда
					КорневойТип = Сред(КорневойТип, 5);
				КонецЕсли; 
				Если СтрЗаканчиваетсяНа(КорневойТип, "Ref") Тогда
					КорневойТип = Лев(КорневойТип, СтрДлина(КорневойТип) - 3);
				КонецЕсли; 
				ИмяДляРедактораEд = МаппингConsole(КорневойТип, ОписанияТипов.Маппинг);
				Если ИмяДляРедактораEд <> Неопределено Тогда
					ОбработанныйТип = ИмяДляРедактораEд + "." + Имя;
					МассивТипов.Добавить(ОбработанныйТип);
					ОписанияТипов.Типы[ТипСвойства] = ОбработанныйТип;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если МассивТипов.Количество() > 0 Тогда
			ОписаниеТипаРеквизита = СтрСоединить(МассивТипов, ",");
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеРеквизита = Новый Структура("name", СинонимРеквизита);
	
	Если НЕ ПустаяСтрока(ОписаниеТипаРеквизита) Тогда
		ОписаниеРеквизита.Вставить("ref", ОписаниеТипаРеквизита);
	КонецЕсли;
	
	СтруктураРеквизитов.Вставить(ИмяРеквизита, ОписаниеРеквизита);
	
КонецПроцедуры

Процедура ЗаполнитьСтандартныеРеквизитыXML(СтруктураРеквизитов, СлужебныеДанные, ОписанияТипов, ИмяКоллекцииРедактора)
	
	СсылкаНаОбъект = ИмяКоллекцииРедактора + "." + СлужебныеДанные.Name;
	
	Если СлужебныеДанные.CodeLength > 0 Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Код", "", Неопределено);
	КонецЕсли;
	
	Если СлужебныеДанные.DescriptionLength > 0 Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Наименование", "", Неопределено);
	КонецЕсли;
	
	Если СлужебныеДанные.Owners.Количество() > 0 Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Владелец", "", СлужебныеДанные.Owners);
	КонецЕсли;
	
	Если СлужебныеДанные.Hierarchical Тогда
		Если СлужебныеДанные.HierarchyType <> "HierarchyOfItems" Тогда
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ЭтоГруппа", "", Неопределено);
		КонецЕсли;
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Родитель", "", СсылкаНаОбъект);
	КонецЕсли;
	
	Если ОписанияТипов.ИмяКоллекцииМетаданных = "Документы" Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Ссылка", "", СсылкаНаОбъект);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Проведен", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ПометкаУдаления", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Дата", "", Неопределено);
		
	ИначеЕсли ОписанияТипов.ИмяКоллекцииМетаданных = "Справочники" Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Ссылка", "", СсылкаНаОбъект);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ПометкаУдаления", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Предопределенный", "", Неопределено);
		
	ИначеЕсли ОписанияТипов.ИмяКоллекцииМетаданных = "ПланыВидовХарактеристик" Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Ссылка", "", СсылкаНаОбъект);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ПометкаУдаления", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Предопределенный", "", Неопределено);
		Если СлужебныеДанные.Type.Количество() > 0 Тогда
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ТипЗначения", "", Неопределено);
		КонецЕсли;
		
	ИначеЕсли ОписанияТипов.ИмяКоллекцииМетаданных = "БизнесПроцессы" Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Ссылка", "", СсылкаНаОбъект);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Стартован", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Завершен", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ВедущаяЗадача", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Дата", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ПометкаУдаления", "", Неопределено);
		
	ИначеЕсли ОписанияТипов.ИмяКоллекцииМетаданных = "Задачи" Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Ссылка", "", СсылкаНаОбъект);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Выполнена", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Дата", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ПометкаУдаления", "", Неопределено);
		
	ИначеЕсли ОписанияТипов.ИмяКоллекцииМетаданных = "РегистрыБухгалтерии" Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Период", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Активность", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Регистратор", "", Неопределено);
		
		Если СлужебныеДанные.Correspondence Тогда
			ТипПланСчетов = Новый Массив;
			ТипПланСчетов.Добавить(СлужебныеДанные.ChartOfAccounts);
			
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "СчетДт", "", ТипПланСчетов);
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "СчетКт", "", ТипПланСчетов);
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "СубконтоДт", "", Неопределено);
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "СубконтоКт", "", Неопределено);
		Иначе
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Счет", "", ТипПланСчетов);
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Субконто", "", Неопределено);
		КонецЕсли;
		
	ИначеЕсли ОписанияТипов.ИмяКоллекцииМетаданных = "РегистрыНакопления" Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Период", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Активность", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Регистратор", "", Неопределено);
		Если СлужебныеДанные.RegisterType = "Balance" Тогда
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ВидДвижения", "", Неопределено);
		КонецЕсли;
		
	ИначеЕсли ОписанияТипов.ИмяКоллекцииМетаданных = "РегистрыСведений" Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Активность", "", Неопределено);
		Если СлужебныеДанные.InformationRegisterPeriodicity <> "Nonperiodical" Тогда
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Период", "", Неопределено);
		КонецЕсли;
		Если СлужебныеДанные.WriteMode = "RecorderSubordinate" Тогда
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Регистратор", "", Неопределено);
		КонецЕсли;
		
	ИначеЕсли ОписанияТипов.ИмяКоллекцииМетаданных = "РегистрыРасчета" Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ПериодРегистрации", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Активность", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Сторно", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Регистратор", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ВидРасчета", "", Неопределено);
		Если СлужебныеДанные.ActionPeriod Тогда
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ПериодДействия", "", Неопределено);
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ПериодДействияНачало", "", Неопределено);
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ПериодДействияКонец", "", Неопределено);
		КонецЕсли;
		Если СлужебныеДанные.BasePeriod Тогда
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "БазовыйПериодНачало", "", Неопределено);
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "БазовыйПериодКонец", "", Неопределено);
		КонецЕсли;
		
	ИначеЕсли ОписанияТипов.ИмяКоллекцииМетаданных = "ПланыВидовРасчета" Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Ссылка", "", СсылкаНаОбъект);
		Если СлужебныеДанные.ActionPeriodUse Тогда
			ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ПериодДействияБазовый", "", Неопределено);
		КонецЕсли;
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ПометкаУдаления", "", Неопределено);
		
	ИначеЕсли ОписанияТипов.ИмяКоллекцииМетаданных = "ПланыОбмена" Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Ссылка", "", СсылкаНаОбъект);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ПометкаУдаления", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ЭтотУзел", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "НомерОтправленного", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "НомерПринятого", "", Неопределено);
		
	ИначеЕсли ОписанияТипов.ИмяКоллекцииМетаданных = "ПланыСчетов" Тогда
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Ссылка", "", СсылкаНаОбъект);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Забалансовый", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "ПометкаУдаления", "", Неопределено);
		ДобавитьРеквизитXML(СтруктураРеквизитов, ОписанияТипов, "Предопределенный", "", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоУзелXML(ЧтениеXML, ИмяУзла)
	Возврат ЧтениеXML.Имя = ИмяУзла И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента;
КонецФункции

Функция ЭтоКонецУзлаXML(ЧтениеXML, ИмяУзла)
	Возврат ЧтениеXML.Имя = ИмяУзла И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента;
КонецФункции

Процедура ПрочитатьСвойствоСтруктурыXML(ЧтениеXML, ОписаниеЭлемента, ОсталосьСвойств = 0)
	
	ИмяЭлемента = ЧтениеXML.Имя;
	ЗначениеПоУмолчанию = Неопределено;
	Если ОписаниеЭлемента.Свойство(ИмяЭлемента, ЗначениеПоУмолчанию) Тогда
		Если НРег(ИмяЭлемента) = "synonym" Тогда
			ПрочитатьМультистрокуXML(ЧтениеXML, ОписаниеЭлемента, "ru", ОсталосьСвойств);
		ИначеЕсли НРег(ИмяЭлемента) = "type" Тогда
			ПрочитатьТипыXML(ЧтениеXML, ОписаниеЭлемента, ОсталосьСвойств);
		ИначеЕсли НРег(ИмяЭлемента) = "owners" Тогда
			ПрочитатьВладельцевXML(ЧтениеXML, ОписаниеЭлемента, ОсталосьСвойств);
		Иначе
			ОписаниеЭлемента.Вставить(ИмяЭлемента, ПрочитатьЗначениеXML(ЧтениеXML, ЗначениеПоУмолчанию));
			ОсталосьСвойств = ОсталосьСвойств - 1;
		КонецЕсли;
	Иначе
		ЧтениеXML.Пропустить();
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПрочитатьЗначениеXML(ЧтениеXML, ЗначениеПоУмолчанию = Неопределено)
	
	ИмяЭлемента = ЧтениеXML.Имя;
	
	Значение = ЗначениеПоУмолчанию;
	Пока НЕ ЭтоКонецУзлаXML(ЧтениеXML, ИмяЭлемента) Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			Значение = ЧтениеXML.Значение;
		КонецЕсли;
		ЧтениеXML.Прочитать();
	КонецЦикла;
	ЧтениеXML.Прочитать();
	
	Если ЗначениеПоУмолчанию <> Неопределено Тогда
		Значение = XMLЗначение(ТипЗнч(ЗначениеПоУмолчанию), Значение);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Процедура ПрочитатьМультистрокуXML(ЧтениеXML, СтруктураДляЗначения, КодЯзыка, ОсталосьСвойств)
	
	ИмяЭлемента = ЧтениеXML.Имя;
	ЧтениеXML.Прочитать();
	
	Значение = "";
	Пока НЕ ЭтоКонецУзлаXML(ЧтениеXML, ИмяЭлемента) Цикл
		Если ЧтениеXML.Имя = "v8:item" Тогда
			ЧтениеXML.Прочитать();
		Иначе
			langKey = ПрочитатьЗначениеXML(ЧтениеXML);
			contentValue = ПрочитатьЗначениеXML(ЧтениеXML);
			Если langKey = КодЯзыка Тогда
				Значение = contentValue;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЧтениеXML.Прочитать();
	
	СтруктураДляЗначения.Вставить(ИмяЭлемента, Значение);
	ОсталосьСвойств = ОсталосьСвойств - 1;
	
КонецПроцедуры

Процедура ПрочитатьВладельцевXML(ЧтениеXML, СтруктураДляЗначения, ОсталосьСвойств)
	
	ИмяЭлемента = ЧтениеXML.Имя;
	
	МассивТипов = Новый Массив;
	Пока ЭтоУзелXML(ЧтениеXML, ИмяЭлемента) Цикл
		ЧтениеXML.Прочитать();
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			ЧтениеXML.Прочитать();
			Прервать;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			// Формат EDT
			МассивТипов.Добавить(ЧтениеXML.Значение);
			ЧтениеXML.Прочитать();
			ЧтениеXML.Прочитать();
		Иначе
			// Формат XML
			МассивТипов.Добавить(ПрочитатьЗначениеXML(ЧтениеXML));
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДляЗначения.Вставить(ИмяЭлемента, МассивТипов);
	ОсталосьСвойств = ОсталосьСвойств - 1;
	
КонецПроцедуры

Процедура ПрочитатьТипыXML(ЧтениеXML, СтруктураДляЗначения, ОсталосьСвойств)
	
	ИмяЭлемента = ЧтениеXML.Имя;
	ЧтениеXML.Прочитать();
	
	МассивТипов = Новый Массив;
	Пока НЕ ЭтоКонецУзлаXML(ЧтениеXML, ИмяЭлемента) Цикл
		Если ЭтоУзелXML(ЧтениеXML, "v8:Type") ИЛИ ЭтоУзелXML(ЧтениеXML, "types") Тогда
			МассивТипов.Добавить(ПрочитатьЗначениеXML(ЧтениеXML));
		Иначе
			ЧтениеXML.Пропустить();
			ЧтениеXML.Прочитать();
		КонецЕсли;
	КонецЦикла;
	ЧтениеXML.Прочитать();
	
	СтруктураДляЗначения.Вставить(ИмяЭлемента, МассивТипов);
	ОсталосьСвойств = ОсталосьСвойств - 1;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область ПользовательскийКонтекст

Функция НовыйТипЗначения(ТипЗначения)
	
	ОписаниеЗначения = Новый Структура;
	
	Если ТипЗнч(ТипЗначения) = Тип("Строка") Тогда
		ОписаниеЗначения.Вставить("ref", ТипЗначения);
	ИначеЕсли ТипЗначения = Тип("Структура") Тогда
		ОписаниеЗначения.Вставить("ref", "classes.Структура");
	ИначеЕсли ТипЗначения = Тип("Массив") Тогда
		ОписаниеЗначения.Вставить("ref", "classes.Массив");
	ИначеЕсли ТипЗначения = Тип("Соответствие") Тогда
		ОписаниеЗначения.Вставить("ref", "classes.Соответствие");
	ИначеЕсли ТипЗначения = Тип("ТаблицаЗначений") Тогда
		ОписаниеЗначения.Вставить("ref", "classes.ТаблицаЗначений");
	КонецЕсли;
	
	Возврат ОписаниеЗначения;
	
КонецФункции

Функция НовоеЗначение(ЗначениеПеременной, Знач УровеньВложенности)
	
	ОписаниеЗначения = НовыйТипЗначения(ТипЗнч(ЗначениеПеременной));
	
	Если ТипЗнч(ЗначениеПеременной) = Тип("Структура") И ЗначениеПеременной.Количество() > 0 Тогда
		
		УровеньВложенности = УровеньВложенности + 1;
		Если УровеньВложенности < 4 Тогда
			
			ОписаниеЗначения.Вставить("properties", Новый Структура);
			Для Каждого КлючИЗначение Из ЗначениеПеременной Цикл
				ОписаниеЗначения.properties.Вставить(КлючИЗначение.Ключ, НовоеЗначение(КлючИЗначение.Значение, УровеньВложенности));
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОписаниеЗначения;
	
КонецФункции

#КонецОбласти

#КонецОбласти
