Перем КД3_КэшМетаданных;

&После("ПередНачаломРаботыСистемы")
Процедура КД3_ПередНачаломРаботыСистемы()
	
	КД3_КэшМетаданных = Новый Соответствие;
	
	КД3_МетаданныеКлиент.ИзвлечьИсходники();
	
КонецПроцедуры

Функция КД3_Кэш() Экспорт
	
	Возврат КД3_КэшМетаданных;
	
КонецФункции

&После("ПередЗавершениемРаботыСистемы")
Процедура КД3_ПередЗавершениемРаботыСистемы(Отказ)
	
	Для Каждого КлючИЗначение Из КД3_КэшМетаданных Цикл
		Если КлючИЗначение.Ключ = "КаталогИсходников" Тогда
			УдалитьФайлы(КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
