Функция МаппингИменМетаданных() Экспорт
	
	МнRus = Новый Соответствие;
	ЕдEng = Новый Соответствие;
	МнEng = Новый Соответствие;
	console = Новый Соответствие;
	ЕстьПредопределенные = Новый Соответствие;
	ЕстьОбщиеРеквизиты = Новый Соответствие;
	ЕстьТЧ = Новый Соответствие;
	
	МнEng["общиемодули"]   = "CommonModules";
	console["общиемодули"] = "commonModules";
	
	ЕдEng["общиереквизиты"] = "CommonAttribute";
	МнEng["общиереквизиты"] = "CommonAttributes";
	
	//
	
	МнRus["планыобмена"]   = "ПланыОбмена";
	МнRus["планобмен"]   = "ПланыОбмена";
	ЕдEng["планыобмена"]   = "ExchangePlan";
	МнEng["планыобмена"]   = "ExchangePlans";
	console["планыобмена"] = "exchangePlans";
	
	ЕстьОбщиеРеквизиты["планыобмена"] = Истина;
	ЕстьТЧ["планыобмена"] = Истина;
	
	МнRus["справочники"]   = "Справочники";
	МнRus["справочник"]   = "Справочники";
	ЕдEng["справочники"]   = "Catalog";
	МнEng["справочники"]   = "Catalogs";
	console["справочники"] = "catalogs";
	
	ЕстьПредопределенные["планыобмена"] = Истина;
	ЕстьОбщиеРеквизиты["планыобмена"] = Истина;
	ЕстьТЧ["планыобмена"] = Истина;
	
	МнRus["документы"]   = "Документы";
	МнRus["документ"]   = "Документы";
	ЕдEng["документы"]   = "Document";
	МнEng["документы"]   = "Documents";
	console["документы"] = "documents";
	
	ЕстьОбщиеРеквизиты["документы"] = Истина;
	ЕстьТЧ["документы"] = Истина;
	
	МнRus["перечисления"]   = "Перечисления";
	МнRus["перечисление"]   = "Перечисления";
	ЕдEng["перечисления"]   = "Enum";
	МнEng["перечисления"]   = "Enums";
	console["перечисления"] = "enums";
	
	ЕдEng["планывидовхарактеристик"]   = "ChartOfCharacteristicTypes";
	МнEng["планывидовхарактеристик"]   = "ChartsOfCharacteristicTypes";
	console["планывидовхарактеристик"] = "chartsOfCharacteristicTypes";
	
	ЕстьПредопределенные["планывидовхарактеристик"] = Истина;
	ЕстьОбщиеРеквизиты["планывидовхарактеристик"] = Истина;
	ЕстьТЧ["планывидовхарактеристик"] = Истина;
	
	МнRus["планысчетов"]   = "ПланыСчетов";
	МнRus["плансчетов"]   = "ПланыСчетов";
	ЕдEng["планысчетов"]   = "ChartOfAccounts";
	МнEng["планысчетов"]   = "ChartsOfAccounts";
	console["планысчетов"] = "сhartsOfAccounts";
	
	ЕстьПредопределенные["планысчетов"] = Истина;
	ЕстьОбщиеРеквизиты["планысчетов"] = Истина;
	ЕстьТЧ["планысчетов"] = Истина;
	
	МнRus["планывидоврасчета"]   = "ПланыВидовРасчета";
	МнRus["планвидоврасчета"]   = "ПланыВидовРасчета";
	ЕдEng["планывидоврасчета"]   = "ChartOfCalculationTypes";
	МнEng["планывидоврасчета"]   = "ChartsOfCalculationTypes";
	console["планывидоврасчета"] = "chartsOfCalculationTypes";
	
	ЕстьПредопределенные["планывидоврасчета"] = Истина;
	ЕстьОбщиеРеквизиты["планывидоврасчета"] = Истина;
	ЕстьТЧ["планывидоврасчета"] = Истина;
	
	МнRus["регистрысведений"]   = "РегистрыСведений";
	МнRus["регистрсведений"]   = "РегистрыСведений";
	ЕдEng["регистрысведений"]   = "InformationRegister";
	МнEng["регистрысведений"]   = "InformationRegisters";
	console["регистрысведений"] = "infoRegs";
	
	МнRus["регистрынакопления"]   = "РегистрыНакопления";
	МнRus["регистрнакопления"]   = "РегистрыНакопления";
	ЕдEng["регистрынакопления"]   = "AccumulationRegister";
	МнEng["регистрынакопления"]   = "AccumulationRegisters";
	console["регистрынакопления"] = "accumRegs";
	
	МнRus["регистрыбухгалтерии"]   = "РегистрыБухгалтерии";
	МнRus["регистрбухгалтерии"]   = "РегистрыБухгалтерии";
	ЕдEng["регистрыбухгалтерии"]   = "AccountingRegister";
	МнEng["регистрыбухгалтерии"]   = "AccountingRegisters";
	console["регистрыбухгалтерии"] = "accountRegs";
	
	МнRus["регистрырасчета"]   = "РегистрыРасчета";
	МнRus["регистррасчета"]   = "РегистрыРасчета";
	ЕдEng["регистрырасчета"]   = "CalculationRegister";
	МнEng["регистрырасчета"]   = "CalculationRegisters";
	console["регистрырасчета"] = "calcRegs";
	
	МнRus["бизнеспроцессы"]   = "БизнесПроцессы";
	МнRus["бизнеспроцесс"]   = "БизнесПроцессы";
	ЕдEng["бизнеспроцессы"]   = "BusinessProcess";
	МнEng["бизнеспроцессы"]   = "BusinessProcesses";
	console["бизнеспроцессы"] = "businessProcesses";
	
	ЕстьОбщиеРеквизиты["бизнеспроцессы"] = Истина;
	ЕстьТЧ["бизнеспроцессы"] = Истина;
	
	МнRus["задачи"]   = "Задачи";
	МнRus["задача"]   = "Задачи";
	ЕдEng["задачи"]   = "Task";
	МнEng["задачи"]   = "Tasks";
	console["задачи"] = "tasks";
	
	ЕстьОбщиеРеквизиты["задачи"] = Истина;
	ЕстьТЧ["задачи"] = Истина;
	
	МнRus["обработки"]   = "Обработки";
	МнRus["обработка"]   = "Обработки";
	ЕдEng["обработки"]   = "DataProcessor";
	МнEng["обработки"]   = "DataProcessors";
	console["обработки"] = "dataProc";
	
	МнRus["отчеты"]   = "Отчеты";
	МнRus["отчет"]   = "Отчеты";
	ЕдEng["отчеты"]   = "Report";
	МнEng["отчеты"]   = "Reports";
	console["отчеты"] = "reports";
	
	Маппинг = Новый Структура;
	
	Маппинг.Вставить("МнRus", МнRus);
	Маппинг.Вставить("ЕдEng", ЕдEng);
	Маппинг.Вставить("МнEng", МнEng);
	Маппинг.Вставить("console", console);
	Маппинг.Вставить("ЕстьПредопределенные", ЕстьПредопределенные);
	Маппинг.Вставить("ЕстьОбщиеРеквизиты", ЕстьОбщиеРеквизиты);
	Маппинг.Вставить("ЕстьТЧ", ЕстьТЧ);
	
	Возврат Маппинг;
	
КонецФункции