
&НаКлиенте
&Вместо("ОкончаниеЗагрузкиКонфигурации")
Процедура КД3_ОкончаниеЗагрузкиКонфигурации()
	РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата);
	Если РезультатЗагрузки Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка структуры конфигурации выполнена успешно'"));
		//+КД3
		Если КД3_МетаданныеКлиент.ИспользоватьКонтекстнуюПодсказку() И СпособЗагрузки = 1 Тогда
			КД3_МетаданныеКлиент.ПриЗагрузкеМетаданныхКонфигурации(Объект.Конфигурация);
		КонецЕсли;
		//-КД3
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка структуры конфигурации не выполнена'"));
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Основная;
	ИзменитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры
