
&НаКлиенте
Перем КД3_ИзмененныйРеквизит Экспорт;

&НаСервере
Процедура КД3_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Обработчики = Новый СписокЗначений;
	Обработчики.Добавить("ТекстЗапроса", , Объект.ИспользуетсяПриЗагрузке);
	
	КД3_Метаданные.ПриСозданииНаСервере(ЭтотОбъект, Отказ, Ложь, Обработчики, Элементы.ТекстЗапроса);
	
	Элементы.КД3_Конфигурация.Доступность = НЕ Объект.ИспользуетсяПриЗагрузке;
	Элементы.КД3_КонфигурацияКорреспондент.Доступность = Объект.ИспользуетсяПриЗагрузке;
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_ПриОткрытииПосле(Отказ)
	КД3_МетаданныеКлиент.ПриСменеСтраницы(ЭтотОбъект, "ТекстЗапроса");
КонецПроцедуры

&НаКлиенте
Процедура КД3_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	КД3_МетаданныеКлиент.ПередЗаписью(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура КД3_ИспользуетсяПриЗагрузкеПриИзмененииПосле(Элемент)
	
	ЭтотОбъект.КД3_Обработчики[0].Пометка = Объект.ИспользуетсяПриЗагрузке;
	
	Элементы.КД3_Конфигурация.Доступность = НЕ Объект.ИспользуетсяПриЗагрузке;
	Элементы.КД3_КонфигурацияКорреспондент.Доступность = Объект.ИспользуетсяПриЗагрузке;
	
	КД3_МетаданныеКлиент.ОбновитьМетаданныеКонфигурации(ЭтотОбъект, Объект.ИспользуетсяПриЗагрузке);
КонецПроцедуры

&НаСервере
&После("ОбработкаВыбораНаСервере")
Процедура КД3_ОбработкаВыбораНаСервере()
	КД3_Метаданные.ПриИзмененииКонвертаций(ЭтотОбъект, Ложь);
КонецПроцедуры

&НаСервере
&После("ДополнитьСоставКонвертации")
Процедура КД3_ДополнитьСоставКонвертации(Конвертация, ЭлементКонвертации, ОтказДобавления)
	Если НЕ ОтказДобавления Тогда
		КД3_Метаданные.ПриИзмененииКонвертаций(ЭтотОбъект, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ПриИзмененииКонфигурации(Элемент)
	КД3_МетаданныеКлиент.ОбновитьМетаданныеКонфигурации(ЭтотОбъект, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ПриИзмененииКонфигурацииКорреспондента(Элемент)
	КД3_МетаданныеКлиент.ОбновитьМетаданныеКонфигурации(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ДокументСформирован(Элемент)
	ИмяОбработчика = Сред(Элемент.Имя, 5);
	КД3_МетаданныеКлиент.ИнициализацияРедактора(ЭтотОбъект, Элемент.Имя);
	КД3_МетаданныеКлиент.УстановитьТекст(ЭтотОбъект, Элемент.Имя, Объект[ИмяОбработчика]);
	КД3_МетаданныеКлиент.ОповещатьОбИзменениях(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_HTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	КД3_МетаданныеКлиент.ОбработатьСобытиеHTML(ЭтотОбъект, Элемент, ДанныеСобытия);
КонецПроцедуры
