
#Область ПрограммныйИнтерфейс

// Проверяет версию платформы 1С на соответствие требуемой
//
// Параметры:
//  ТребуемаяВерсия - Строка - версия в формате "X.Y.Z"
//
// Возвращаемое значение:
// Булево - Истина, если номер ерсии платформы 1С больше или равна требуемой
//
Функция СравнитьВерсиюПлатформы(ТребуемаяВерсия) Экспорт
	
	Инфо = Новый СистемнаяИнформация;
	
	ЧастиВерсии1 = СтрРазделить(Инфо.ВерсияПриложения, ".");
	ЧастиВерсии2 = СтрРазделить(ТребуемаяВерсия, ".");
	
	Для НомРазряда = 0 По 2 Цикл
		Разница = Число(ЧастиВерсии1[НомРазряда]) - Число(ЧастиВерсии2[НомРазряда]);
		Если Разница <> 0 Тогда
			Возврат Разница >= 0;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция НормализоватьИмяЭлемента(ИмяИлиЭлемент) Экспорт
	
	Если ИмяИлиЭлемент = Неопределено Тогда
		ИмяЭлемента = Неопределено;
	ИначеЕсли ТипЗнч(ИмяИлиЭлемент) = Тип("Строка") Тогда
		ИмяЭлемента = ИмяИлиЭлемент;
	Иначе
		ИмяЭлемента = ИмяИлиЭлемент.Имя;
	КонецЕсли;
	
	Возврат ИмяЭлемента;
	
КонецФункции

Функция СвойствоСтруктуры(Коллекция, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Перем ЗначениеСвойства;
	
	Если Коллекция.Свойство(ИмяСвойства, ЗначениеСвойства) Тогда
		Возврат ЗначениеСвойства;
	КонецЕсли;
	
	Коллекция.Вставить(ИмяСвойства, ЗначениеПоУмолчанию);
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

Функция ИменаСлужебныхРеквизитов() Экспорт
	
	ОписаниеРеквизитов = Новый Структура;
	
	ОписаниеРеквизитов.Вставить("Редакторы", Новый Структура("Имя,Тип", "рк_Редакторы", Новый ОписаниеТипов("СписокЗначений")));
	ОписаниеРеквизитов.Вставить("ОбщиеПараметры", Новый Структура("Имя,Тип", "рк_Параметры", Новый ОписаниеТипов())); // Произвольный - Структура
	
	Возврат ОписаниеРеквизитов;
	
КонецФункции

Функция ОбщиеПараметры(Форма) Экспорт
	
	ИмяРеквизита = ИменаСлужебныхРеквизитов().ОбщиеПараметры.Имя;
	Попытка
		ОбщиеПараметры = Форма[ИмяРеквизита];
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Если ОбщиеПараметры = Неопределено Тогда
		ОбщиеПараметры = Новый Структура;
		
		ОбщиеПараметры.Вставить("ГлобальныеНастройки", Истина);
		ОбщиеПараметры.Вставить("ОбщиеРеквизиты", Новый Соответствие);
		ОбщиеПараметры.Вставить("ГлобальныйКонтекст", Новый Соответствие);
		ОбщиеПараметры.Вставить("НастройкиКонфигурации", Новый Соответствие);
		
		Форма[ИмяРеквизита] = ОбщиеПараметры;
	КонецЕсли;
	
	Возврат ОбщиеПараметры;
	
КонецФункции

Функция ПараметрыВсехРедакторов(Форма) Экспорт
	
	Попытка
		Возврат Форма[ИменаСлужебныхРеквизитов().Редакторы.Имя];
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПараметрыРедактора(Форма, Редактор = Неопределено) Экспорт
	
	Если ТипЗнч(Редактор) = Тип("Структура") Тогда
		Возврат Редактор;
	КонецЕсли;
	
	ПараметрыРедакторов = ПараметрыВсехРедакторов(Форма);
	Если ПараметрыРедакторов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Редактор = Неопределено Тогда
		// Получение единственного редактора
		Если ПараметрыРедакторов.Количество() <> 1 Тогда
			ПараметрыРедактора = Неопределено;
		Иначе
			ПараметрыРедактора = ПараметрыРедакторов[0].Значение;
		КонецЕсли;
		Возврат ПараметрыРедактора;
	КонецЕсли;
	
	// Поиск редактора с совпадающим именем среди всех редакторов
	ИмяЭлементаHTML = НормализоватьИмяЭлемента(Редактор);
	Для Каждого ЭлементСписка Из ПараметрыРедакторов Цикл
		Если ЭлементСписка.Значение.ИмяЭлементаHTML = ИмяЭлементаHTML Тогда
			Возврат ЭлементСписка.Значение;
		КонецЕсли;
	КонецЦикла;
	
	// Добавление нового редактора кода
	ПараметрыРедактора = Новый Структура;
	
	ПараметрыРедактора.Вставить("ИмяЭлементаHTML", ИмяЭлементаHTML);
	ПараметрыРедактора.Вставить("РеквизитHTML");
	ПараметрыРедактора.Вставить("Конфигурация"); // Произвольный тип для идентификации конфигурации
	
	// Удаляемые флаги инициализации
	ПараметрыРедактора.Вставить("ФлагНетВебСтраницы"); // Для редактора не установлена веб-страница
	ПараметрыРедактора.Вставить("ФлагНеИнициализирован"); // Для редактора не выполнен обработчик ДокуменСформирован
	ПараметрыРедактора.Вставить("ФлагНетМетаданных"); // Для редактора не загружен глобальный контекст
	
	// Временные опции
	//ПараметрыРедактора.Вставить("ИмяЭлементаСтраница"); // Устанавливается в ОбработчикПриСозданииНаСервере, Удаляется в УстановитьВебСтраницуРедактора
	//ПараметрыРедактора.Вставить("РежимЯзыка");          // Устанавливается в ОбработчикПриСозданииНаСервере, Удаляется в ИнициализироватьРедактор
	
	ПараметрыРедакторов.Добавить(ПараметрыРедактора);
	
	Возврат ПараметрыРедактора;
	
КонецФункции

// Нормализует путь к исходникам (добавляет разделитель в конце)
//
Функция НормализоватьПутьФайла(Путь) Экспорт
	
	Если ПустаяСтрока(Путь) Тогда
		Возврат Путь;
	КонецЕсли;
	
	НовыйПуть = СокрЛП(Путь);
	РазделительПути = ПолучитьРазделительПути();
	
	Если НЕ СтрЗаканчиваетсяНа(НовыйПуть, РазделительПути) Тогда
		НовыйПуть = НовыйПуть + РазделительПути;
	КонецЕсли;
	
	Возврат НовыйПуть;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
