
Функция ИспользоватьРедакторКода() Экспорт
	Если ОбщегоНазначения.ЭтоВебКлиент() Тогда
		Возврат Ложь;
	Иначе
		Настройки = НастройкиПоУмолчанию();
		СохраненноеЗначение = ХранилищеОбщихНастроек.Загрузить("КД3_Настройки", "ИспользоватьРедакторКода");
		Возврат ?(СохраненноеЗначение = Неопределено, Настройки.ИспользоватьРедакторКода, СохраненноеЗначение);
	КонецЕсли;
КонецФункции

Функция ИспользоватьКонтекстнуюПодсказку() Экспорт
	Настройки = НастройкиПоУмолчанию();
	СохраненноеЗначение = ХранилищеОбщихНастроек.Загрузить("КД3_Настройки", "ИспользоватьКонтекстнуюПодсказку");
	Возврат ?(СохраненноеЗначение = Неопределено, Настройки.ИспользоватьРедакторКода, СохраненноеЗначение);
КонецФункции

Функция ЗагрузитьНастройки() Экспорт
	Настройки = НастройкиПоУмолчанию();
	Для Каждого КлючИЗначение Из Настройки Цикл
		НовоеЗначение = ХранилищеОбщихНастроек.Загрузить("КД3_Настройки", КлючИЗначение.Ключ);
		Если НовоеЗначение <> Неопределено Тогда
			Настройки.Вставить(КлючИЗначение.Ключ, НовоеЗначение);
		КонецЕсли;
	КонецЦикла;
	Возврат Настройки;
КонецФункции

Процедура СохранитьНастройки(ТекущиеНастройки) Экспорт
	Настройки = НастройкиПоУмолчанию();
	ЗаполнитьЗначенияСвойств(Настройки, ТекущиеНастройки);
	Для Каждого КлючИЗначение Из Настройки Цикл
		ХранилищеОбщихНастроек.Сохранить("КД3_Настройки", КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
КонецПроцедуры

Функция НастройкиПоУмолчанию() Экспорт
	Настройки = Новый Структура;
	Настройки.Вставить("Тема", "bsl-white");
	Настройки.Вставить("ИспользоватьРедакторКода", Истина);
	Настройки.Вставить("ИспользоватьКонтекстнуюПодсказку", Истина);
	Настройки.Вставить("ОтображатьКартуКода", Ложь);
	Настройки.Вставить("ПодсветкаЯзыкаЗапросов", Ложь);
	Настройки.Вставить("УдалятьВременныеФайлыПриЗакрытии", Истина);
	Настройки.Вставить("ОтображатьНомераСтрок", Истина);
	Возврат Настройки;
КонецФункции

Функция ВерсияКонсолиКода() Экспорт
	ОписаниеВерсии = Новый Структура("Информация,Версия,ПодкаталогИсходников");
	ДанныеМакета = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("КД3_bsl_console");
	Если ДанныеМакета = Неопределено Тогда
		ОписаниеВерсии.Вставить("Информация", "Загружена из макета");
		ОписаниеВерсии.Вставить("Версия", Метаданные.ОбщиеМакеты.КД3_src.Комментарий);
	Иначе
		ЗаполнитьЗначенияСвойств(ОписаниеВерсии, ДанныеМакета);
	КонецЕсли;
	ОписаниеВерсии.Вставить("ПодкаталогИсходников", ПодкаталогИсходников());
	Возврат ОписаниеВерсии;
КонецФункции

Функция ДвоичныеДанныеКонсолиКода() Экспорт
	ДанныеАрхива = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("КД3_bsl_console");
	Если ДанныеАрхива = Неопределено Тогда
		ДвоичныеДанные = ПолучитьОбщийМакет("КД3_src"); 		
	Иначе
		ДвоичныеДанные = ДанныеАрхива.ДвоичныеДанные; 
	КонецЕсли;
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
КонецФункции

Процедура УстановитьВерсиюКонсолиКода(АдресМакета, ИсточникИнфо = Неопределено) Экспорт
	Если АдресМакета = Неопределено Тогда
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища("КД3_bsl_console");
	Иначе
		ДанныеМакета = Новый Структура;
		ДанныеМакета.Вставить("ДвоичныеДанные", ПолучитьИзВременногоХранилища(АдресМакета));
		ДанныеМакета.Вставить("Информация", "Загружена из " + ИсточникИнфо);
		ДанныеМакета.Вставить("Версия", Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMddhhmmss;"));
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("КД3_bsl_console", ДанныеМакета);
	КонецЕсли;
КонецПроцедуры

Функция ПодкаталогИсходников()
	// Получение уникального идентификатора текущей ИБ
	ДанныеИБ = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("КД3", "ДанныеИБ");
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	Если ДанныеИБ = Неопределено ИЛИ ДанныеИБ.СтрокаСоединения <> СтрокаСоединения Тогда
		ДанныеИБ = Новый Структура("СтрокаСоединения,ИД", СтрокаСоединения, СтрЗаменить(Новый УникальныйИдентификатор, "-", ""));		
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("КД3", ДанныеИБ, "ДанныеИБ");
	КонецЕсли;
	Возврат "bsl_console_" + ДанныеИБ.ИД;
КонецФункции
