
&НаСервере
Процедура КД3_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если НЕ КД3_Метаданные.ИспользоватьРедакторКода() Тогда
		Возврат;
	КонецЕсли;
	
	Обработчики = Новый СписокЗначений;
	
	Если ЭтоКонвертацияXDTO Тогда
		Обработчики.Добавить("АлгоритмПриОтправкеДанных");
		Обработчики.Добавить("АлгоритмПередПолучениемДанных");
		Обработчики.Добавить("АлгоритмПриПолученииДанных");
		Обработчики.Добавить("АлгоритмПослеЗагрузкиВсехДанныхТекст");
		СтраницыОбработчиков = Элементы.ОбработчикиXDTO;
	Иначе
		Обработчики.Добавить("АлгоритмПередВыгрузкойОбъекта");
		Обработчики.Добавить("АлгоритмПриВыгрузкеОбъекта");
		Обработчики.Добавить("АлгоритмПослеВыгрузкиОбъекта");
		Обработчики.Добавить("АлгоритмПослеВыгрузкиОбъектаВФайлОбмена");
		Обработчики.Добавить("АлгоритмПоследовательностьПолейПоиска", , Истина);
		Обработчики.Добавить("АлгоритмПередЗагрузкойОбъекта", , Истина);
		Обработчики.Добавить("АлгоритмПриЗагрузкеОбъекта", , Истина);
		Обработчики.Добавить("АлгоритмПослеЗагрузкиОбъекта", , Истина);
		СтраницыОбработчиков = Элементы.ОбработчикиXML;
	КонецЕсли;
	КД3_Метаданные.ПриСозданииНаСервере(ЭтотОбъект, Отказ, ЭтоКонвертацияXDTO, Обработчики, СтраницыОбработчиков);
	
	Если ЭтоКонвертацияXDTO И НЕ Объект.ИспользоватьДляОтправки Тогда
		// Исправление текущей страницы на видимую при этих условиях
		Элементы.ОбработчикиXDTO.ТекущаяСтраница = Элементы.Страница_ПриКонвертацииДанныхXDTO;
	КонецЕсли;
	
	Элементы.Страницы.УстановитьДействие("ПриСменеСтраницы", "КД3_Подключаемый_СтраницыПриСменеСтраницы");
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	КД3_МетаданныеКлиент.ПередЗаписью(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура КД3_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	КД3_МетаданныеКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр);
КонецПроцедуры

&НаКлиенте
Процедура КД3_АлгоритмПослеЗагрузкиВсехДанныхПриИзмененииПосле(Элемент)
	Если НЕ КД3_МетаданныеКлиент.ИспользоватьРедакторКода() Тогда
		Возврат;
	КонецЕсли;
	КД3_МетаданныеКлиент.УстановитьТекстПриТолькоПросмотр(ЭтотОбъект,
		"КД3_АлгоритмПослеЗагрузкиВсехДанныхТекст", АлгоритмПослеЗагрузкиВсехДанныхТекст);
КонецПроцедуры

&НаСервере
&После("ОбработкаВыбораНаСервере")
Процедура КД3_ОбработкаВыбораНаСервере()
	КД3_Метаданные.ПриИзмененииКонвертаций(ЭтотОбъект, ЭтоКонвертацияXDTO);
КонецПроцедуры

&НаСервере
&После("ДополнитьСоставКонвертации")
Процедура КД3_ДополнитьСоставКонвертации(Конвертация, ЭлементКонвертации, ОтказДобавления)
	Если НЕ ОтказДобавления Тогда
		КД3_Метаданные.ПриИзмененииКонвертаций(ЭтотОбъект, ЭтоКонвертацияXDTO);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&После("УстановитьВидимость")
Процедура КД3_УстановитьВидимость()
	Если НЕ КД3_МетаданныеКлиент.ИспользоватьРедакторКода() Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоКонвертацияXDTO Тогда
		Элементы.АлгоритмПослеЗагрузкиВсехДанныхТекст.Видимость = Ложь;
		Элементы.КД3_АлгоритмПослеЗагрузкиВсехДанныхТекст.Видимость = ЗначениеЗаполнено(АлгоритмПослеЗагрузкиВсехДанныхСсылка)
			И ПоказатьТекстАлгоритмаПослеЗагрузкиВсехДанных;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.Страница_ОбработчикиXDTO Тогда
		КД3_МетаданныеКлиент.ПриСменеСтраницы(ЭтотОбъект, Элементы.ОбработчикиXDTO.ТекущаяСтраница);
	ИначеЕсли ТекущаяСтраница = Элементы.Страница_ОбработчикиXML Тогда
		КД3_МетаданныеКлиент.ПриСменеСтраницы(ЭтотОбъект, Элементы.ОбработчикиXML.ТекущаяСтраница);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ОбработчикиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	КД3_МетаданныеКлиент.ПриСменеСтраницы(ЭтотОбъект, ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ПриИзмененииКонфигурации(Элемент)
	КД3_МетаданныеКлиент.ОбновитьМетаданныеКонфигурации(ЭтотОбъект, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ПриИзмененииКонфигурацииКорреспондента(Элемент)
	КД3_МетаданныеКлиент.ОбновитьМетаданныеКонфигурации(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ДокументСформирован(Элемент)
	ИмяОбработчика = Сред(Элемент.Имя, 5);
	КД3_МетаданныеКлиент.ИнициализацияРедактора(ЭтотОбъект, Элемент.Имя);
	Если Элемент.ТолькоПросмотр Тогда
		КД3_МетаданныеКлиент.УстановитьТекст(ЭтотОбъект, Элемент.Имя, ЭтотОбъект[ИмяОбработчика]);
		КД3_МетаданныеКлиент.УстановитьТолькоПросмотр(ЭтотОбъект, Элемент.Имя, Истина);
	Иначе
		КД3_МетаданныеКлиент.УстановитьТекст(ЭтотОбъект, Элемент.Имя, Объект[ИмяОбработчика]);
		КД3_МетаданныеКлиент.ОповещатьОбИзменениях(ЭтотОбъект, Элемент.Имя);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_HTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	КД3_МетаданныеКлиент.ОбработатьСобытиеHTML(ЭтотОбъект, Элемент, ДанныеСобытия);
КонецПроцедуры
