
&НаКлиенте
Перем КД3_ИзмененныйРеквизит Экспорт;

&НаСервере
Процедура КД3_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Обработчики = Новый СписокЗначений;
	Обработчики.Добавить("АлгоритмПередОбработкойПравила");
	Обработчики.Добавить("АлгоритмПриОбработкеДополнительныйПравила");
	Обработчики.Добавить("АлгоритмПриОбработкеПравила");
	Обработчики.Добавить("АлгоритмПослеОбработкиПравила");
	КД3_Метаданные.ПриСозданииНаСервере(ЭтотОбъект, Отказ, Ложь, Обработчики, Элементы.СтраницыТекстОбработчиков);
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	КД3_МетаданныеКлиент.ПередЗаписью(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура КД3_ГруппаСтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаОбработчики Тогда
		КД3_СтраницыТекстОбработчиковПриСменеСтраницыПосле(Элементы.СтраницыТекстОбработчиков, Элементы.СтраницыТекстОбработчиков.ТекущаяСтраница);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КД3_СтраницыТекстОбработчиковПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаПередОбработкой Тогда
		ИмяОбработчика = "АлгоритмПередОбработкойПравила";
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаПриОбработкеДоп Тогда
		ИмяОбработчика = "АлгоритмПриОбработкеДополнительныйПравила";
		КД3_МетаданныеКлиент.ПриСменеСтраницы(ЭтотОбъект, ИмяОбработчика);
		ИмяОбработчика = "АлгоритмПриОбработкеПравила";
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаПослеОбработки Тогда
		ИмяОбработчика = "АлгоритмПослеОбработкиПравила";
	Иначе
		Возврат;
	КонецЕсли;
	КД3_МетаданныеКлиент.ПриСменеСтраницы(ЭтотОбъект, ИмяОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ПриИзмененииКонфигурации(Элемент)
	КД3_МетаданныеКлиент.ОбновитьМетаданныеКонфигурации(ЭтотОбъект, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ДокументСформирован(Элемент)
	ИмяОбработчика = Сред(Элемент.Имя, 5);
	КД3_МетаданныеКлиент.ИнициализацияРедактора(ЭтотОбъект, Элемент.Имя);
	КД3_МетаданныеКлиент.УстановитьТекст(ЭтотОбъект, Элемент.Имя, Объект[ИмяОбработчика]);
	КД3_МетаданныеКлиент.ОповещатьОбИзменениях(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_HTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	КД3_МетаданныеКлиент.ОбработатьСобытиеHTML(ЭтотОбъект, Элемент, ДанныеСобытия);
КонецПроцедуры
