
&НаСервере
Процедура КД3_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если НЕ КД3_Метаданные.ИспользоватьРедакторКода() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоКонвертацияXDTO Тогда
		Обработчики = Новый СписокЗначений;
		Обработчики.Добавить("АлгоритмПередВыгрузкойСвойства");
		Обработчики.Добавить("АлгоритмПриВыгрузкеСвойства");
		Обработчики.Добавить("АлгоритмПослеВыгрузкиСвойства");
		СтраницыОбработчиков = Элементы.СтраницыОбработчики;
		КД3_Метаданные.ПриСозданииНаСервере(ЭтотОбъект, Отказ, ЭтоКонвертацияXDTO, Обработчики, СтраницыОбработчиков);
	КонецЕсли;
	
	Элементы.ГруппаXML.УстановитьДействие("ПриСменеСтраницы", "КД3_Подключаемый_ГруппаXMLПриСменеСтраницы");
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_ПриОткрытииПосле(Отказ)
	Если НЕ ЭтоКонвертацияXDTO Тогда
		КД3_МетаданныеКлиент.ПриСменеСтраницы(ЭтотОбъект, Элементы.СтраницыОбработчики.ТекущаяСтраница);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КД3_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	Если НЕ ЭтоКонвертацияXDTO Тогда
		КД3_МетаданныеКлиент.ПередЗаписью(ЭтотОбъект, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КД3_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	КД3_МетаданныеКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ГруппаXMLПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.Обработчики Тогда
		КД3_МетаданныеКлиент.ПриСменеСтраницы(ЭтотОбъект, Элементы.СтраницыОбработчики.ТекущаяСтраница);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ОбработчикиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	КД3_МетаданныеКлиент.ПриСменеСтраницы(ЭтотОбъект, ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ПриИзмененииКонфигурации(Элемент)
	КД3_МетаданныеКлиент.ОбновитьМетаданныеКонфигурации(ЭтотОбъект, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_ДокументСформирован(Элемент)
	ИмяОбработчика = Сред(Элемент.Имя, 5);
	КД3_МетаданныеКлиент.ИнициализацияРедактора(ЭтотОбъект, Элемент.Имя);
	КД3_МетаданныеКлиент.УстановитьТекст(ЭтотОбъект, Элемент.Имя, Объект[ИмяОбработчика]);
	КД3_МетаданныеКлиент.ОповещатьОбИзменениях(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КД3_Подключаемый_HTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	КД3_МетаданныеКлиент.ОбработатьСобытиеHTML(ЭтотОбъект, Элемент, ДанныеСобытия);
КонецПроцедуры
