
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройки = КД3_Метаданные.ЗагрузитьНастройки();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки);
	Элементы.ГруппаНастройки.Доступность = ИспользоватьРедакторКода;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Настройки = ЗаписатьНастройкиНаСервере();
	КД3_МетаданныеКлиент.СохранитьНастройкиВКэше(Настройки);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНастройкиНаСервере()
	
	Настройки = КД3_Метаданные.НастройкиПоУмолчанию();
	ЗаполнитьЗначенияСвойств(Настройки, ЭтотОбъект);
	КД3_Метаданные.СохранитьНастройки(Настройки);
	Возврат Настройки;
	
КонецФункции

&НаКлиенте
Процедура ИспользоватьРедакторКодаПриИзменении(Элемент)
	Если НЕ ИспользоватьРедакторКода Тогда
		ИспользоватьКонтекстнуюПодсказку = Ложь;
	КонецЕсли;
	Элементы.ГруппаНастройки.Доступность = ИспользоватьРедакторКода;
КонецПроцедуры
