
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройки = КД3_Метаданные.ЗагрузитьНастройки();
	Тема                  = Настройки.Тема;
	НеЗагружатьМетаданные = Настройки.НеЗагружатьМетаданные;
	НеОтображатьКартуКода = Настройки.НеОтображатьКартуКода;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьНастройкиНаСервере();
	// Сохранение настроек в клиентском кэше
	КД3_МетаданныеКлиент.СохранитьНастройкиВКэше(ЭтотОбъект);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()
	
	Настройки = Новый Структура;
	Настройки.Вставить("Тема",                  Тема);
	Настройки.Вставить("НеЗагружатьМетаданные", НеЗагружатьМетаданные);
	Настройки.Вставить("НеОтображатьКартуКода", НеОтображатьКартуКода);
	
	КД3_Метаданные.СохранитьНастройки(Настройки);
	
КонецПроцедуры
