
#Область ОбработчикиЭлементовФормы

&НаСервере
Процедура КД3_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	рк_РедакторКода.КД3_ОбработчикПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура КД3_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	рк_РедакторКода.ОбработчикПриЧтенииНаСервере(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КД3_ПриОткрытииПосле(Отказ)
	рк_РедакторКодаКлиент.КД3_ОбработчикПриОткрытии(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КД3_ОбработчикОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	рк_РедакторКодаКлиент.КД3_ОбработчикОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

&НаКлиенте
Процедура КД3_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	Если рк_РедакторКодаКлиент.ОбработчикПередЗаписью(ЭтотОбъект) Тогда
		ОбновитьИндикациюОбработчиков();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КД3_СтраницыОбработчикиПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	рк_РедакторКодаКлиент.ОбработчикПриСменеСтраницы(ЭтотОбъект, ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КД3_ОбработчикОжиданияПроверитьИзменениеОбъекта() Экспорт
	Если рк_РедакторКодаКлиент.ПроверитьИзменениеОбъекта(ЭтотОбъект, Объект.ВерсияДанных) Тогда
		ОбновитьИндикациюОбработчиков();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовHTML

&НаКлиенте
Процедура Подключаемый_рк_ДокументСформирован(Элемент)
	рк_РедакторКодаКлиент.ОбработчикДокументСформирован(ЭтотОбъект, Элемент, Истина);
	ПодключитьОбработчикОжидания("КД3_ОбработчикОжиданияДокументСформированОтложено", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КД3_ОбработчикОжиданияДокументСформированОтложено()
	рк_РедакторКодаКлиент.ОбработчикДокументСформированОтложено(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_рк_ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ОбработчикиСобытий = Новый Соответствие;
	ОбработчикиСобытий["EVENT_CONTENT_MODIFIED"] = Новый ОписаниеОповещения("КД3_ОбработчикСобытияContentModified", ЭтотОбъект, Элемент.Имя);
	
	рк_РедакторКодаКлиент.ОбработчикПриНажатии(ЭтотОбъект, Элемент, ДанныеСобытия, ОбработчикиСобытий);
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_ОбработчикСобытияContentModified(Событие, ИмяЭлементаHTML) Экспорт
	
	ПараметрыРедактора = рк_РедакторКодаКлиентСервер.ПараметрыРедактора(ЭтотОбъект, ИмяЭлементаHTML);
	Если ПустаяСтрока(рк_РедакторКодаКлиент.ПолучитьЗначениеРеквизитаТекст(ЭтотОбъект, ПараметрыРедактора)) Тогда
		// Заполненние текста обработчика для включения видимости зеленой галочки у обработчика. Окончательный текст будет заполнен перед записью
		рк_РедакторКодаКлиент.УстановитьЗначениеРеквизитаТекст(ЭтотОбъект, ПараметрыРедактора, "-");
		ОбновитьИндикациюОбработчиков();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
